47.25 - Торговля розничная напитками в специализированных магазинах
47.25.1 - Торговля розничная алкогольными напитками, включая пиво, в специализированных магазинах
47.25.11 - Торговля розничная алкогольными напитками, кроме пива, в специализированных магазинах
47.25.12 - Торговля розничная пивом в специализированных магазинах
47.25.2 - Торговля розничная безалкогольными напитками в специализированных магазинах
47.26 - Торговля розничная табачными изделиями в специализированных магазинах
47.29 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах
47.29.1 - Торговля розничная молочными продуктами и яйцами в специализированных магазинах
47.29.11 - Торговля розничная молочными продуктами в специализированных магазинах
47.29.12 - Торговля розничная яйцами в специализированных магазинах
47.29.2 - Торговля розничная пищевыми маслами и жирами в специализированных магазинах
47.29.21 - Торговля розничная животными маслами и жирами в специализированных магазинах
47.29.22 - Торговля розничная растительными маслами в специализированных магазинах
47.29.3 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах
47.29.31 - Торговля розничная мукой и макаронными изделиями в специализированных магазинах
47.29.32 - Торговля розничная крупами в специализированных магазинах
47.29.33 - Торговля розничная сахаром в специализированных магазинах
47.29.34 - Торговля розничная солью в специализированных магазинах
47.29.35 - Торговля розничная чаем, кофе, какао в специализированных магазинах
47.29.36 - Торговля розничная гомогенизированными пищевыми продуктами, детским и диетическим питанием в специализированных магазинах
47.29.39 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах, не включенными в другие группировки

47.3 - Торговля розничная моторным топливом в специализированных магазинах
47.30 - Торговля розничная моторным топливом в специализированных магазинах
47.30.1 - Торговля розничная моторным топливом в специализированных магазинах
47.30.11 - Торговля розничная бензином и дизельным топливом в специализированных магазинах
47.30.12 - Торговля розничная газом для заправки автомобилей в специализированных магазинах
47.30.2 - Торговля розничная смазочными материалами и охлаждающими жидкостями для автотранспортных средств
47.4 - Торговля розничная информационным и коммуникационным оборудованием в специализированных магазинах
47.41 - Торговля розничная компьютерами, периферийными устройствами к ним и программным обеспечением в специализированных магазинах
47.41.1 - Торговля розничная компьютерами в специализированных магазинах
47.41.2 - Торговля розничная программным обеспечением в специализированных магазинах
47.41.3 - Торговля розничная периферийными устройствами в специализированных магазинах
47.41.4 - Торговля розничная офисными машинами и оборудованием в специализированных магазинах
47.42 - Торговля розничная телекоммуникационным оборудованием, включая розничную торговлю мобильными телефонами, в специализированных магазинах
47.43 - Торговля розничная аудио- и видеотехникой в специализированных магазинах
47.5 - Торговля розничная прочими бытовыми изделиями в специализированных магазинах
47.51 - Торговля розничная текстильными изделиями в специализированных магазинах
47.51.1 - Торговля розничная текстильными изделиями в специализированных магазинах
47.51.2 - Торговля розничная галантерейными изделиями в специализированных магазинах
47.52 - Торговля розничная скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах
47.52.1 - Торговля розничная скобяными изделиями в специализированных магазинах
47.52.2 - Торговля розничная лакокрасочными материалами в специализированных магазинах
47.52.3 - Торговля розничная стеклом в специализированных магазинах
47.52.4 - Торговля розничная материалами и оборудованием для изготовления поделок в специализированных магазинах
47.52.5 - Торговля розничная санитарно-техническим оборудованием в специализированных магазинах
47.52.6 - Торговля розничная садово-огородной техникой и инвентарем в специализированных магазинах
47.52.7 - Торговля розничная строительными материалами, не включенными в другие группировки, в специализированных магазинах
47.52.71 - Торговля розничная пиломатериалами в специализированных магазинах
47.52.72 - Торговля розничная кирпичом в специализированных магазинах
47.52.73 - Торговля розничная металлическими и неметаллическими конструкциями в специализированных магазинах
47.52.74 - Торговля розничная сборными деревянными строениями в специализированных магазинах
47.52.79 - Торговля розничная прочими строительными материалами, не включенными в другие группировки, в специализированных магазинах
47.53 - Торговля розничная коврами, ковровыми изделиями, покрытиями для пола и стен в специализированных магазинах
47.53.1 - Торговля розничная коврами и ковровыми изделиями в специализированных магазинах
47.53.2 - Торговля розничная портьерами, тюлевыми занавесями в специализированных магазинах
47.53.3 - Торговля розничная обоями и напольными покрытиями в специализированных магазинах
47.54 - Торговля розничная бытовыми электротоварами в специализированных магазинах
47.59 - Торговля розничная мебелью, осветительными приборами и прочими бытовыми изделиями в специализированных магазинах
47.59.1 - Торговля розничная мебелью в специализированных магазинах
47.59.2 - Торговля розничная различной домашней утварью, ножевыми изделиями, посудой, изделиями из стекла и керамики, в том числе фарфора и фаянса в специализированных магазинах
47.59.3 - Торговля розничная осветительными приборами в специализированных магазинах
47.59.4 - Торговля розничная изделиями из дерева, пробки и плетеными изделиями в специализированных магазинах
47.59.5 - Торговля розничная музыкальными инструментами и нотными изданиями в специализированных магазинах
47.59.6 - Торговля розничная неэлектрическими бытовыми приборами в специализированных магазинах
47.59.7 - Торговля розничная электрическими системами охранной сигнализации, такими как запорные устройства, сейфы и хранилища
47.59.9 - Торговля розничная бытовыми изделиями и приборами, не включенными в другие группировки, в специализированных магазинах
47.6 - Торговля розничная товарами культурно-развлекательного назначения в специализированных магазинах
47.61 - Торговля розничная книгами в специализированных магазинах
47.62 - Торговля розничная газетами и канцелярскими товарами в специализированных магазинах
47.62.1 - Торговля розничная газетами и журналами в специализированных магазинах
47.62.2 - Торговля розничная писчебумажными и канцелярскими товарами в специализированных магазинах
47.63 - Торговля розничная музыкальными и видеозаписями в специализированных магазинах
47.63.1 - Торговля розничная музыкальными записями, аудиолентами, компакт-дисками и кассетами в специализированных магазинах
47.63.2 - Торговля розничная лентами и дисками без записей в специализированных магазинах
47.64 - Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах
47.64.1 - Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах
47.64.2 - Торговля розничная рыболовными принадлежностями в специализированных магазинах
47.64.3 - Торговля розничная туристическим снаряжением в специализированных магазинах
47.64.4 - Торговля розничная лодками в специализированных магазинах
47.64.5 - Торговля розничная велосипедами в специализированных магазинах
47.65 - Торговля розничная играми и игрушками в специализированных магазинах
47.7 - Торговля розничная прочими товарами в специализированных магазинах
47.71 - Торговля розничная одеждой в специализированных магазинах
47.71.1 - Торговля розничная мужской, женской и детской одеждой в специализированных магазинах
47.71.2 - Торговля розничная нательным бельем в специализированных магазинах
47.71.3 - Торговля розничная изделиями из меха в специализированных магазинах
47.71.4 - Торговля розничная одеждой из кожи в специализированных магазинах
47.71.5 - Торговля розничная спортивной одеждой в специализированных магазинах
47.71.6 - Торговля розничная чулочно-носочными изделиями в специализированных магазинах
47.71.7 - Торговля розничная головными уборами в специализированных магазинах
47.71.8 - Торговля розничная аксессуарами одежды (перчатками, галстуками, шарфами, ремнями, подтяжками и т. п.) в специализированных магазинах
47.72 - Торговля розничная обувью и изделиями из кожи в специализированных магазинах
47.72.1 - Торговля розничная обувью в специализированных магазинах
47.72.2 - Торговля розничная изделиями из кожи и дорожными принадлежностями в специализированных магазинах
47.73 - Торговля розничная лекарственными средствами в специализированных магазинах (аптеках)
47.74 - Торговля розничная изделиями, применяемыми в медицинских целях, ортопедическими изделиями в специализированных магазинах
47.74.1 - Торговля розничная изделиями, применяемыми в медицинских целях, в специализированных магазинах
47.74.2 - Торговля розничная ортопедическими изделиями в специализированных магазинах
47.75 - Торговля розничная косметическими и товарами личной гигиены в специализированных магазинах
47.75.1 - Торговля розничная косметическими и парфюмерными товарами, кроме мыла в специализированных магазинах
47.75.2 - Торговля розничная туалетным и хозяйственным мылом в специализированных магазинах
47.75.3 - Торговля розничная предметами личной гигиены в специализированных магазинах
47.76 - Торговля розничная цветами и другими растениями, семенами, удобрениями, домашними животными и кормами для домашних животных в специализированных магазинах
47.76.1 - Торговля розничная цветами и другими растениями, семенами и удобрениями в специализированных магазинах
47.76.2 - Торговля розничная домашними животными и кормами для домашних животных в специализированных магазинах
47.77 - Торговля розничная часами и ювелирными изделиями в специализированных магазинах
47.77.1 - Торговля розничная часами в специализированных магазинах
47.77.2 - Торговля розничная ювелирными изделиями в специализированных магазинах
47.78 - Торговля розничная прочая в специализированных магазинах
47.78.1 - Торговля розничная фотоаппаратурой, оптическими приборами и средствами измерений, кроме очков, в специализированных магазинах
47.78.2 - Торговля розничная очками, включая сборку и ремонт очков в специализированных магазинах
47.78.21 - Торговля розничная очками в специализированных магазинах
47.78.22 - Сборка и ремонт очков в специализированных магазинах
47.78.3 - Торговля розничная сувенирами, изделиями народных художественных промыслов
47.78.4 - Торговля розничная предметами культового и религиозного назначения, похоронными принадлежностями в специализированных магазинах
47.78.5 - Деятельность коммерческих художественных галерей, торговля розничная произведениями искусства в коммерческих художественных галереях
47.78.6 - Торговля розничная бытовым жидким котельным топливом, газом в баллонах, углем, древесным топливом, топливным торфом в специализированных магазинах
47.78.61 - Торговля розничная бытовым жидким котельным топливом, углем, древесным топливом, топливным торфом в специализированных магазинах
47.78.62 - Торговля розничная газом в баллонах в специализированных магазинах по регулируемым государствам ценам (тарифам)
47.78.63 - Торговля розничная газом в баллонах в специализированных магазинах по нерегулируемым государством ценам (тарифам)
47.78.7 - Торговля розничная оружием и боеприпасами в специализированных магазинах
47.78.8 - Торговля розничная филателистическими и нумизматическими товарами в специализированных магазинах
47.78.9 - Торговля розничная непродовольственными товарами, не включенными в другие группировки, в специализированных магазинах
47.79 - Торговля розничная бывшими в употреблении товарами в магазинах
47.79.1 - Торговля розничная предметами антиквариата
47.79.2 - Торговля розничная букинистическими книгами
47.79.3 - Торговля розничная прочими бывшими в употреблении товарами
47.79.4 - Деятельность аукционных домов по розничной торговле
47.8 - Торговля розничная в нестационарных торговых объектах и на рынках
47.81 - Торговля розничная в нестационарных торговых объектах и на рынках пищевыми продуктами, напитками и табачной продукцией
47.81.1 - Торговля розничная в нестационарных торговых объектах напитками и табачной продукцией
47.81.2 - Торговля розничная на рынках пищевыми продуктами, напитками и табачной продукцией
47.82 - Торговля розничная в нестационарных торговых объектах и на рынках текстилем, одеждой и обувью
47.82.1 - Торговля розничная в нестационарных торговых объектах текстилем, одеждой и обувью
47.82.2 - Торговля розничная на рынках текстилем, одеждой и обувью
47.89 - Торговля розничная в нестационарных торговых объектах и на рынках прочими товарами
47.89.1 - Торговля розничная в нестационарных торговых объектах прочими товарами
47.89.2 - Торговля розничная на рынках прочими товарами
47.9 - Торговля розничная вне магазинов, палаток, рынков
47.91 - Торговля розничная по почте или по информационно-коммуникационной сети Интернет
47.91.1 - Торговля розничная по почте
47.91.2 - Торговля розничная, осуществляемая непосредственно при помощи информационно-коммуникационной сети Интернет
47.91.3 - Торговля розничная через Интернет-аукционы
47.91.4 - Торговля розничная, осуществляемая непосредственно при помощи телевидения, радио, телефона
47.99 - Торговля розничная прочая вне магазинов, палаток, рынков
47.99.1 - Деятельность по осуществлению прямых продаж или продаж торговыми агентами с доставкой
47.99.2 - Деятельность по осуществлению торговли через автоматы
47.99.3 - Деятельность по осуществлению прямых продаж топлива с доставкой по адресу клиента
47.99.4 - Деятельность аукционов по розничной торговле вне магазинов, за исключением продаж через Интернет-аукционы
47.99.5 - Деятельность по осуществлению розничных продаж комиссионными агентами вне магазинов
49 - Деятельность сухопутного и трубопроводного транспорта
49.1 - Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки
49.10 - Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки
49.10.1 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении
49.10.11 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в регулируемом секторе
49.10.12 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в нерегулируемом секторе
49.10.2 - Перевозка пассажиров железнодорожным транспортом в международном сообщении
49.2 - Деятельность железнодорожного транспорта: грузовые перевозки
49.20 - Деятельность железнодорожного транспорта: грузовые перевозки
49.20.1 - Перевозка опасных грузов
49.20.9 - Перевозка прочих грузов
49.3 - Деятельность прочего сухопутного пассажирского транспорта
49.31 - Деятельность сухопутного пассажирского транспорта: перевозки пассажиров в городском и пригородном сообщении
49.31.1 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении
49.31.11 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в регулируемом секторе
49.31.12 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в нерегулируемом секторе
49.31.2 - Регулярные перевозки пассажиров прочим сухопутным транспортом в городском и пригородном сообщении
49.31.21 - Регулярные перевозки пассажиров автобусами в городском и пригородном сообщении
49.31.22 - Регулярные перевозки пассажиров троллейбусами в городском и пригородном сообщении
49.31.23 - Регулярные перевозки пассажиров трамваями в городском и пригородном сообщении
49.31.24 - Перевозка пассажиров метрополитеном
49.31.25 - Перевозка пассажиров фуникулерами, подвесными канатными дорогами и подъемниками, являющимися частью городской или пригородной транспортной системы
49.32 - Деятельность легкового такси и арендованных легковых автомобилей с водителем
49.39 - Деятельность прочего сухопутного пассажирского транспорта, не включенная в другие группировки
49.39.1 - Регулярные перевозки пассажиров сухопутным транспортом, кроме железнодорожного транспорта, в междугородном и международном сообщении, а также специальные перевозки (для собственных нужд)
49.39.11 - Регулярные перевозки пассажиров автобусами в междугородном сообщении
49.39.12 - Регулярные перевозки пассажиров автобусами в международном сообщении
49.39.13 - Специальные перевозки (для собственных нужд) автобусами
49.39.2 - Перевозка пассажиров фуникулерами, подвесными канатными дорогами и лыжными подъемниками, не являющимися частью внутригородской, пригородной или городской и пригородной транспортных систем
49.39.3 - Перевозки пассажиров сухопутным транспортом по заказам
49.39.31 - Перевозки пассажиров арендованными автобусами с водителем
49.39.32 - Перевозка пассажиров автобусами по туристическим или экскурсионным маршрутам
49.39.33 - Перевозка пассажиров автобусами в городском и пригородном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам
49.39.34 - Перевозка пассажиров автобусами в междугородном и международном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам
49.39.35 - Перевозка пассажиров транспортными средствами, приводимыми в движение человеком или животными
49.39.39 - Перевозки пассажиров сухопутным транспортом прочие, не включенные в другие группировки
49.4 - Деятельность автомобильного грузового транспорта и услуги по перевозкам
49.41 - Деятельность автомобильного грузового транспорта
49.41.1 - Перевозка грузов специализированными автотранспортными средствами
49.41.2 - Перевозка грузов неспециализированными автотранспортными средствами
49.41.3 - Аренда грузового автомобильного транспорта с водителем
49.42 - Предоставление услуг по перевозкам
49.5 - Деятельность трубопроводного транспорта
49.50 - Деятельность трубопроводного транспорта
49.50.1 - Транспортирование по трубопроводам нефти и нефтепродуктов
49.50.11 - Транспортирование по трубопроводам нефти
49.50.12 - Транспортирование по трубопроводам нефтепродуктов
49.50.2 - Транспортирование по трубопроводам газа и продуктов его переработки
49.50.21 - Транспортирование по трубопроводам газа
49.50.22 - Транспортирование по трубопроводам продуктов переработки газа
49.50.3 - Сухопутная конвейерная транспортировка угля
49.50.9 - Деятельность трубопроводного транспорта прочая
50 - Деятельность водного транспорта
50.1 - Деятельность морского пассажирского транспорта
50.10 - Деятельность морского пассажирского транспорта
50.10.1 - Перевозка пассажиров морскими судами заграничного плавания
50.10.11 - Перевозка пассажиров морскими судами заграничного плавания, подчиняющимися расписанию
50.10.12 - Перевозка пассажиров морскими судами заграничного плавания, не подчиняющимися расписанию
50.10.2 - Перевозка пассажиров морскими судами каботажного плавания
50.10.21 - Перевозка пассажиров морскими судами каботажного плавания, подчиняющимися расписанию
50.10.22 - Перевозка пассажиров морскими судами каботажного плавания, не подчиняющимися расписанию
50.10.3 - Аренда морских судов заграничного и каботажного плавания для перевозки пассажиров с экипажем
50.10.31 - Аренда морских судов заграничного плавания для перевозки пассажиров с экипажем
50.10.32 - Аренда морских судов каботажного плавания для перевозки пассажиров с экипажем
50.10.39 - Аренда прочих морских судов для перевозки пассажиров с экипажем
50.2 - Деятельность морского грузового транспорта
50.20 - Деятельность морского грузового транспорта
50.20.1 - Перевозка грузов морскими судами заграничного плавания
50.20.11 - Перевозка замороженных или охлажденных грузов судами-рефрижераторами заграничного плавания
50.20.12 - Перевозка нефти морскими судами-танкерами заграничного плавания
50.20.13 - Перевозка прочих жидкостей или газов морскими судами-танкерами заграничного плавания
50.20.14 - Перевозка контейнерных грузов судами-контейнеровозами заграничного плавания
50.20.15 - Перевозка сухих сыпучих грузов морскими судами заграничного плавания
50.20.16 - Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами заграничного плавания
50.20.19 - Перевозка прочих грузов морскими судами заграничного плавания
50.20.2 - Перевозка грузов морскими судами каботажного плавания
50.20.21 - Перевозка замороженных или охлажденных грузов судами-рефрижераторами каботажного плавания
50.20.22 - Перевозка нефти морскими судами-танкерами каботажного плавания
50.20.23 - Перевозка прочих жидкостей или газов морскими судами-танкерами каботажного плавания
50.20.24 - Перевозка контейнерных грузов судами-контейнеровозами каботажного плавания
50.20.25 - Перевозка сухих сыпучих грузов морскими судами каботажного плавания
50.20.26 - Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами каботажного плавания
50.20.29 - Перевозка прочих грузов морскими судами каботажного плавания
50.20.3 - Аренда морских судов заграничного и каботажного плавания для перевозки грузов с экипажем
50.20.31 - Аренда морских судов заграничного плавания для перевозки грузов с экипажем
50.20.32 - Аренда морских судов каботажного плавания для перевозки грузов с экипажем
50.20.4 - Буксировка и маневровые услуги, оказываемые судами заграничного и каботажного плавания
50.20.41 - Буксировка судами заграничного и каботажного плавания
50.20.42 - Деятельность по оказанию маневровых услуг судами заграничного и каботажного плавания
50.3 - Деятельность внутреннего водного пассажирского транспорта
50.30 - Деятельность внутреннего водного пассажирского транспорта
50.30.1 - Перевозка пассажиров по внутренним водным путям
50.30.2 - Аренда судов внутреннего водного транспорта для перевозки пассажиров с экипажем
50.4 - Деятельность внутреннего водного грузового транспорта
50.40 - Деятельность внутреннего водного грузового транспорта
50.40.1 - Перевозка грузов по внутренним водным путям
50.40.2 - Буксировка и маневровые услуги на внутренних водных путях
50.40.3 - Аренда судов внутреннего водного транспорта для перевозки грузов с экипажем
51 - Деятельность воздушного и космического транспорта
51.1 - Деятельность пассажирского воздушного транспорта
51.10 - Деятельность пассажирского воздушного транспорта
51.10.1 - Перевозка воздушным пассажирским транспортом, подчиняющимся расписанию
51.10.2 - Перевозка воздушным пассажирским транспортом, не подчиняющимся расписанию
51.10.3 - Аренда воздушного судна с экипажем для перевозки пассажиров
51.2 - Деятельность грузового воздушного транспорта и космического транспорта
51.21 - Деятельность грузового воздушного транспорта
51.21.1 - Перевозка воздушным грузовым транспортом, подчиняющимся расписанию
51.21.2 - Перевозка воздушным грузовым транспортом, не подчиняющимся расписанию
51.21.3 - Аренда грузовых воздушных судов с экипажем
51.22 - Деятельность космического транспорта
51.22.1 - Перевозка пассажиров космическим транспортом
51.22.2 - Перевозка грузов космическим транспортом
51.22.3 - Запуск ракет космического назначения и выведение космических объектов на орбиту
51.22.4 - Деятельность космических лабораторий
52 - Складское хозяйство и вспомогательная транспортная деятельность
52.1 - Деятельность по складированию и хранению
52.10 - Деятельность по складированию и хранению
52.10.1 - Хранение и складирование замороженных или охлажденных грузов
52.10.2 - Хранение и складирование жидких или газообразных грузов
52.10.21 - Хранение и складирование нефти и продуктов ее переработки
52.10.22 - Хранение и складирование газа и продуктов его переработки
52.10.23 - Хранение и складирование прочих жидких или газообразных грузов
52.10.3 - Хранение и складирование зерна
52.10.4 - Хранение ядерных материалов и радиоактивных веществ
52.10.9 - Хранение и складирование прочих грузов
52.2 - Деятельность транспортная вспомогательная
52.21 - Деятельность вспомогательная, связанная с сухопутным транспортом
52.21.1 - Деятельность вспомогательная, связанная с железнодорожным транспортом
52.21.11 - Предоставление железнодорожных маневровых или буксировочных услуг
52.21.12 - Деятельность железнодорожных пассажирских вокзалов и грузовых терминалов
52.21.13 - Деятельность железнодорожной инфраструктуры
52.21.19 - Деятельность вспомогательная прочая, связанная с железнодорожным транспортом
52.21.2 - Деятельность вспомогательная, связанная с автомобильным транспортом
52.21.21 - Деятельность автовокзалов и автостанций
52.21.22 - Деятельность по эксплуатации автомобильных дорог и автомагистралей
52.21.23 - Деятельность по эксплуатации мостов и тоннелей
52.21.24 - Деятельность стоянок для транспортных средств
52.21.25 - Деятельность по буксировке автотранспортных средств
52.21.29 - Деятельность вспомогательная прочая, связанная с автомобильным транспортом
52.21.3 - Деятельность вспомогательная, связанная с трубопроводным транспортом
52.22 - Деятельность вспомогательная, связанная с водным транспортом
52.22.1 - Деятельность вспомогательная, связанная с морским транспортом
52.22.11 - Деятельность инфраструктуры морских портов, включая портовые гидротехнические сооружения (причалы, морские терминалы, доки и др.)
52.22.12 - Обеспечение судоходства в морских и прибрежных водах, включая лоцманскую проводку судов
52.22.13 - Деятельность по постановке судов к причалу, осуществление швартовых операций с судами в морских портах
52.22.14 - Деятельность по навигационному обеспечению судоходства на морском транспорте
52.22.15 - Деятельность аварийно-спасательная и судоподъемная на морском транспорте
52.22.16 - Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на морском транспорте
52.22.17 - Производство водолазных работ по обслуживанию морских судов
52.22.18 - Деятельность ледокольного флота на морском транспорте
52.22.19 - Деятельность вспомогательная, связанная морским транспортом, прочая, не включенная в другие группировки
52.22.2 - Деятельность вспомогательная, связанная с внутренним водным транспортом
52.22.21 - Деятельность инфраструктуры речных портов и гидротехнических сооружений
52.22.22 - Обеспечение судоходства по внутренним водным путям, в том числе лоцманская проводка судов
52.22.23 - Деятельность по постановке судов к причалу, осуществление швартовых операций в речных портах на внутреннем водном транспорте
52.22.24 - Деятельность по навигационному обеспечению судоходства на внутреннем водном транспорте
52.22.25 - Деятельность аварийно-спасательная и судоподъемная на внутреннем водном транспорте
52.22.26 - Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на внутреннем водном транспорте
52.22.27 - Производство водолазных работ по обслуживанию судов на внутреннем водном транспорте
52.22.28 - Деятельность ледокольного флота на внутреннем водном транспорте
52.22.29 - Деятельность вспомогательная, связанная с внутренним водным транспортом, прочая, не включенная в другие группировки
52.23 - Деятельность вспомогательная, связанная с воздушным и космическим транспортом
52.23.1 - Деятельность вспомогательная, связанная с воздушным транспортом
52.23.11 - Деятельность аэропортовая
52.23.12 - Обеспечение обслуживания (управления) воздушного движения
52.23.13 - Выполнение авиационных работ
52.23.19 - Деятельность вспомогательная прочая, связанная с воздушным транспортом
52.23.2 - Деятельность вспомогательная, связанная с космическим транспортом
52.23.21 - Деятельность наземных центров управления полетами космических объектов в космическом пространстве и центров (пунктов) космической связи
52.23.22 - Деятельность поисковых и аварийно-спасательных служб, в том числе по эвакуации спускаемых аппаратов (капсул), составных частей ракет космического назначения
52.23.23 - Деятельность, связанная с подготовкой космонавтов для работы непосредственно в космическом пространстве
52.23.29 - Деятельность вспомогательная прочая, связанная с космическим транспортом
52.24 - Транспортная обработка грузов
52.24.1 - Транспортная обработка контейнеров
52.24.2 - Транспортная обработка прочих грузов
52.29 - Деятельность вспомогательная прочая, связанная с перевозками
53 - Деятельность почтовой связи и курьерская деятельность
53.1 - Деятельность почтовой связи общего пользования
53.10 - Деятельность почтовой связи общего пользования
53.10.1 - Деятельность почтовой связи, связанная с пересылкой газет и других периодических изданий
53.10.2 - Деятельность почтовой связи, связанная с пересылкой письменной корреспонденции
53.10.3 - Деятельность почтовой связи, связанная с пересылкой посылочной почты
53.10.4 - Деятельность почтовой связи дополнительная
53.10.9 - Деятельность почтовой связи общего пользования прочая
53.2 - Деятельность почтовой связи прочая и курьерская деятельность
53.20 - Деятельность почтовой связи прочая и курьерская деятельность
53.20.1 - Деятельность специальной почтовой связи
53.20.2 - Деятельность фельдъегерской связи
53.20.21 - Деятельность федеральной фельдъегерской связи
53.20.22 - Деятельность фельдъегерско-почтовой связи
53.20.29 - Деятельность почтовой связи прочая, не включенная в другие группировки
53.20.3 - Деятельность курьерская
53.20.31 - Деятельность по курьерской доставке различными видами транспорта
53.20.32 - Деятельность по доставке еды на дом
53.20.39 - Деятельность курьерская прочая
55 - Деятельность по предоставлению мест для временного проживания
55.1 - Деятельность гостиниц и прочих мест для временного проживания
55.10 - Деятельность гостиниц и прочих мест для временного проживания
55.2 - Деятельность по предоставлению мест для краткосрочного проживания
55.20 - Деятельность по предоставлению мест для краткосрочного проживания
55.3 - Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах
55.30 - Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах
55.9 - Деятельность по предоставлению прочих мест для временного проживания
55.90 - Деятельность по предоставлению прочих мест для временного проживания
56 - Деятельность по предоставлению продуктов питания и напитков
56.1 - Деятельность ресторанов и услуги по доставке продуктов питания
56.10 - Деятельность ресторанов и услуги по доставке продуктов питания
56.10.1 - Деятельность ресторанов и кафе с полным ресторанным обслуживанием, кафетериев, ресторанов быстрого питания и самообслуживания
56.10.2 - Деятельность по приготовлению и/или продаже пищи, готовой к непосредственному употреблению на месте, с транспортных средств или передвижных лавок
56.10.21 - Деятельность предприятий общественного питания с обслуживанием на вынос
56.10.22 - Деятельность передвижных продовольственных лавок по приготовлению и/или продаже пищи, готовой к употреблению
56.10.23 - Деятельность вагончиков, палаток по приготовлению и продаже мороженого
56.10.24 - Деятельность рыночных киосков и торговых палаток по приготовлению пищи
56.10.3 - Деятельность ресторанов и баров по обеспечению питанием в железнодорожных вагонах-ресторанах и на судах
56.2 - Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий и прочим видам организации питания
56.21 - Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий
56.29 - Деятельность предприятий общественного питания по прочим видам организации питания
56.29.1 - Деятельность организаций общественного питания, поставляющих готовую пищу (для транспортных и строительных компаний, туристическим группам, личному составу вооруженных сил, предприятиям розничной торговли и другим группам потребителей) по договору
56.29.2 - Деятельность столовых и буфетов при предприятиях и учреждениях
56.29.3 - Деятельность по доставке продуктов питания учебным, спортивным и прочим учреждениям (по льготным ценам)
56.29.4 - Деятельность социальных столовых, буфетов или кафетериев (в офисах, больницах, школах, институтах и пр.) на основе льготных цен на питание
56.3 - Подача напитков
56.30 - Подача напитков
58 - Деятельность издательская
58.1 - Издание книг, периодических публикаций и другие виды издательской деятельности
58.11 - Издание книг
58.11.1 - Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий, в том числе для слепых, в печатном виде
58.11.2 - Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий на электронных носителях
58.11.3 - Издание атласов, карт и таблиц, в том числе для слепых, в печатном виде
58.11.4 - Издание атласов, карт и таблиц на электронных носителях
58.12 - Издание адресных справочников и списков адресатов
58.12.1 - Издание справочников в печатном виде
58.12.2 - Издание справочников на электронных носителях
58.13 - Издание газет
58.13.1 - Издание газет в печатном виде
58.13.2 - Издание газет на электронных носителях
58.14 - Издание журналов и периодических изданий
58.14.1 - Издание журналов и периодических публикаций в печатном виде
58.14.2 - Издание журналов и периодических публикаций на электронных носителях
58.19 - Виды издательской деятельности прочие
58.2 - Издание программного обеспечения
58.21 - Издание компьютерных игр
58.29 - Издание прочих программных продуктов
59 - Производство кинофильмов, видеофильмов и телевизионных программ, издание звукозаписей и нот
59.1 - Производство кинофильмов, видеофильмов и телевизионных программ
59.11 - Производство кинофильмов, видеофильмов и телевизионных программ
59.11.1 - Производство анимационных фильмов
59.11.9 - Производство прочих кинофильмов, видеофильмов и телевизионных программ
59.12 - Деятельность монтажно-компоновочная в области производства кинофильмов, видеофильмов и телевизионных программ
59.13 - Деятельность по распространению кинофильмов, видеофильмов и телевизионных программ
59.14 - Деятельность в области демонстрации кинофильмов
59.2 - Деятельность в области звукозаписи и издания музыкальных произведений
59.20 - Деятельность в области звукозаписи и издания музыкальных произведений
59.20.1 - Издание аудиовизуальных произведений на магнитных, электронных и цифровых носителях
59.20.2 - Деятельность студий звукозаписи
59.20.3 - Издание музыкальных и нотных тетрадей, в том числе для слепых
60 - Деятельность в области телевизионного и радиовещания
60.1 - Деятельность в области радиовещания
60.10 - Деятельность в области радиовещания
60.2 - Деятельность в области телевизионного вещания
60.20 - Деятельность в области телевизионного вещания
61 - Деятельность в сфере телекоммуникаций
61.1 - Деятельность в области связи на базе проводных технологий
61.10 - Деятельность в области связи на базе проводных технологий
61.10.1 - Деятельность по предоставлению услуг телефонной связи
61.10.2 - Деятельность по предоставлению услуг по передаче данных для целей передачи голосовой информации (IР-телефония)
61.10.3 - Деятельность по предоставлению услуг по передаче данных и услуг доступа к информационно-коммуникационной сети Интернет
61.10.4 - Деятельность в области документальной электросвязи
61.10.5 - Деятельность по трансляции телерадиоканалов по сетям кабельного телерадиовещания
61.10.6 - Деятельность операторов связи по присоединению и пропуску трафика
61.10.8 - Деятельность операторов связи по присоединению и пропуску международного трафика
61.10.9 - Деятельность в области связи на базе проводных технологий прочая
61.2 - Деятельность в области связи на базе беспроводных технологий
61.20 - Деятельность в области связи на базе беспроводных технологий
61.20.1 - Деятельность по предоставлению услуг подвижной связи для целей передачи голоса
61.20.2 - Деятельность по предоставлению услуг подвижной связи для целей передачи данных
61.20.3 - Деятельность по предоставлению услуг подвижной связи для доступа к информационно-коммуникационной сети Интернет
61.20.4 - Деятельность по предоставлению услуг связи для целей открытого эфирного вещания
61.20.5 - Деятельность по предоставлению услуг цифрового телерадиовещания на базе беспроводных технологий
61.3 - Деятельность в области спутниковой связи
61.30 - Деятельность в области спутниковой связи
61.30.1 - Деятельность по предоставлению услуг доступа к информационно-коммуникационной сети Интернет оператором спутниковой связи
61.30.2 - Деятельность по предоставлению услуг трансляции телерадиоканалов по сетям спутникового телерадиовещания
61.9 - Деятельность в области телекоммуникаций прочая
61.90 - Деятельность в области телекоммуникаций прочая
62 - Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
62.0 - Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
62.01 - Разработка компьютерного программного обеспечения
62.02 - Деятельность консультативная и работы в области компьютерных технологий
62.02.1 - Деятельность по планированию, проектированию компьютерных систем
62.02.2 - Деятельность по обследованию и экспертизе компьютерных систем
62.02.3 - Деятельность по обучению пользователей
62.02.4 - Деятельность по подготовке компьютерных систем к эксплуатации
62.02.9 - Деятельность консультативная в области компьютерных технологий прочая
62.03 - Деятельность по управлению компьютерным оборудованием
62.03.1 - Деятельность по управлению компьютерными системами
62.03.11 - Деятельность по управлению компьютерными системами непосредственно
62.03.12 - Деятельность по управлению компьютерными системами дистанционно
62.03.13 - Деятельность по сопровождению компьютерных систем
62.03.19 - Деятельность по управлению компьютерным оборудованием прочая, не включенная в другие группировки
62.09 - Деятельность, связанная с использованием вычислительной техники и информационных технологий, прочая
63 - Деятельность в области информационных технологий
63.1 - Деятельность по обработке данных, предоставление услуг по размещению информации, деятельность порталов в информационно-коммуникационной сети Интернет
63.11 - Деятельность по обработке данных, предоставление услуг по размещению информации и связанная с этим деятельность
63.11.1 - Деятельность по созданию и использованию баз данных и информационных ресурсов
63.11.9 - Деятельность по предоставлению услуг по размещению информации прочая
63.12 - Деятельность web-порталов
63.12.1 - Деятельность сетевых изданий
63.9 - Деятельность в области информационных услуг прочая
63.91 - Деятельность информационных агентств
63.99 - Деятельность информационных служб прочая, не включенная в другие группировки
63.99.1 - Деятельность по оказанию консультационных и информационных услуг
63.99.11 - Деятельность по оказанию компьютерных информационных услуг телефонной связи
63.99.12 - Деятельность по оказанию услуг службами информационного поиска по договору или на платной основе
63.99.2 - Деятельность по оказанию услуг по составлению обзоров новостей, услуг по подборке печатных изданий и подобной информации
64 - Деятельность по предоставлению финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
64.1 - Денежное посредничество
64.11 - Деятельность Центрального банка Российской Федерации (Банка России)
64.19 - Денежное посредничество прочее
64.2 - Деятельность холдинговых компаний
64.20 - Деятельность холдинговых компаний
64.3 - Деятельность инвестиционных фондов и аналогичных финансовых организаций
64.30 - Деятельность инвестиционных фондов и аналогичных финансовых организаций
64.9 - Деятельность по предоставлению прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
64.91 - Деятельность по финансовой аренде (лизингу/сублизингу)
64.91.1 - Деятельность по финансовой аренде (лизингу/сублизингу) племенных животных
64.91.2 - Деятельность по финансовой аренде (лизингу/сублизингу) в прочих областях, кроме племенных животных
64.92 - Предоставление займов и прочих видов кредита
64.92.1 - Деятельность по предоставлению потребительского кредита
64.92.2 - Деятельность по предоставлению займов промышленности
64.92.3 - Деятельность по предоставлению денежных ссуд под залог недвижимого имущества
64.92.4 - Деятельность по предоставлению кредитов на покупку домов специализированными учреждениями, не принимающими депозиты
64.92.6 - Деятельность по предоставлению ломбардами краткосрочных займов под залог движимого имущества
64.92.7 - Деятельность микрофинансовая
64.99 - Предоставление прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению, не включенных в другие группировки
64.99.1 - Вложения в ценные бумаги
64.99.2 - Деятельность дилерская
64.99.3 - Капиталовложения в уставные капиталы, венчурное инвестирование, в том числе посредством инвестиционных компаний
64.99.4 - Заключение свопов, опционов и других срочных сделок
64.99.5 - Предоставление факторинговых услуг
64.99.6 - Деятельность по финансовой взаимопомощи
64.99.7 - Деятельность специализированного депозитария инвестиционных фондов, паевых инвестиционных фондов, негосударственных пенсионных фондов
64.99.8 - Деятельность ипотечных агентов, управляющих ипотечным покрытием; деятельность специализированных депозитариев ипотечного покрытия
64.99.9 - Деятельность жилищных накопительных кооперативов
65 - Страхование, перестрахование, деятельность негосударственных пенсионных фондов, кроме обязательного социального обеспечения
65.1 - Страхование
65.11 - Страхование жизни
65.12 - Страхование, кроме страхования жизни
65.12.1 - Страхование медицинское
65.12.2 - Страхование имущества
65.12.3 - Страхование гражданской ответственности
65.12.4 - Страхование от несчастных случаев и болезней
65.12.5 - Страхование рисков
65.12.6 - Страхование для путешественника, выезжающего за пределы постоянного проживания
65.12.9 - Прочие виды страхования, не включенные в другие группировки
65.2 - Перестрахование
65.20 - Перестрахование
65.3 - Деятельность негосударственных пенсионных фондов
65.30 - Деятельность негосударственных пенсионных фондов
66 - Деятельность вспомогательная в сфере финансовых услуг и страхования
66.1 - Деятельность вспомогательная в сфере финансовых услуг, кроме страхования и пенсионного обеспечения
66.11 - Управление финансовыми рынками
66.11.1 - Деятельность по организации торговли на финансовых рынках
66.11.2 - Управление и контроль за деятельностью фондовых, товарных, валютных и валютнофондовых бирж
66.11.3 - Деятельность регистраторов по ведению реестра владельцев ценных бумаг
66.11.4 - Деятельность по обеспечению эффективности функционирования финансовых рынков
66.11.5 - Деятельность по определению взаимных обязательств (клиринг)
66.12 - Деятельность брокерская по сделкам с ценными бумагами и товарами
66.12.1 - Деятельность биржевых посредников и биржевых брокеров, совершающих товарные фьючерсные и опционные сделки в биржевой торговле
66.12.2 - Деятельность по управлению ценными бумагами
66.12.3 - Деятельность эмиссионная
66.19 - Деятельность вспомогательная прочая в сфере финансовых услуг, кроме страхования и пенсионного обеспечения
66.19.1 - Деятельность по предоставлению брокерских услуг по ипотечным операциям
66.19.3 - Деятельность по предоставлению услуг по обработке наличных денег
66.19.4 - Деятельность по предоставлению консультационных услуг по вопросам финансового посредничества
66.19.5 - Предоставление услуг по хранению ценностей, депозитарная деятельность
66.19.6 - Деятельность по приему платежей физических лиц платежными агентами
66.19.61 - Деятельность операторов по приему платежей физических лиц
66.19.62 - Деятельность платежных субагентов по приему платежей физических лиц
66.19.7 - Рейтинговая деятельность
66.2 - Деятельность вспомогательная в сфере страхования и пенсионного обеспечения
66.21 - Оценка рисков и ущерба
66.22 - Деятельность страховых агентов и брокеров
66.29 - Деятельность вспомогательная прочая в сфере страхования и пенсионного обеспечения
66.29.1 - Деятельность страховых актуариев
66.29.2 - Деятельность распорядителей спасательными работами
66.29.9 - Деятельность вспомогательная прочая в сфере страхования, кроме обязательного социального страхования
66.3 - Деятельность по управлению фондами
66.30 - Деятельность по управлению фондами
66.30.1 - Управление инвестиционными фондами
66.30.2 - Управление фондами денежного рынка
66.30.3 - Управление пенсионными накоплениями негосударственных пенсионных фондов
66.30.4 - Управление пенсионными резервами негосударственных пенсионных фондов
66.30.5 - Управление страховыми резервами субъектов страхового дела
66.30.6 - Управление на основе индивидуальных договоров доверительного управления активами
66.30.9 - Другие виды деятельности по управлению активами
68 - Операции с недвижимым имуществом
68.1 - Покупка и продажа собственного недвижимого имущества
68.10 - Покупка и продажа собственного недвижимого имущества
68.10.1 - Подготовка к продаже собственного недвижимого имущества
68.10.11 - Подготовка к продаже собственного жилого недвижимого имущества
68.10.12 - Подготовка к продаже собственного нежилого недвижимого имущества
68.10.2 - Покупка и продажа собственного недвижимого имущества
68.10.21 - Покупка и продажа собственного жилого недвижимого имущества
68.10.22 - Покупка и продажа собственных нежилых зданий и помещений
68.10.23 - Покупка и продажа земельных участков
68.2 - Аренда и управление собственным или арендованным недвижимым имуществом
68.20 - Аренда и управление собственным или арендованным недвижимым имуществом
68.20.1 - Аренда и управление собственным или арендованным жилым недвижимым имуществом
68.20.2 - Аренда и управление собственным или арендованным нежилым недвижимым имуществом
68.20.21 - Аренда и управление собственным или арендованным торговым объектом недвижимого имущества
68.20.29 - Аренда и управление собственным или арендованным прочим нежилым недвижимым имуществом
68.3 - Операции с недвижимым имуществом за вознаграждение или на договорной основе
68.31 - Деятельность агентств недвижимости за вознаграждение или на договорной основе
68.31.1 - Предоставление посреднических услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе
68.31.11 - Предоставление посреднических услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.12 - Предоставление посреднических услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.2 - Предоставление посреднических услуг по аренде недвижимого имущества за вознаграждение или на договорной основе
68.31.21 - Предоставление посреднических услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.22 - Предоставление посреднических услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.3 - Предоставление консультационных услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе
68.31.31 - Предоставление консультационных услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.32 - Предоставление консультационных услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.4 - Предоставление консультационных услуг по аренде недвижимого имущества за вознаграждение или на договорной основе
68.31.41 - Предоставление консультационных услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.42 - Предоставление консультационных услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.5 - Предоставление посреднических услуг при оценке недвижимого имущества за вознаграждение или на договорной основе
68.31.51 - Предоставление посреднических услуг при оценке жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.52 - Предоставление посреднических услуг при оценке нежилого недвижимого имущества за вознаграждение или на договорной основе
68.32 - Управление недвижимым имуществом за вознаграждение или на договорной основе
68.32.1 - Управление эксплуатацией жилого фонда за вознаграждение или на договорной основе
68.32.2 - Управление эксплуатацией нежилого фонда за вознаграждение или на договорной основе
68.32.3 - Деятельность по технической инвентаризации недвижимого имущества
69 - Деятельность в области права и бухгалтерского учета
69.1 - Деятельность в области права
69.10 - Деятельность в области права
69.2 - Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию
69.20 - Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию
69.20.1 - Деятельность по проведению финансового аудита
69.20.2 - Деятельность по оказанию услуг в области бухгалтерского учета
69.20.3 - Деятельность области налогового консультирования
70 - Деятельность головных офисов; консультирование по вопросам управления
70.1 - Деятельность головных офисов
70.10 - Деятельность головных офисов
70.10.1 - Деятельность по управлению финансово-промышленными группами
70.10.2 - Деятельность по управлению холдинг-компаниями
70.2 - Консультирование по вопросам управления
70.21 - Деятельность в сфере связей с общественностью
70.22 - Консультирование по вопросам коммерческой деятельности и управления
71 - Деятельность в области архитектуры и инженерно-технического проектирования; технических испытаний, исследований и анализа
71.1 - Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях
71.11 - Деятельность в области архитектуры
71.11.1 - Деятельность в области архитектуры, связанная с созданием архитектурного объекта
71.11.2 - Деятельность по территориальному планированию и планировке территории
71.11.3 - Деятельность в области ландшафтной архитектуры и консультативные услуги в области архитектуры
71.12 - Деятельность в области инженерных изысканий, инженерно-технического проектирования, управления проектами строительства, выполнения строительного контроля и авторского надзора, предоставление технических консультаций в этих областях
71.12.1 - Деятельность, связанная с инженерно-техническим проектированием, управлением проектами строительства, выполнением строительного контроля и авторского надзора
71.12.11 - Разработка проектов тепло-, водо-, газоснабжения
71.12.12 - Разработка проектов промышленных процессов и производств, относящихся к электротехнике, электронной технике, горному делу, химической технологии, машиностроению, а также в области промышленного строительства, системотехники и техники безопасности
71.12.13 - Разработка проектов по кондиционированию воздуха, холодильной технике, санитарной технике и мониторингу загрязнения окружающей среды, строительной акустике
71.12.14 - Разработка инженерно-технических проектов и контроль при строительстве и модернизации объектов использования атомной энергии
71.12.15 - Инженерные изыскания в строительстве
71.12.2 - Деятельность заказчика-застройщика, генерального подрядчика
71.12.3 - Работы геолого-разведочные, геофизические и геохимические в области изучения недр и воспроизводства минерально-сырьевой базы
71.12.4 - Деятельность геодезическая и картографическая
71.12.41 - Деятельность геодезическая, кроме создания геодезической, нивелирной и гравиметрической сетей
71.12.42 - Деятельность картографическая, кроме создания топографических карт и планов
71.12.43 - Деятельность гидрографическая изыскательская
71.12.44 - Деятельность по созданию топографических карт и планов
71.12.45 - Создание геодезической, нивелирной, гравиметрической сетей
71.12.5 - Деятельность в области гидрометеорологии и смежных с ней областях, мониторинга состояния окружающей среды, ее загрязнения
71.12.51 - Деятельность наблюдательной гидрометеорологической сети
71.12.52 - Проведение гелиофизических и геофизических работ
71.12.53 - Деятельность по мониторингу загрязнения окружающей среды для физических и юридических лиц
71.12.54 - Работы полевые и изыскания в области гидрометеорологии и смежных с ней областях, экспедиционные обследования объектов окружающей среды с целью оценки уровней загрязнения
71.12.55 - Деятельность по обработке и предоставлению гидрометеорологической информации органам государственной власти и населению
71.12.56 - Обеспечение гидрометеорологическое деятельности физических и юридических лиц
71.12.57 - Деятельность, связанная с активными воздействиями на метеорологические и геофизические процессы и явления
71.12.6 - Деятельность в области технического регулирования, стандартизации, метрологии, аккредитации, каталогизации продукции
71.12.61 - Деятельность в области технического регулирования и стандартизации
71.12.62 - Деятельность в области метрологии
71.12.63 - Деятельность в области аккредитации
71.12.64 - Государственный контроль (надзор) за соблюдением требований технических регламентов
71.12.65 - Федеральный государственный метрологический надзор
71.12.66 - Деятельность в области каталогизации продукции
71.12.7 - Кадастровая деятельность
71.12.8 - Деятельность по предоставлению инженерно-технических консультаций в сфере энергосбережения и повышения энергетической эффективности использования энергетических ресурсов
71.12.9 - Землеустройство
71.2 - Технические испытания, исследования, анализ и сертификация
71.20 - Технические испытания, исследования, анализ и сертификация
71.20.1 - Испытания и анализ состава и чистоты материалов и веществ: анализ химических и биологических свойств материалов и веществ; испытания и анализ в области гигиены питания, включая ветеринарный контроль и контроль за производством продуктов питания
71.20.2 - Судебно-экспертная деятельность
71.20.3 - Испытания и анализ физико-механических свойств материалов и веществ
71.20.4 - Испытания, исследования и анализ целостных механических и электрических систем, энергетическое обследование
71.20.5 - Технический осмотр автотранспортных средств
71.20.6 - Экспертиза проектной документации, запасов полезных ископаемых и подземных вод, геологической информации о предоставляемых в пользование участках недр, результатов инженерных изысканий
71.20.61 - Экспертиза проектной документации, запасов полезных ископаемых и подземных вод, геологической информации о предоставляемых в пользование участках недр, результатов инженерных изысканий государственная
71.20.62 - Экспертиза проектной документации и результатов инженерных изысканий негосударственная
71.20.7 - Деятельность по оценке условий труда
71.20.8 - Сертификация продукции, услуг и организаций
71.20.9 - Деятельность по техническому контролю, испытаниям и анализу прочая
72 - Научные исследования и разработки
72.1 - Научные исследования и разработки в области естественных и технических наук
72.11 - Научные исследования и разработки в области биотехнологии
72.19 - Научные исследования и разработки в области естественных и технических наук прочие
72.19.1 - Проведение фундаментальных исследований и научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии и в области ядерной оружейной продукции
72.19.11 - Проведение фундаментальных исследований, научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии
72.19.12 - Научные исследования и разработки в области ядерной оружейной продукции
72.19.3 - Научные исследования и разработки в области нанотехнологий
72.19.4 - Научные исследования и разработки в области защиты информации
72.19.9 - Научные исследования и разработки в области естественных и технических наук прочие, не включенные в другие группировки
72.2 - Научные исследования и разработки в области общественных и гуманитарных наук
72.20 - Научные исследования и разработки в области общественных и гуманитарных наук
72.20.1 - Научные исследования и разработки в области общественных наук
72.20.11 - Проведение исследований в области социально-экономической географии
72.20.19 - Научные исследования и разработки в области общественных наук прочие
72.20.2 - Научные исследования и разработки в области гуманитарных наук
73 - Деятельность рекламная и исследование конъюнктуры рынка
73.1 - Деятельность рекламная
73.11 - Деятельность рекламных агентств
73.12 - Представление в средствах массовой информации
73.2 - Исследование конъюнктуры рынка и изучение общественного мнения
73.20 - Исследование конъюнктуры рынка и изучение общественного мнения
73.20.1 - Исследование конъюнктуры рынка
73.20.2 - Деятельность по изучению общественного мнения
74 - Деятельность профессиональная научная и техническая прочая
74.1 - Деятельность специализированная в области дизайна
74.10 - Деятельность специализированная в области дизайна
74.2 - Деятельность в области фотографии
74.20 - Деятельность в области фотографии
74.3 - Деятельность по письменному и устному переводу
74.30 - Деятельность по письменному и устному переводу
74.9 - Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки
74.90 - Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки
74.90.1 - Предоставление посреднических услуг по организации покупки и продажи мелких или средних коммерческих предприятий, включая профессиональную практику
74.90.2 - Деятельность, направленная на установление рыночной или иной стоимости (оценочная деятельность), кроме оценки, связанной с недвижимым имуществом или страхованием
74.90.21 - Деятельность, направленная на установление рыночной или иной стоимости отдельных материальных объектов (вещей)
74.90.22 - Деятельность, направленная на установление рыночной или иной стоимости совокупности вещей, составляющих имущество лица, в том числе имущество определенного вида (движимое или недвижимое, в том числе предприятия)
74.90.23 - Деятельность, направленная на установление рыночной или иной стоимости права собственности или иных вещных прав на имущество или отдельные вещи из состава имущества
74.90.24 - Деятельность, направленная на установление рыночной или иной стоимости прав требования, обязательств (долгов)
74.90.25 - Деятельность, направленная на установление рыночной или иной стоимости работ, услуг, информации
74.90.26 - Деятельность, направленная на установление рыночной или иной стоимости иных объектов гражданских прав, в отношении которых законодательством Российской Федерации установлена возможность их участия в гражданском обороте
74.90.3 - Предоставление консультационных услуг по вопросам безопасности
74.90.31 - Предоставление услуг по проведению оценки уязвимости объектов транспортной инфраструктуры и транспортных средств
74.90.32 - Предоставление услуг по проведению оценки уязвимости объектов промышленного назначения, связи, здравоохранения и т. д.
74.90.4 - Предоставление консультационных услуг в области сельского хозяйства
74.90.5 - Предоставление консультационных услуг в области экологии
74.90.6 - Предоставление прочих технических консультаций, деятельность консультантов, кроме архитекторов, проектировщиков и консультантов по управлению
74.90.7 - Деятельность по подготовке метеорологических прогнозов
74.90.8 - Деятельность агентств и агентов, действующих от имени физических лиц, и обычно связанную с заключением контрактов (договоров) на участие в кинофильмах, театральных постановках и других развлекательных или спортивных мероприятиях, а также с предложением книг, пьес, предметов изобразительного искусства, фотографий и аналогичных предметов издателям, продюсерам
74.90.9 - Деятельность в области защиты информации
74.90.91 - Деятельность по разработке средств защиты информации
74.90.92 - Деятельность по разработке информационных и телекоммуникационных систем, защищенных с использованием средств защиты информации
74.90.99 - Деятельность в области защиты информации прочая
75 - Деятельность ветеринарная
75.0 - Деятельность ветеринарная
75.00 - Деятельность ветеринарная
75.00.1 - Деятельность ветеринарная для сельскохозяйственных животных
75.00.2 - Деятельность ветеринарная для домашних животных
77 - Аренда и лизинг
77.1 - Аренда и лизинг автотранспортных средств
77.11 - Аренда и лизинг легковых автомобилей и легких автотранспортных средств
77.12 - Аренда и лизинг грузовых транспортных средств
77.2 - Прокат и аренда предметов личного пользования и хозяйственно-бытового назначения
77.21 - Прокат и аренда товаров для отдыха и спортивных товаров
77.22 - Прокат видеокассет и аудиокассет, грампластинок, компакт-дисков (CD), цифровых видеодисков (DVD)
77.29 - Прокат и аренда прочих предметов личного пользования и хозяйственно-бытового назначения
77.29.1 - Прокат телевизоров, радиоприемников, устройств видеозаписи, аудиозаписи и подобного оборудования
77.29.2 - Прокат мебели, электрических и неэлектрических бытовых приборов
77.29.3 - Прокат музыкальных инструментов
77.29.4 - Прокат одежды, даже если чистка таких изделий является составной частью этого вида деятельности
77.29.9 - Прокат прочих бытовых изделий и предметов личного пользования для домашних хозяйств, предприятий и организаций, не включенных в другие группировки
77.3 - Аренда и лизинг прочих машин и оборудования и материальных средств
77.31 - Аренда и лизинг сельскохозяйственных машин и оборудования
77.32 - Аренда и лизинг строительных машин и оборудования
77.33 - Аренда и лизинг офисных машин и оборудования, включая вычислительную технику
77.33.1 - Аренда и лизинг офисных машин и оборудования
77.33.2 - Аренда и лизинг вычислительных машин и оборудования
77.34 - Аренда и лизинг водных транспортных средств и оборудования
77.35 - Аренда и лизинг воздушных судов и авиационного оборудования
77.39 - Аренда и лизинг прочих видов транспорта, оборудования и материальных средств, не включенных в другие группировки
77.39.1 - Аренда и лизинг прочих сухопутных транспортных средств и оборудования
77.39.11 - Аренда и лизинг прочего автомобильного транспорта и оборудования
77.39.12 - Аренда и лизинг железнодорожного транспорта и оборудования
77.39.2 - Аренда и лизинг прочих машин и оборудования, не включенных в другие группировки
77.39.21 - Аренда и лизинг двигателей, турбин и станков
77.39.22 - Аренда и лизинг горного и нефтепромыслового оборудования
77.39.23 - Аренда и лизинг подъемно-транспортного оборудования
77.39.24 - Аренда и лизинг профессиональной радио- и телевизионной аппаратуры и аппаратуры связи
77.39.25 - Аренда и лизинг контрольно-измерительной аппаратуры
77.39.26 - Аренда и лизинг приборов, аппаратов и прочего оборудования, применяемого в медицинских целях
77.39.27 - Аренда и лизинг торгового оборудования
77.39.29 - Аренда и лизинг прочих машин и оборудования научного и промышленного назначения
77.39.3 - Аренда и лизинг племенных сельскохозяйственных животных
77.4 - Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав
77.40 - Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав
78 - Деятельность по трудоустройству и подбору персонала
78.1 - Деятельность агентств по подбору персонала
78.10 - Деятельность агентств по подбору персонала
78.2 - Деятельность агентств по временному трудоустройству
78.20 - Деятельность агентств по временному трудоустройству
78.3 - Деятельность по подбору персонала прочая
78.30 - Деятельность по подбору персонала прочая
79 - Деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма
79.1 - Деятельность туристических агентств и туроператоров
79.11 - Деятельность туристических агентств
79.12 - Деятельность туроператоров
79.9 - Услуги по бронированию прочие и сопутствующая деятельность
79.90 - Услуги по бронированию прочие и сопутствующая деятельность
79.90.1 - Деятельность по предоставлению туристических информационных услуг
79.90.2 - Деятельность по предоставлению экскурсионных туристических услуг
79.90.21 - Деятельность туристических агентств по предоставлению экскурсионных туристических услуг
79.90.22 - Деятельность самостоятельных экскурсоводов и гидов по предоставлению экскурсионных туристических услуг
79.90.3 - Деятельность по предоставлению туристических услуг, связанных с бронированием
79.90.31 - Деятельность по бронированию билетов на культурно-развлекательные мероприятия
79.90.32 - Деятельность по оказанию прочих услуг, связанных со службой предварительных заказов
80 - Деятельность по обеспечению безопасности и проведению расследований
80.1 - Деятельность частных охранных служб
80.10 - Деятельность частных охранных служб
80.2 - Деятельность систем обеспечения безопасности
80.20 - Деятельность систем обеспечения безопасности
80.3 - Деятельность по расследованию
80.30 - Деятельность по расследованию
81 - Деятельность по обслуживанию зданий и территорий
81.1 - Деятельность по комплексному обслуживанию помещений
81.10 - Деятельность по комплексному обслуживанию помещений
81.2 - Деятельность по чистке и уборке
81.21 - Деятельность по общей уборке зданий
81.21.1 - Деятельность по уборке квартир и частных домов
81.21.9 - Деятельность по уборке прочих типов зданий и помещений
81.22 - Деятельность по чистке и уборке жилых зданий и нежилых помещений прочая
81.29 - Деятельность по чистке и уборке прочая
81.29.1 - Дезинфекция, дезинсекция, дератизация зданий, промышленного оборудования
81.29.2 - Подметание улиц и уборка снега
81.29.9 - Деятельность по чистке и уборке прочая, не включенная в другие группировки
81.3 - Предоставление услуг по благоустройству ландшафта
81.30 - Деятельность по благоустройству ландшафта
82 - Деятельность административно-хозяйственная, вспомогательная деятельность по обеспечению функционирования организации, деятельность по предоставлению прочих вспомогательных услуг для бизнеса
82.1 - Деятельность административно-хозяйственная и вспомогательная деятельность по обеспечению функционирования организации
82.11 - Деятельность административно-хозяйственная комплексная по обеспечению работы организации
82.19 - Деятельность по фотокопированию и подготовке документов и прочая специализированная вспомогательная деятельность по обеспечению деятельности офиса
82.2 - Деятельность центров обработки телефонных вызовов
82.20 - Деятельность центров обработки телефонных вызовов
82.3 - Деятельность по организации конференций и выставок
82.30 - Деятельность по организации конференций и выставок
82.9 - Деятельность по предоставлению вспомогательных услуг для бизнеса, не включенная в другие группировки
82.91 - Деятельность агентств по сбору платежей и бюро кредитной информации
82.92 - Деятельность по упаковыванию товаров
82.99 - Деятельность по предоставлению прочих вспомогательных услуг для бизнеса, не включенная в другие группировки
84 - Деятельность органов государственного управления по обеспечению военной безопасности, обязательному социальному обеспечению
84.1 - Деятельность органов государственного управления и местного самоуправления по вопросам общего и социально-экономического характера
84.11 - Деятельность органов государственного управления и местного самоуправления по вопросам общего характера
84.11.1 - Деятельность федеральных органов государственной власти по управлению вопросами общего характера, кроме судебной власти
84.11.11 - Деятельность федеральных органов государственной власти, кроме полномочных представителей Президента Российской Федерации и территориальных органов федеральных органов исполнительной власти
84.11.12 - Деятельность полномочных представителей Президента Российской Федерации в регионах Российской Федерации и территориальных органов федеральных органов исполнительной власти в субъектах Российской Федерации (республиках, краях, областях)
84.11.13 - Деятельность территориальных органов федеральных органов исполнительной власти в городах и районах субъектов Российской Федерации
84.11.2 - Деятельность органов государственной власти по управлению вопросами общего характера, кроме судебной власти, субъектов Российской Федерации
84.11.21 - Деятельность органов государственной власти субъектов Российской Федерации (республик, краев, областей), кроме судебной власти, представительств исполнительных органов государственной власти субъектов Российской Федерации при Президенте Российской Федерации
84.11.22 - Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в городах и районах
84.11.23 - Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в сельских населенных пунктах
84.11.3 - Деятельность органов местного самоуправления по управлению вопросами общего характера
84.11.31 - Деятельность органов местного самоуправления сельских поселений
84.11.32 - Деятельность органов местного самоуправления городских поселений
84.11.33 - Деятельность органов местного самоуправления муниципальных районов
84.11.34 - Деятельность органов местного самоуправления муниципальных округов
84.11.35 - Деятельность органов местного самоуправления городских округов
84.11.36 - Деятельность органов местного самоуправления городских округов с внутригородским делением
84.11.37 - Деятельность органов местного самоуправления внутригородских районов
84.11.38 - Деятельность органов местного самоуправления внутригородских территорий городов федерального значения
84.11.4 - Управление финансовой деятельностью и деятельностью в сфере налогообложения
84.11.5 - Управление деятельностью в области прогнозирования и планирования
84.11.6 - Управление деятельностью в области фундаментальных исследований
84.11.7 - Управление деятельностью в области статистики
84.11.8 - Управление имуществом, находящимся в государственной собственности
84.11.9 - Управление деятельностью в области антимонопольного контроля
84.12 - Государственное регулирование деятельности в области здравоохранения, образования, социально-культурного развития и других социальных услуг, кроме социального обеспечения
84.13 - Регулирование и содействие эффективному ведению экономической деятельности предприятий
84.2 - Предоставление государственных услуг обществу
84.21 - Деятельность международная
84.22 - Деятельность, связанная с обеспечением военной безопасности
84.23 - Деятельность в области юстиции и правосудия
84.23.1 - Деятельность федеральных судов
84.23.11 - Деятельность Конституционного суда Российской Федерации
84.23.12 - Деятельность Верховного суда Российской Федерации
84.23.13 - Деятельность кассационных судов общей юрисдикции, апелляционных судов общей юрисдикции, верховных судов республик, краевых, областных судов, судов городов федерального значения, суда автономной области, судов автономных округов
84.23.14 - Деятельность районных судов
84.23.15 - Деятельность военных судов
84.23.17 - Деятельность федеральных арбитражных судов округов
84.23.18 - Деятельность арбитражных апелляционных судов, арбитражных судов субъектов Российской Федерации
84.23.19 - Деятельность специализированных судов
84.23.2 - Деятельность судов субъектов Российской Федерации
84.23.21 - Деятельность конституционных (уставных) судов
84.23.22 - Деятельность мировых судей
84.23.3 - Деятельность органов прокуратуры Российской Федерации
84.23.31 - Деятельность Генеральной прокуратуры Российской Федерации
84.23.32 - Деятельность прокуратур субъектов Российской Федерации
84.23.33 - Деятельность прокуратур городов и районов
84.23.4 - Деятельность по управлению и эксплуатации тюрем, исправительных колоний и других мест лишения свободы, а также по оказанию реабилитационной помощи бывшим заключенным
84.23.5 - Деятельность Следственного комитета Российской Федерации
84.23.51 - Деятельность центрального аппарата Следственного комитета Российской Федерации
84.23.52 - Деятельность Главного военного следственного управления, главных следственных управлений и следственных управлений Следственного комитета Российской Федерации по субъектам Российской Федерации (в том числе подразделений указанных управлений по административным округам) и приравненных к ним специализированных (в том числе военных) следственных управлений и следственных отделов Следственного комитета Российской Федерации
84.24 - Деятельность по обеспечению общественного порядка и безопасности
84.25 - Деятельность по обеспечению безопасности в чрезвычайных ситуациях; деятельность по обеспечению безопасности в области использования атомной энергии
84.25.1 - Деятельность по обеспечению пожарной безопасности
84.25.2 - Деятельность по обеспечению безопасности на водных объектах
84.25.3 - Деятельность по обеспечению безопасности в области использования атомной энергии
84.25.9 - Деятельность по обеспечению безопасности в чрезвычайных ситуациях прочая
84.3 - Деятельность в области обязательного социального обеспечения
84.30 - Деятельность в области обязательного социального обеспечения
85 - Образование
85.1 - Образование общее
85.11 - Образование дошкольное
85.12 - Образование начальное общее
85.13 - Образование основное общее
85.14 - Образование среднее общее
85.2 - Образование профессиональное
85.21 - Образование профессиональное среднее
85.22 - Образование высшее
85.22.1 - Образование высшее - бакалавриат
85.22.2 - Образование высшее - специалитет
85.22.3 - Образование высшее - магистратура
85.23 - Подготовка кадров высшей квалификации
85.3 - Обучение профессиональное
85.30 - Обучение профессиональное
85.4 - Образование дополнительное
85.41 - Образование дополнительное детей и взрослых
85.41.1 - Образование в области спорта и отдыха
85.41.2 - Образование в области культуры
85.41.9 - Образование дополнительное детей и взрослых прочее, не включенное в другие группировки
85.41.91 - Деятельность по организации отдыха детей и их оздоровления
85.42 - Образование профессиональное дополнительное
85.42.1 - Деятельность школ подготовки водителей автотранспортных средств
85.42.2 - Деятельность школ обучения вождению воздушных и плавательных судов, без выдачи коммерческих сертификатов и лицензий
85.42.9 - Деятельность по дополнительному профессиональному образованию прочая, не включенная в другие группировки
86 - Деятельность в области здравоохранения
86.1 - Деятельность больничных организаций
86.10 - Деятельность больничных организаций
86.2 - Медицинская и стоматологическая практика
86.21 - Общая врачебная практика
86.22 - Специальная врачебная практика
86.23 - Стоматологическая практика
86.9 - Деятельность в области медицины прочая
86.90 - Деятельность в области медицины прочая
86.90.1 - Деятельность организаций санитарно-эпидемиологической службы
86.90.2 - Деятельность организаций судебно-медицинской экспертизы
86.90.3 - Деятельность массажных салонов
86.90.4 - Деятельность санаторно-курортных организаций
86.90.9 - Деятельность в области медицины прочая, не включенная в другие группировки
87 - Деятельность по уходу с обеспечением проживания
87.1 - Деятельность по медицинскому уходу с обеспечением проживания
87.10 - Деятельность по медицинскому уходу с обеспечением проживания
87.2 - Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым
87.20 - Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым
87.3 - Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания
87.30 - Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания
87.9 - Деятельность по уходу с обеспечением проживания прочая
87.90 - Деятельность по уходу с обеспечением проживания прочая
88 - Предоставление социальных услуг без обеспечения проживания
88.1 - Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам
88.10 - Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам
88.9 - Предоставление прочих социальных услуг без обеспечения проживания
88.91 - Предоставление услуг по дневному уходу за детьми
88.99 - Предоставление прочих социальных услуг без обеспечения проживания, не включенных в другие группировки
90 - Деятельность творческая, деятельность в области искусства и организации развлечений
90.0 - Деятельность творческая, деятельность в области искусства и организации развлечений
90.01 - Деятельность в области исполнительских искусств
90.02 - Деятельность вспомогательная, связанная с исполнительскими искусствами
90.03 - Деятельность в области художественного творчества
90.04 - Деятельность учреждений культуры и искусства
90.04.1 - Деятельность концертных залов, театров, оперных зданий, мюзик-холлов, включая услуги билетных касс
90.04.2 - Деятельность многоцелевых центров и подобных заведений с преобладанием культурного обслуживания
90.04.3 - Деятельность учреждений клубного типа: клубов, дворцов и домов культуры, домов народного творчества
91 - Деятельность библиотек, архивов, музеев и прочих объектов культуры
91.0 - Деятельность библиотек, архивов, музеев и прочих объектов культуры
91.01 - Деятельность библиотек и архивов
91.02 - Деятельность музеев
91.03 - Деятельность по охране исторических мест и зданий, памятников культуры
91.04 - Деятельность ботанических садов, зоопарков, государственных природных заповедников и национальных парков
91.04.1 - Деятельность зоопарков
91.04.2 - Деятельность государственных природных заповедников (в том числе биосферных)
91.04.3 - Деятельность национальных парков
91.04.4 - Деятельность природных парков
91.04.5 - Деятельность природных заказников
91.04.6 - Деятельность дендрологических парков и ботанических садов
92 - Деятельность по организации и проведению азартных игр и заключению пари, по организации и проведению лотерей
92.1 - Деятельность по организации и проведению азартных игр и заключения пари
92.11 - Деятельность казино
92.12 - Деятельность залов игровых автоматов
92.13 - Деятельность по организации заключения пари
92.2 - Деятельность по организации и проведению лотерей
92.21 - Деятельность организаторов лотерей
92.22 - Деятельность операторов лотерей
92.23 - Деятельность распространителей лотерейных билетов
93 - Деятельность в области спорта, отдыха и развлечений
93.1 - Деятельность в области спорта
93.11 - Деятельность спортивных объектов
93.12 - Деятельность спортивных клубов
93.13 - Деятельность фитнес-центров
93.19 - Деятельность в области спорта прочая
93.2 - Деятельность в области отдыха и развлечений
93.21 - Деятельность парков культуры и отдыха и тематических парков
93.29 - Деятельность зрелищно-развлекательная прочая
93.29.1 - Деятельность парков отдыха и пляжей
93.29.2 - Деятельность танцплощадок, дискотек, школ танцев
93.29.3 - Организация обрядов (свадеб, юбилеев), в т.ч. музыкальное сопровождение
93.29.9 - Деятельность зрелищно-развлекательная прочая, не включенная в другие группировки
94 - Деятельность общественных организаций
94.1 - Деятельность коммерческих, предпринимательских и профессиональных организаций
94.11 - Деятельность коммерческих и предпринимательских членских организаций
94.12 - Деятельность профессиональных членских организаций
94.2 - Деятельность профессиональных союзов
94.20 - Деятельность профессиональных союзов
94.9 - Деятельность прочих общественных организаций
94.91 - Деятельность религиозных организаций
94.92 - Деятельность политических организаций
94.99 - Деятельность прочих общественных организаций, не включенных в другие группировки
95 - Ремонт компьютеров, предметов личного потребления и хозяйственно-бытового назначения
95.1 - Ремонт компьютеров и коммуникационного оборудования
95.11 - Ремонт компьютеров и периферийного компьютерного оборудования
95.12 - Ремонт коммуникационного оборудования
95.2 - Ремонт предметов личного потребления и хозяйственно-бытового назначения
95.21 - Ремонт электронной бытовой техники
95.22 - Ремонт бытовых приборов, домашнего и садового инвентаря
95.22.1 - Ремонт бытовой техники
95.22.2 - Ремонт домашнего и садового оборудования
95.23 - Ремонт обуви и прочих изделий из кожи
95.24 - Ремонт мебели и предметов домашнего обихода
95.24.1 - Ремонт мебели
95.24.2 - Ремонт предметов домашнего обихода
95.25 - Ремонт часов и ювелирных изделий
95.25.1 - Ремонт часов
95.25.2 - Ремонт ювелирных изделий
95.29 - Ремонт прочих предметов личного потребления и бытовых товаров
95.29.1 - Ремонт одежды и текстильных изделий
95.29.11 - Ремонт одежды
95.29.12 - Ремонт текстильных изделий
95.29.13 - Ремонт трикотажных изделий
95.29.2 - Ремонт спортивного и туристского оборудования
95.29.3 - Ремонт игрушек и подобных им изделий
95.29.4 - Ремонт металлоизделий бытового и хозяйственного назначения
95.29.41 - Ремонт предметов и изделий из металла
95.29.42 - Ремонт металлической галантереи, ключей, номерных знаков, указателей улиц
95.29.43 - Заточка пил, чертежных и других инструментов, ножей, ножниц, бритв, коньков и т.п.
95.29.5 - Ремонт бытовых осветительных приборов
95.29.6 - Ремонт велосипедов
95.29.7 - Ремонт и настройка музыкальных инструментов (кроме органов и исторических музыкальных инструментов)
95.29.9 - Ремонт прочих бытовых изделий и предметов личного пользования, не вошедших в другие группировки
96 - Деятельность по предоставлению прочих персональных услуг
96.0 - Деятельность по предоставлению прочих персональных услуг
96.01 - Стирка и химическая чистка текстильных и меховых изделий
96.02 - Предоставление услуг парикмахерскими и салонами красоты
96.02.1 - Предоставление парикмахерских услуг
96.02.2 - Предоставление косметических услуг парикмахерскими и салонами красоты
96.03 - Организация похорон и представление связанных с ними услуг
96.04 - Деятельность физкультурно- оздоровительная
96.09 - Предоставление прочих персональных услуг, не включенных в другие группировки
97 - Деятельность домашних хозяйств с наемными работниками
97.0 - Деятельность домашних хозяйств с наемными работниками
97.00 - Деятельность домашних хозяйств с наемными работниками
98 - Деятельность недифференцированная частных домашних хозяйств по производству товаров и предоставлению услуг для собственного потребления
98.1 - Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления
98.10 - Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления
98.2 - Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления
98.20 - Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления
99 - Деятельность экстерриториальных организаций и органов
99.0 - Деятельность экстерриториальных организаций и органов
99.00 - Деятельность экстерриториальных организаций и органов