<?php

$data = [
    [
        'id' => 2570,
        'name' => 'Производство кожи и изделий из кожи',
        'parent_id' => null,
    ],
    [
        'id' => 2571,
        'name' => 'Дубление и отделка кожи, производство чемоданов, сумок, шорно-седельных изделий из кожи; выделка и крашение меха',
        'parent_id' => 2570,
    ],
    [
        'id' => 2572,
        'name' => 'Дубление и выделка кожи, выделка и крашение меха',
        'parent_id' => 2571,
    ],
    [
        'id' => 2573,
        'name' => 'Выделка и крашение меха',
        'parent_id' => 2572,
    ],
    [
        'id' => 2574,
        'name' => 'Производство замши, пергаментной кожи, лакированной и металлизированной кожи',
        'parent_id' => 2572,
    ],
    [
        'id' => 2575,
        'name' => 'Дубление, выделка и крашение кожи из шкур крупного рогатого скота или животных семейства лошадиных',
        'parent_id' => 2572,
    ],
    [
        'id' => 2576,
        'name' => 'Дубление, выделка и крашение кожи из шкур овец, коз и свиней',
        'parent_id' => 2572,
    ],
    [
        'id' => 2577,
        'name' => 'Дубление, выделка и крашение кожи из шкур прочих животных, производство композиционной кожи',
        'parent_id' => 2572,
    ],
    [
        'id' => 2578,
        'name' => 'Дубление, выделка и крашение кожи из шкур прочих животных',
        'parent_id' => 2577,
    ],
    [
        'id' => 2579,
        'name' => 'Производство композиционной кожи',
        'parent_id' => 2577,
    ],
    [
        'id' => 2580,
        'name' => 'Производство чемоданов, дамских сумок и аналогичных изделий из кожи и других материалов; производство шорно-седельных и других изделий из кожи',
        'parent_id' => 2571,
    ],
    [
        'id' => 2581,
        'name' => 'Производство обуви',
        'parent_id' => 2570,
    ],
    [
        'id' => 2582,
        'name' => 'Производство обуви, кроме спортивной, защитной и ортопедической',
        'parent_id' => 2581,
    ],
    [
        'id' => 2583,
        'name' => 'Производство водонепроницаемой обуви с верхом из резины или пластмассы',
        'parent_id' => 2582,
    ],
    [
        'id' => 2584,
        'name' => 'Производство обуви с верхом из резины и пластмассы, кроме водопроницаемой',
        'parent_id' => 2582,
    ],
    [
        'id' => 2585,
        'name' => 'Производство обуви с верхом из кожи, кроме спортивной обуви, обуви с защитным металлическим подноском и различной специальной обуви',
        'parent_id' => 2582,
    ],
    [
        'id' => 2586,
        'name' => 'Производство обуви с верхом из текстильных материалов, кроме спортивной обуви',
        'parent_id' => 2582,
    ],
    [
        'id' => 2587,
        'name' => 'Производство спортивной обуви',
        'parent_id' => 2581,
    ],
    [
        'id' => 2588,
        'name' => 'Производство защитной обуви',
        'parent_id' => 2581,
    ],
    [
        'id' => 2589,
        'name' => 'Производство обуви с защитным металлическим подноском',
        'parent_id' => 2588,
    ],
    [
        'id' => 2590,
        'name' => 'Производство обуви с защитным металлическим подноском',
        'parent_id' => 2588,
    ],
    [
        'id' => 2591,
        'name' => 'Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий; производство гетр, гамашей и аналогичных изделий',
        'parent_id' => 2581,
    ],
    [
        'id' => 2592,
        'name' => 'Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий',
        'parent_id' => 2591,
    ],
    [
        'id' => 2593,
        'name' => 'Производство гетр, гамашей и аналогичных изделий',
        'parent_id' => 2591,
    ],
    [
        'id' => 2594,
        'name' => 'Пошив обуви и различных дополнений к обуви по индивидуальному заказу населения',
        'parent_id' => 2581,
    ],
    [
        'id' => 2595,
        'name' => 'Обработка древесины и производство изделий из дерева и пробки, кроме мебели, производство изделий из соломки и материалов для плетения',
        'parent_id' => null,
    ],
    [
        'id' => 2596,
        'name' => 'Распиловка и строгание древесины',
        'parent_id' => 2595,
    ],
    [
        'id' => 2597,
        'name' => 'Производство пиломатериалов, кроме профилированных, толщиной более 6 мм; производство непропитанных железнодорожных и трамвайных шпал из древесины',
        'parent_id' => 2596,
    ],
    [
        'id' => 2626,
        'name' => 'Производство пиломатериалов, профилированных по кромке; производство древесного полотна, древесной муки; производство технологической щепы или стружки',
        'parent_id' => 2597,
    ],
    [
        'id' => 2598,
        'name' => 'Производство древесины, пропитанной или обработанной защитными или другими веществами',
        'parent_id' => 2597,
    ],
    [
        'id' => 2599,
        'name' => 'Предоставление услуг по пропитке древесины',
        'parent_id' => 2597,
    ],
    [
        'id' => 2600,
        'name' => 'Производство изделий из дерева, пробки, соломки и материалов для плетения',
        'parent_id' => 2595,
    ],
    [
        'id' => 2601,
        'name' => 'Производство шпона, фанеры, деревянных плит и панелей',
        'parent_id' => 2595,
    ],
    [
        'id' => 2602,
        'name' => 'Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов, древесных плит из древесины и других одревесневших материалов',
        'parent_id' => 2601,
    ],
    [
        'id' => 2603,
        'name' => 'Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов',
        'parent_id' => 2602,
    ],
    [
        'id' => 2604,
        'name' => 'Производство древесно-стружечных плит из древесины или других одревесневших материалов',
        'parent_id' => 2602,
    ],
    [
        'id' => 2605,
        'name' => 'Производство древесно-волокнистых плит из древесины или других одревесневших материалов',
        'parent_id' => 2602,
    ],
    [
        'id' => 2606,
        'name' => 'Производство листов для облицовки, шпона для фанеры, производство прессованной древесины',
        'parent_id' => 2601,
    ],
    [
        'id' => 2607,
        'name' => 'Производство листов для облицовки, шпона для фанеры',
        'parent_id' => 2606,
    ],
    [
        'id' => 2608,
        'name' => 'Производство прессованной древесины',
        'parent_id' => 2606,
    ],
    [
        'id' => 2609,
        'name' => 'Производство сборных паркетных покрытий',
        'parent_id' => 2595,
    ],
    [
        'id' => 2610,
        'name' => 'Производство прочих деревянных строительных конструкций и столярных изделий',
        'parent_id' => 2595,
    ],
    [
        'id' => 2611,
        'name' => 'Производство деревянных строительных конструкций и столярных изделий',
        'parent_id' => 2610,
    ],
    [
        'id' => 2612,
        'name' => 'Производство сборных деревянных строений',
        'parent_id' => 2610,
    ],
    [
        'id' => 2613,
        'name' => 'Производство деревянной тары',
        'parent_id' => 2595,
    ],
    [
        'id' => 2614,
        'name' => 'Производство прочих деревянных изделий; производство изделий из пробки, соломки и материалов для плетения',
        'parent_id' => 2595,
    ],
    [
        'id' => 2615,
        'name' => 'Производство прочих деревянных изделий',
        'parent_id' => 2595,
    ],
    [
        'id' => 2616,
        'name' => 'Производство деревянных инструментов, корпусов и рукояток инструментов, рукояток щеток и метелок, обувных колодок и растяжек для обуви',
        'parent_id' => 2615,
    ],
    [
        'id' => 2617,
        'name' => 'Производство деревянных столовых и кухонных принадлежностей',
        'parent_id' => 2615,
    ],
    [
        'id' => 2618,
        'name' => 'Производство деревянных статуэток и украшений из дерева, мозаики и инкрустированного дерева, шкатулок, футляров для ювелирных изделий или ножей',
        'parent_id' => 2615,
    ],
    [
        'id' => 2619,
        'name' => 'Производство деревянных рам для картин, фотографий, зеркал или аналогичных предметов и прочих изделий из дерева',
        'parent_id' => 2615,
    ],
    [
        'id' => 2620,
        'name' => 'Производство топливных гранул и брикетов из отходов деревопереработки',
        'parent_id' => 2615,
    ],
    [
        'id' => 2621,
        'name' => 'Производство изделий из пробки, соломки и материалов для плетения; производство корзиночных и плетеных изделий',
        'parent_id' => 2595,
    ],
    [
        'id' => 2622,
        'name' => 'Производство изделий из пробки',
        'parent_id' => 2621,
    ],
    [
        'id' => 2623,
        'name' => 'Производство изделий из соломки, эспарто (альфы) и прочих материалов для плетения',
        'parent_id' => 2621,
    ],
    [
        'id' => 2624,
        'name' => 'Производство корзиночных и плетеных изделий',
        'parent_id' => 2621,
    ],
    [
        'id' => 2625,
        'name' => 'Изготовление изделий из дерева, пробки, соломки и материалов для плетения, корзиночных и плетеных изделий по индивидуальному заказу населения',
        'parent_id' => 2595,
    ],
];
