<?php

$data = [
    [
        'id' => 1,
        'name' => 'Растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях',
        'parent_id' => null,
    ],
    [
        'id' => 2,
        'name' => 'Выращивание однолетних культур',
        'parent_id' => 1,
    ],
    [
        'id' => 3,
        'name' => 'Выращивание зерновых (кроме риса), зернобобовых культур и семян масличных культур',
        'parent_id' => 2,
    ],
    [
        'id' => 4,
        'name' => 'Выращивание зерновых культур',
        'parent_id' => 3,
    ],
    [
        'id' => 5,
        'name' => 'Выращивание пшеницы',
        'parent_id' => 4,
    ],
    [
        'id' => 6,
        'name' => 'Выращивание ячменя',
        'parent_id' => 4,
    ],
    [
        'id' => 7,
        'name' => 'Выращивание ржи',
        'parent_id' => 4,
    ],
    [
        'id' => 8,
        'name' => 'Выращивание кукурузы',
        'parent_id' => 4,
    ],
    [
        'id' => 9,
        'name' => 'Выращивание овса',
        'parent_id' => 4,
    ],
    [
        'id' => 10,
        'name' => 'Выращивание гречихи',
        'parent_id' => 4,
    ],
    [
        'id' => 11,
        'name' => 'Выращивание прочих зерновых культур',
        'parent_id' => 4,
    ],
    [
        'id' => 12,
        'name' => 'Выращивание зернобобовых культур',
        'parent_id' => 3,
    ],
    [
        'id' => 13,
        'name' => 'Выращивание семян масличных культур',
        'parent_id' => 3,
    ],
    [
        'id' => 14,
        'name' => 'Выращивание семян подсолнечника',
        'parent_id' => 13,
    ],
    [
        'id' => 15,
        'name' => 'Выращивание семян рапса',
        'parent_id' => 13,
    ],
    [
        'id' => 16,
        'name' => 'Выращивание семян соевых бобов',
        'parent_id' => 13,
    ],
    [
        'id' => 17,
        'name' => 'Выращивание семян прочих масличных культур',
        'parent_id' => 13,
    ],
    [
        'id' => 18,
        'name' => 'Выращивание риса',
        'parent_id' => 2,
    ],
    [
        'id' => 18,
        'name' => 'Выращивание овощей, бахчевых, корнеплодных и клубнеплодных культур, грибов и трюфелей',
        'parent_id' => 2,
    ],
    [
        'id' => 19,
        'name' => 'Выращивание овощей',
        'parent_id' => 18,
    ],
    [
        'id' => 20,
        'name' => 'Выращивание овощей открытого грунта',
        'parent_id' => 19,
    ],
    [
        'id' => 21,
        'name' => 'Выращивание овощей защищенного грунта',
        'parent_id' => 19,
    ],
    [
        'id' => 22,
        'name' => 'Выращивание бахчевых культур',
        'parent_id' => 18,
    ],
    [
        'id' => 23,
        'name' => 'Выращивание столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина',
        'parent_id' => 18,
    ],
    [
        'id' => 24,
        'name' => 'Выращивание картофеля',
        'parent_id' => 23,
    ],
    [
        'id' => 25,
        'name' => 'Выращивание прочих столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина',
        'parent_id' => 23,
    ],
    [
        'id' => 26,
        'name' => 'Выращивание семян овощных культур, за исключением семян сахарной свеклы',
        'parent_id' => 18,
    ],
    [
        'id' => 27,
        'name' => 'Выращивание сахарной свеклы и семян сахарной свеклы',
        'parent_id' => 18,
    ],
    [
        'id' => 28,
        'name' => 'Выращивание сахарной свеклы',
        'parent_id' => 27,
    ],
    [
        'id' => 29,
        'name' => 'Выращивание семян сахарной свеклы',
        'parent_id' => 27,
    ],
    [
        'id' => 30,
        'name' => 'Выращивание грибов и трюфелей',
        'parent_id' => 18,
    ],
    [
        'id' => 31,
        'name' => 'Выращивание овощей, не включенных в другие группировки',
        'parent_id' => 18,
    ],
    [
        'id' => 32,
        'name' => 'Выращивание сахарного тростника',
        'parent_id' => 2,
    ],
    [
        'id' => 33,
        'name' => 'Выращивание табака и махорки',
        'parent_id' => 2,
    ],
    [
        'id' => 34,
        'name' => 'Выращивание волокнистых прядильных культур',
        'parent_id' => 2,
    ],
    [
        'id' => 35,
        'name' => 'Выращивание хлопчатника',
        'parent_id' => 34,
    ],
    [
        'id' => 36,
        'name' => 'Выращивание льна',
        'parent_id' => 34,
    ],
    [
        'id' => 37,
        'name' => 'Выращивание обыкновенной конопли',
        'parent_id' => 34,
    ],
    [
        'id' => 38,
        'name' => 'Выращивание прочих текстильных культур',
        'parent_id' => 34,
    ],
    [
        'id' => 39,
        'name' => 'Выращивание прочих однолетних культур',
        'parent_id' => 2,
    ],
    [
        'id' => 40,
        'name' => 'Выращивание однолетних кормовых культур',
        'parent_id' => 39,
    ],
    [
        'id' => 41,
        'name' => 'Цветоводство',
        'parent_id' => 39,
    ],
    [
        'id' => 42,
        'name' => 'Выращивание цветов в открытом и защищенном грунте',
        'parent_id' => 41,
    ],
    [
        'id' => 43,
        'name' => 'Выращивание семян цветов',
        'parent_id' => 41,
    ],
    [
        'id' => 44,
        'name' => 'Выращивание семян свеклы (кроме семян сахарной свеклы) и семян кормовых культур',
        'parent_id' => 39,
    ],
    [
        'id' => 45,
        'name' => 'Выращивание прочих однолетних культур, не включенных в другие группировки',
        'parent_id' => 39,
    ],
    [
        'id' => 46,
        'name' => 'Выращивание многолетних культур',
        'parent_id' => 1,
    ],
    [
        'id' => 47,
        'name' => 'Выращивание винограда',
        'parent_id' => 46,
    ],
    [
        'id' => 47,
        'name' => 'Выращивание винограда',
        'parent_id' => 46,
    ],
    [
        'id' => 48,
        'name' => 'Выращивание тропических и субтропических культур',
        'parent_id' => 46,
    ],
    [
        'id' => 49,
        'name' => 'Выращивание цитрусовых культур',
        'parent_id' => 46,
    ],
    [
        'id' => 50,
        'name' => 'Выращивание семечковых и косточковых культур',
        'parent_id' => 46,
    ],
    [
        'id' => 51,
        'name' => 'Выращивание прочих плодовых деревьев, кустарников и орехов',
        'parent_id' => 46,
    ],
    [
        'id' => 52,
        'name' => 'Выращивание прочих плодовых и ягодных культур',
        'parent_id' => 51,
    ],
    [
        'id' => 53,
        'name' => 'Выращивание семян плодовых и ягодных культур',
        'parent_id' => 51,
    ],
    [
        'id' => 54,
        'name' => 'Выращивание орехоплодных культур',
        'parent_id' => 51,
    ],
    [
        'id' => 55,
        'name' => 'Выращивание плодов масличных культур',
        'parent_id' => 46,
    ],
    [
        'id' => 56,
        'name' => 'Выращивание культур для производства напитков',
        'parent_id' => 46,
    ],
    [
        'id' => 57,
        'name' => 'Выращивание чая',
        'parent_id' => 56,
    ],
    [
        'id' => 58,
        'name' => 'Выращивание прочих культур для производства напитков',
        'parent_id' => 56,
    ],
    [
        'id' => 59,
        'name' => 'Выращивание специй, пряно-ароматических, эфиромасличных и лекарственных культур',
        'parent_id' => 46,
    ],
    [
        'id' => 60,
        'name' => 'Выращивание пряностей',
        'parent_id' => 59,
    ],
    [
        'id' => 61,
        'name' => 'Выращивание хмеля',
        'parent_id' => 59,
    ],
    [
        'id' => 62,
        'name' => 'Выращивание растений, используемых в основном в парфюмерии, фармации или в качестве инсектицидов, фунгицидов и для аналогичных целей',
        'parent_id' => 59,
    ],
    [
        'id' => 63,
        'name' => 'Выращивание прочих многолетних культур',
        'parent_id' => 46,
    ],
    [
        'id' => 64,
        'name' => 'Выращивание рассады',
        'parent_id' => 1,
    ],
    [
        'id' => 65,
        'name' => 'Животноводство',
        'parent_id' => 1,
    ],
    [
        'id' => 66,
        'name' => 'Разведение молочного крупного рогатого скота, производство сырого молока',
        'parent_id' => 65,
    ],
    [
        'id' => 67,
        'name' => 'Разведение молочного крупного рогатого скота',
        'parent_id' => 66,
    ],
    [
        'id' => 68,
        'name' => 'Разведение молочного крупного рогатого скота, кроме племенного',
        'parent_id' => 67,
    ],
    [
        'id' => 69,
        'name' => 'Разведение племенного молочного крупного рогатого скота',
        'parent_id' => 67,
    ],
    [
        'id' => 70,
        'name' => 'Разведение прочих пород крупного рогатого скота и буйволов, производство спермы',
        'parent_id' => 65,
    ],
    [
        'id' => 71,
        'name' => 'Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др.',
        'parent_id' => 70,
    ],
    [
        'id' => 72,
        'name' => 'Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др. на мясо',
        'parent_id' => 71,
    ],
    [
        'id' => 73,
        'name' => 'Разведение племенного мясного и прочего крупного рогатого скота, включая буйволов, яков и др.',
        'parent_id' => 71,
    ],
    [
        'id' => 74,
        'name' => 'Производство бычьей спермы, а также спермы буйволов, яков и др.',
        'parent_id' => 70,
    ],
    [
        'id' => 75,
        'name' => 'Разведение лошадей и прочих животных семейства лошадиных отряда непарнокопытных',
        'parent_id' => 65,
    ],
    [
        'id' => 76,
        'name' => 'Разведение лошадей, ослов, мулов, лошаков',
        'parent_id' => 75,
    ],
    [
        'id' => 77,
        'name' => 'Производство сырого кобыльего молока',
        'parent_id' => 75,
    ],
    [
        'id' => 78,
        'name' => 'Производство спермы жеребцов и ослов',
        'parent_id' => 75,
    ],
    [
        'id' => 79,
        'name' => 'Разведение верблюдов и прочих животных семейства верблюжьих',
        'parent_id' => 65,
    ],
    [
        'id' => 80,
        'name' => 'Разведение овец и коз',
        'parent_id' => 65,
    ],
    [
        'id' => 81,
        'name' => 'Разведение овец и коз',
        'parent_id' => 80,
    ],
    [
        'id' => 82,
        'name' => 'Производство сырого овечьего и козьего молока',
        'parent_id' => 80,
    ],
    [
        'id' => 83,
        'name' => 'Производство сырой (немытой) шерсти и волоса козы',
        'parent_id' => 80,
    ],
    [
        'id' => 84,
        'name' => 'Разведение племенных овец и коз',
        'parent_id' => 80,
    ],
    [
        'id' => 85,
        'name' => 'Разведение свиней',
        'parent_id' => 65,
    ],
    [
        'id' => 86,
        'name' => 'Выращивание и разведение свиней',
        'parent_id' => 85,
    ],
    [
        'id' => 87,
        'name' => 'Выращивание свиней на мясо',
        'parent_id' => 86,
    ],
    [
        'id' => 88,
        'name' => 'Разведение племенного поголовья свиней',
        'parent_id' => 86,
    ],
    [
        'id' => 89,
        'name' => 'Производство спермы хряков',
        'parent_id' => 85,
    ],
    [
        'id' => 90,
        'name' => 'Разведение сельскохозяйственной птицы',
        'parent_id' => 65,
    ],
    [
        'id' => 91,
        'name' => 'Выращивание и разведение сельскохозяйственной птицы: кур, индеек, уток, гусей и цесарок',
        'parent_id' => 90,
    ],
    [
        'id' => 92,
        'name' => 'Выращивание сельскохозяйственной птицы на мясо',
        'parent_id' => 91
    ],
    [
        'id' => 93,
        'name' => 'Разведение племенной сельскохозяйственной птицы',
        'parent_id' => 91
    ],
    [
        'id' => 94,
        'name' => 'Производство яиц сельскохозяйственной птицы',
        'parent_id' => 90,
    ],
    [
        'id' => 94,
        'name' => 'Деятельность инкубаторов для птицеводства',
        'parent_id' => 90,
    ],
    [
        'id' => 95,
        'name' => 'Разведение прочих животных',
        'parent_id' => 65,
    ],
    [
        'id' => 96,
        'name' => 'Пчеловодство',
        'parent_id' => 95,
    ],
    [
        'id' => 97,
        'name' => 'Пчеловодство медового направления',
        'parent_id' => 96,
    ],
    [
        'id' => 98,
        'name' => 'Пчеловодство опылительного направления',
        'parent_id' => 96,
    ],
    [
        'id' => 99,
        'name' => 'Пчеловодство разведенческого направления',
        'parent_id' => 96,
    ],
    [
        'id' => 100,
        'name' => 'Разведение кроликов и прочих пушных зверей на фермах',
        'parent_id' => 95,
    ],
    [
        'id' => 101,
        'name' => 'Разведение кроликов, производство тонкого волоса кроликов на фермах',
        'parent_id' => 100,
    ],
    [
        'id' => 102,
        'name' => 'Разведение прочих пушных зверей на фермах',
        'parent_id' => 100,
    ],
    [
        'id' => 103,
        'name' => 'Разведение шелкопряда',
        'parent_id' => 95,
    ],
    [
        'id' => 104,
        'name' => 'Производство грен шелкопряда',
        'parent_id' => 103,
    ],
    [
        'id' => 105,
        'name' => 'Производство коконов шелкопряда',
        'parent_id' => 103,
    ],
    [
        'id' => 106,
        'name' => 'Разведение оленей',
        'parent_id' => 95,
    ],
    [
        'id' => 107,
        'name' => 'Разведение домашних северных оленей',
        'parent_id' => 106,
    ],
    [
        'id' => 108,
        'name' => 'Разведение пятнистых оленей, ланей',
        'parent_id' => 106,
    ],
    [
        'id' => 109,
        'name' => 'Разведение благородных оленей (европейских, кавказских, маралов, изюбрей)',
        'parent_id' => 106,
    ],
    [
        'id' => 110,
        'name' => 'Производство пантов северных оленей, пятнистых оленей, благородных оленей (европейских, кавказских, маралов, изюбрей), ланей',
        'parent_id' => 106,
    ],
    [
        'id' => 111,
        'name' => 'Разведение домашних животных',
        'parent_id' => 95,
    ],
    [
        'id' => 112,
        'name' => 'Разведение лабораторных животных',
        'parent_id' => 95,
    ],
    [
        'id' => 113,
        'name' => 'Разведение дождевых червей',
        'parent_id' => 95,
    ],
    [
        'id' => 114,
        'name' => 'Разведение прочих животных, не включенных в другие группировки',
        'parent_id' => 95,
    ],
    [
        'id' => 115,
        'name' => 'Смешанное сельское хозяйство',
        'parent_id' => 1,
    ],
    [
        'id' => 116,
        'name' => 'Деятельность вспомогательная в области производства сельскохозяйственных культур и послеуборочной обработки сельхозпродукции',
        'parent_id' => 1,
    ],
    [
        'id' => 117,
        'name' => 'Предоставление услуг в области растениеводства',
        'parent_id' => 115,
    ],
    [
        'id' => 118,
        'name' => 'Предоставление услуг в области животноводства',
        'parent_id' => 115,
    ],
    [
        'id' => 119,
        'name' => 'Деятельность сельскохозяйственная после сбора урожая',
        'parent_id' => 115,
    ],
    [
        'id' => 120,
        'name' => 'Обработка семян для посадки',
        'parent_id' => 115,
    ],
    [
        'id' => 121,
        'name' => 'Охота, отлов и отстрел диких животных, включая предоставление услуг в этих областях',
        'parent_id' => 1,
    ],
    [
        'id' => 122,
        'name' => 'Лесоводство и лесозаготовки',
        'parent_id' => null,
    ],
    [
        'id' => 123,
        'name' => 'Лесоводство и прочая лесохозяйственная деятельность',
        'parent_id' => 122,
    ],
    [
        'id' => 124,
        'name' => 'Деятельность лесопитомников',
        'parent_id' => 123,
    ],
    [
        'id' => 125,
        'name' => 'Выращивание посадочного материала лесных растений (саженцев, сеянцев)',
        'parent_id' => 124,
    ],
    [
        'id' => 126,
        'name' => 'Выращивание прочей продукции лесопитомниками',
        'parent_id' => 124,
    ],
    [
        'id' => 127,
        'name' => 'Деятельность лесохозяйственная прочая',
        'parent_id' => 123,
    ],
    [
        'id' => 127,
        'name' => 'Деятельность лесохозяйственная прочая',
        'parent_id' => 123,
    ],
    [
        'id' => 128,
        'name' => 'Лесозаготовки',
        'parent_id' => 122,
    ],
    [
        'id' => 129,
        'name' => 'Сбор и заготовка пищевых лесных ресурсов, недревесных лесных ресурсов и лекарственных растений',
        'parent_id' => 122,
    ],
    [
        'id' => 130,
        'name' => 'Сбор и заготовка пищевых лесных ресурсов',
        'parent_id' => 129,
    ],
    [
        'id' => 131,
        'name' => 'Сбор и заготовка дикорастущих грибов',
        'parent_id' => 130,
    ],
    [
        'id' => 132,
        'name' => 'Сбор и заготовка дикорастущих плодов, ягод',
        'parent_id' => 130,
    ],
    [
        'id' => 133,
        'name' => 'Сбор и заготовка дикорастущих орехов',
        'parent_id' => 130,
    ],
    [
        'id' => 134,
        'name' => 'Сбор лекарственных растений',
        'parent_id' => 130,
    ],
    [
        'id' => 135,
        'name' => 'Сбор и заготовка недревесных лесных ресурсов',
        'parent_id' => 129,
    ],
    [
        'id' => 136,
        'name' => 'Предоставление услуг в области лесоводства и лесозаготовок',
        'parent_id' => 122,
    ],
    [
        'id' => 137,
        'name' => 'Предоставление услуг в области лесоводства',
        'parent_id' => 136,
    ],
    [
        'id' => 138,
        'name' => 'Предоставление услуг в области лесозаготовок',
        'parent_id' => 136,
    ],
    [
        'id' => 139,
        'name' => 'Рыболовство и рыбоводство',
        'parent_id' => null,
    ],
    [
        'id' => 140,
        'name' => 'Рыболовство',
        'parent_id' => 139,
    ],
    [
        'id' => 141,
        'name' => 'Рыболовство морское',
        'parent_id' => 140,
    ],
    [
        'id' => 142,
        'name' => 'Рыболовство морское промышленное',
        'parent_id' => 141,
    ],
    [
        'id' => 143,
        'name' => 'Рыболовство морское прибрежное',
        'parent_id' => 141,
    ],
    [
        'id' => 144,
        'name' => 'Рыболовство в научно-исследовательских и контрольных целях',
        'parent_id' => 141,
    ],
    [
        'id' => 145,
        'name' => 'Рыболовство в учебных и культурно-просветительских целях',
        'parent_id' => 141,
    ],
    [
        'id' => 146,
        'name' => 'Рыболовство морское в целях аквакультуры (рыбоводства)',
        'parent_id' => 141,
    ],
    [
        'id' => 147,
        'name' => 'Рыболовство пресноводное',
        'parent_id' => 140,
    ],
    [
        'id' => 148,
        'name' => 'Рыболовство пресноводное промышленное',
        'parent_id' => 147,
    ],
    [
        'id' => 149,
        'name' => 'Рыболовство пресноводное в целях аквакультуры (рыбоводства)',
        'parent_id' => 147,
    ],
    [
        'id' => 150,
        'name' => 'Рыболовство любительское и спортивное',
        'parent_id' => 147,
    ],
    [
        'id' => 151,
        'name' => 'Рыболовство в целях обеспечения ведения традиционного образа жизни и осуществления традиционной хозяйственной деятельности коренных малочисленных народов Севера, Сибири и Дальнего Востока Российской Федерации',
        'parent_id' => 147,
    ],
    [
        'id' => 152,
        'name' => 'Рыбоводство',
        'parent_id' => 139,
    ],
    [
        'id' => 153,
        'name' => 'Рыбоводство морское',
        'parent_id' => 152,
    ],
    [
        'id' => 154,
        'name' => 'Рыбоводство морское индустриальное',
        'parent_id' => 153,
    ],
    [
        'id' => 155,
        'name' => 'Рыбоводство морское пастбищное',
        'parent_id' => 153,
    ],
    [
        'id' => 156,
        'name' => 'Мелиорация рыбохозяйственная морских и минерализированных водных объектов',
        'parent_id' => 153,
    ],
    [
        'id' => 157,
        'name' => 'Воспроизводство морских биоресурсов искусственное',
        'parent_id' => 153,
    ],
    [
        'id' => 158,
        'name' => 'Акклиматизация морских биоресурсов',
        'parent_id' => 153,
    ],
    [
        'id' => 159,
        'name' => 'Деятельность по морскому рыбоводству прочая',
        'parent_id' => 153,
    ],
    [
        'id' => 160,
        'name' => 'Рыбоводство пресноводное',
        'parent_id' => 152,
    ],
    [
        'id' => 161,
        'name' => 'Рыбоводство пресноводное индустриальное',
        'parent_id' => 160,
    ],
    [
        'id' => 162,
        'name' => 'Рыбоводство пресноводное пастбищное',
        'parent_id' => 160,
    ],
    [
        'id' => 163,
        'name' => 'Рыбоводство прудовое',
        'parent_id' => 160,
    ],
    [
        'id' => 164,
        'name' => 'Рыбоводство прудовое',
        'parent_id' => 160,
    ],
    [
        'id' => 165,
        'name' => 'Мелиорация рыбохозяйственная пресноводных объектов',
        'parent_id' => 160,
    ],
    [
        'id' => 166,
        'name' => 'Воспроизводство пресноводных биоресурсов искусственное',
        'parent_id' => 160,
    ],
    [
        'id' => 167,
        'name' => 'Акклиматизация пресноводных биоресурсов',
        'parent_id' => 160,
    ],
    [
        'id' => 167,
        'name' => 'Деятельность по пресноводному рыбоводству прочая',
        'parent_id' => 160,
    ],
    [
        'id' => 168,
        'name' => 'Добыча угля',
        'parent_id' => null,
    ],
    [
        'id' => 169,
        'name' => 'Добыча и обогащение угля и антрацита',
        'parent_id' => 168,
    ],
    [
        'id' => 170,
        'name' => 'Добыча угля и антрацита',
        'parent_id' => 169,
    ],
    [
        'id' => 171,
        'name' => 'Добыча антрацита открытым способом',
        'parent_id' => 170,
    ],
    [
        'id' => 172,
        'name' => 'Добыча коксующегося антрацита открытым способом',
        'parent_id' => 170,
    ],
    [
        'id' => 173,
        'name' => 'Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, открытым способом',
        'parent_id' => 170,
    ],
    [
        'id' => 174,
        'name' => 'Добыча антрацита подземным способом',
        'parent_id' => 170,
    ],
    [
        'id' => 175,
        'name' => 'Добыча коксующегося угля подземным способом',
        'parent_id' => 170,
    ],
    [
        'id' => 176,
        'name' => 'Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, подземным способом',
        'parent_id' => 170,
    ],
    [
        'id' => 177,
        'name' => 'Обогащение угля',
        'parent_id' => 169,
    ],
    [
        'id' => 178,
        'name' => 'Обогащение антрацита',
        'parent_id' => 177,
    ],
    [
        'id' => 179,
        'name' => 'Обогащение коксующегося угля',
        'parent_id' => 177,
    ],
    [
        'id' => 180,
        'name' => 'Обогащение угля, кроме антрацита, угля коксующегося и угля бурого',
        'parent_id' => 177,
    ],
    [
        'id' => 181,
        'name' => 'Добыча и обогащение бурого угля (лигнита)',
        'parent_id' => 168,
    ],
    [
        'id' => 182,
        'name' => 'Добыча бурого угля (лигнита)',
        'parent_id' => 181,
    ],
    [
        'id' => 183,
        'name' => 'Добыча бурого угля (лигнита) открытым способом',
        'parent_id' => 182,
    ],
    [
        'id' => 184,
        'name' => 'Добыча бурого угля (лигнита) подземным способом',
        'parent_id' => 182,
    ],
    [
        'id' => 185,
        'name' => 'Обогащение бурого угля (лигнита)',
        'parent_id' => 181,
    ],
    [
        'id' => 186,
        'name' => 'Добыча нефти и природного газа',
        'parent_id' => null,
    ],
    [
        'id' => 187,
        'name' => 'Добыча нефти и нефтяного (попутного) газа',
        'parent_id' => 186,
    ],
    [
        'id' => 188,
        'name' => 'Добыча нефти',
        'parent_id' => 187,
    ],
    [
        'id' => 189,
        'name' => 'Добыча горючих (битуминозных) сланцев, песка и озокерита',
        'parent_id' => 187,
    ],
    [
        'id' => 190,
        'name' => 'Добыча нефтяного (попутного) газа',
        'parent_id' => 187,
    ],
    [
        'id' => 191,
        'name' => 'Добыча природного газа и газового конденсата',
        'parent_id' => 186,
    ],
    [
        'id' => 192,
        'name' => 'Добыча природного газа',
        'parent_id' => 191,
    ],
    [
        'id' => 193,
        'name' => 'Добыча газового конденсата',
        'parent_id' => 191,
    ],
    [
        'id' => 194,
        'name' => 'Добыча металлических руд',
        'parent_id' => null,
    ],
    [
        'id' => 195,
        'name' => 'Добыча и обогащение железных руд',
        'parent_id' => 194,
    ],
    [
        'id' => 196,
        'name' => 'Добыча железных руд подземным способом',
        'parent_id' => 195,
    ],
    [
        'id' => 197,
        'name' => 'Добыча железных руд открытым способом',
        'parent_id' => 195,
    ],
    [
        'id' => 198,
        'name' => 'Обогащение и агломерация железных руд',
        'parent_id' => 195,
    ],
    [
        'id' => 198,
        'name' => 'Добыча руд цветных металлов',
        'parent_id' => 194,
    ],
    [
        'id' => 199,
        'name' => 'Добыча урановой и ториевой руд',
        'parent_id' => 198,
    ],
    [
        'id' => 200,
        'name' => 'Добыча и первичное обогащение урановых руд',
        'parent_id' => 199,
    ],
    [
        'id' => 201,
        'name' => 'Добыча и первичное обогащение ториевых руд',
        'parent_id' => 199,
    ],
    [
        'id' => 202,
        'name' => 'Добыча руд прочих цветных металлов',
        'parent_id' => 198,
    ],
    [
        'id' => 203,
        'name' => 'Добыча и обогащение медной руды',
        'parent_id' => 202,
    ],
    [
        'id' => 204,
        'name' => 'Добыча и обогащение никелевой и кобальтовой руд',
        'parent_id' => 202,
    ],
    [
        'id' => 205,
        'name' => 'Добыча и обогащение никелевой руды',
        'parent_id' => 204,
    ],
    [
        'id' => 206,
        'name' => 'Добыча и обогащение кобальтовой руды',
        'parent_id' => 204,
    ],
    [
        'id' => 207,
        'name' => 'Добыча и обогащение алюминийсодержащего сырья (бокситов и нефелин-апатитовых руд)',
        'parent_id' => 202,
    ],
    [
        'id' => 208,
        'name' => 'Добыча алюминийсодержащего сырья подземным способом',
        'parent_id' => 207,
    ],
    [
        'id' => 209,
        'name' => 'Добыча алюминийсодержащего сырья открытым способом',
        'parent_id' => 207,
    ],
    [
        'id' => 210,
        'name' => 'Обогащение нефелин-апатитовых руд',
        'parent_id' => 207,
    ],
    [
        'id' => 211,
        'name' => 'Добыча руд и песков драгоценных металлов и руд редких металлов',
        'parent_id' => 202,
    ],
    [
        'id' => 212,
        'name' => 'Добыча руд и песков драгоценных металлов (золота, серебра и металлов платиновой группы)',
        'parent_id' => 211,
    ],
    [
        'id' => 213,
        'name' => 'Добыча и обогащение руд редких металлов (циркония, тантала, ниобия и т. п.)',
        'parent_id' => 211,
    ],
    [
        'id' => 214,
        'name' => 'Добыча и обогащение свинцово-цинковой руды',
        'parent_id' => 202,
    ],
    [
        'id' => 215,
        'name' => 'Добыча и обогащение оловянной руды',
        'parent_id' => 202,
    ],
    [
        'id' => 216,
        'name' => 'Добыча и обогащение титаномагниевого сырья',
        'parent_id' => 202,
    ],
    [
        'id' => 217,
        'name' => 'Добыча и обогащение вольфраммолибденовой руды',
        'parent_id' => 202,
    ],
    [
        'id' => 218,
        'name' => 'Добыча и обогащение руд прочих цветных металлов',
        'parent_id' => 202,
    ],
    [
        'id' => 219,
        'name' => 'Добыча и обогащение сурьмяно-ртутных руд',
        'parent_id' => 218,
    ],
    [
        'id' => 220,
        'name' => 'Добыча и обогащение марганцевых руд',
        'parent_id' => 218,
    ],
    [
        'id' => 221,
        'name' => 'Добыча и обогащение хромовых (хромитовых) руд',
        'parent_id' => 218,
    ],
    [
        'id' => 222,
        'name' => 'Добыча и обогащение руд прочих цветных металлов, не включенных в другие группировки',
        'parent_id' => 218,
    ],
    [
        'id' => 223,
        'name' => 'Добыча прочих полезных ископаемых',
        'parent_id' => null,
    ],
    [
        'id' => 224,
        'name' => 'Добыча камня, песка и глины',
        'parent_id' => 223,
    ],
    [
        'id' => 225,
        'name' => 'Добыча декоративного и строительного камня, известняка, гипса, мела и сланцев',
        'parent_id' => 224,
    ],
    [
        'id' => 226,
        'name' => 'Добыча и первичная обработка камня для памятников и строительства',
        'parent_id' => 225,
    ],
    [
        'id' => 227,
        'name' => 'Добыча и первичная обработка известняка и гипсового камня',
        'parent_id' => 225,
    ],
    [
        'id' => 228,
        'name' => 'Добыча мела и некальцинированного доломита',
        'parent_id' => 225,
    ],
    [
        'id' => 229,
        'name' => 'Добыча и первичная обработка сланцев',
        'parent_id' => 225,
    ],
    [
        'id' => 230,
        'name' => 'Разработка гравийных и песчаных карьеров, добыча глины и каолина',
        'parent_id' => 224,
    ],
    [
        'id' => 231,
        'name' => 'Разработка гравийных и песчаных карьеров',
        'parent_id' => 230,
    ],
    [
        'id' => 232,
        'name' => 'Разработка глины и каолина',
        'parent_id' => 230,
    ],
    [
        'id' => 233,
        'name' => 'Добыча полезных ископаемых, не включенных в другие группировки',
        'parent_id' => 223,
    ],
    [
        'id' => 234,
        'name' => 'Добыча минерального сырья для химической промышленности и производства минеральных удобрений',
        'parent_id' => 233,
    ],
    [
        'id' => 235,
        'name' => 'Добыча и агломерация торфа',
        'parent_id' => 233,
    ],
    [
        'id' => 236,
        'name' => 'Добыча торфа',
        'parent_id' => 235,
    ],
    [
        'id' => 237,
        'name' => 'Агломерация торфа',
        'parent_id' => 235,
    ],
    [
        'id' => 238,
        'name' => 'Добыча соли',
        'parent_id' => 233,
    ],
    [
        'id' => 239,
        'name' => 'Добыча прочих полезных ископаемых, не включенных в другие группировки',
        'parent_id' => 233,
    ],
    [
        'id' => 240,
        'name' => 'Добыча природного асфальта, асфальтитов и битумных пород',
        'parent_id' => 239,
    ],
    [
        'id' => 241,
        'name' => 'Добыча абразивных материалов, асбеста, кремнеземистой каменной муки, природных графитов, мыльного камня (талька), полевого шпата и т.д.',
        'parent_id' => 239,
    ],
    [
        'id' => 242,
        'name' => 'Добыча природных абразивов, кроме алмазов',
        'parent_id' => 241,
    ],
    [
        'id' => 243,
        'name' => 'Добыча вермикулита',
        'parent_id' => 241,
    ],
    [
        'id' => 244,
        'name' => 'Добыча асбеста хризотилового',
        'parent_id' => 241,
    ],
    [
        'id' => 245,
        'name' => 'Добыча драгоценных камней, кварца, слюды, мусковита и т. д.',
        'parent_id' => 239,
    ],
    [
        'id' => 246,
        'name' => 'Добыча драгоценных камней и полудрагоценных камней, кроме алмазов',
        'parent_id' => 245,
    ],
    [
        'id' => 247,
        'name' => 'Добыча алмазов',
        'parent_id' => 245,
    ],
    [
        'id' => 248,
        'name' => 'Добыча мусковита',
        'parent_id' => 245,
    ],
    [
        'id' => 249,
        'name' => 'Добыча пьезокварца',
        'parent_id' => 245,
    ],
    [
        'id' => 250,
        'name' => 'Добыча гранулированного кварца',
        'parent_id' => 245,
    ],
    [
        'id' => 251,
        'name' => 'Добыча слюды',
        'parent_id' => 245,
    ],
    [
        'id' => 252,
        'name' => 'Предоставление услуг в области добычи полезных ископаемых',
        'parent_id' => null,
    ],
    [
        'id' => 253,
        'name' => 'Предоставление услуг в области добычи нефти и природного газа',
        'parent_id' => 252,
    ],
    [
        'id' => 254,
        'name' => 'Предоставление услуг по бурению, связанному с добычей нефти, газа и газового конденсата',
        'parent_id' => 253,
    ],
    [
        'id' => 255,
        'name' => 'Предоставление услуг по монтажу, ремонту и демонтажу буровых вышек',
        'parent_id' => 253,
    ],
    [
        'id' => 256,
        'name' => 'Предоставление услуг по доразведке месторождений нефти и газа на особых экономических условиях (по соглашению о разделе продукции - СРП)',
        'parent_id' => 253,
    ],
    [
        'id' => 257,
        'name' => 'Сжижение и обогащение природного газа на месте добычи для последующей транспортировки',
        'parent_id' => 253,
    ],
    [
        'id' => 258,
        'name' => 'Предоставление прочих услуг в области добычи нефти и природного газа',
        'parent_id' => 253,
    ],
    [
        'id' => 259,
        'name' => 'Предоставление услуг в других областях добычи полезных ископаемых',
        'parent_id' => 252,
    ],
    [
        'id' => 260,
        'name' => 'Производство пищевых продуктов',
        'parent_id' => null,
    ],
    [
        'id' => 261,
        'name' => 'Переработка и консервирование мяса и мясной пищевой продукции',
        'parent_id' => 260,
    ],
    [
        'id' => 262,
        'name' => 'Переработка и консервирование мяса',
        'parent_id' => 261,
    ],
    [
        'id' => 263,
        'name' => 'Производство мяса в охлажденном виде',
        'parent_id' => 262,
    ],
    [
        'id' => 264,
        'name' => 'Производство пищевых субпродуктов в охлажденном виде',
        'parent_id' => 262,
    ],
    [
        'id' => 265,
        'name' => 'Производство мяса и пищевых субпродуктов в замороженном виде',
        'parent_id' => 262,
    ],
    [
        'id' => 266,
        'name' => 'Производство щипаной шерсти, сырых шкур и кож крупного рогатого скота, животных семейств лошадиных и оленевых, овец и коз',
        'parent_id' => 262,
    ],
    [
        'id' => 267,
        'name' => 'Производство животных жиров',
        'parent_id' => 262,
    ],
    [
        'id' => 268,
        'name' => 'Производство субпродуктов, непригодных для употребления в пищу',
        'parent_id' => 262,
    ],
    [
        'id' => 269,
        'name' => 'Производство и консервирование мяса птицы',
        'parent_id' => 261,
    ],
    [
        'id' => 270,
        'name' => 'Производство мяса птицы в охлажденном виде',
        'parent_id' => 269,
    ],
    [
        'id' => 271,
        'name' => 'Производство мяса птицы в замороженном виде',
        'parent_id' => 269,
    ],
    [
        'id' => 272,
        'name' => 'Производство жиров домашней птицы',
        'parent_id' => 269,
    ],
    [
        'id' => 273,
        'name' => 'Производство субпродуктов домашней птицы, пригодных для употребления в пищу',
        'parent_id' => 269,
    ],
    [
        'id' => 274,
        'name' => 'Производство пера и пуха',
        'parent_id' => 269,
    ],
    [
        'id' => 275,
        'name' => 'Производство продукции из мяса убойных животных и мяса птицы',
        'parent_id' => 261,
    ],
    [
        'id' => 276,
        'name' => 'Производство соленого, вареного, запеченого, копченого, вяленого и прочего мяса',
        'parent_id' => 275,
    ],
    [
        'id' => 277,
        'name' => 'Производство колбасных изделий',
        'parent_id' => 275,
    ],
    [
        'id' => 278,
        'name' => 'Производство мясных (мясосодержащих) консервов',
        'parent_id' => 275,
    ],
    [
        'id' => 279,
        'name' => 'Производство мясных (мясосодержащих) полуфабрикатов',
        'parent_id' => 275,
    ],
    [
        'id' => 280,
        'name' => 'Производство мясных (мясосодержащих) полуфабрикатов',
        'parent_id' => 275,
    ],
    [
        'id' => 281,
        'name' => 'Производство кулинарных мясных (мясосодержащих) изделий',
        'parent_id' => 275,
    ],
    [
        'id' => 282,
        'name' => 'Производство прочей пищевой продукции из мяса или мясных пищевых субпродуктов',
        'parent_id' => 275,
    ],
    [
        'id' => 283,
        'name' => 'Производство муки и гранул из мяса и мясных субпродуктов, непригодных для употребления в пищу',
        'parent_id' => 275,
    ],
    [
        'id' => 284,
        'name' => 'Предоставление услуг по тепловой обработке и прочим способам переработки мясных продуктов',
        'parent_id' => 275,
    ],
    [
        'id' => 285,
        'name' => 'Переработка и консервирование рыбы, ракообразных и моллюсков',
        'parent_id' => 260,
    ],
    [
        'id' => 286,
        'name' => 'Переработка и консервирование рыбы',
        'parent_id' => 285,
    ],
    [
        'id' => 287,
        'name' => 'Переработка и консервирование ракообразных и моллюсков',
        'parent_id' => 285,
    ],
    [
        'id' => 288,
        'name' => 'Производство пищевой рыбной муки или муки для корма животных',
        'parent_id' => 285,
    ],
    [
        'id' => 289,
        'name' => 'Производство муки грубого помола и растворимых компонентов из рыбы и прочих водных животных, непригодных для потребления человеком',
        'parent_id' => 285,
    ],
    [
        'id' => 290,
        'name' => 'Деятельность по обработке морских водорослей, в том числе морской капусты',
        'parent_id' => 285,
    ],
    [
        'id' => 291,
        'name' => 'Производство прочих продуктов из рыбы, ракообразных, моллюсков и прочих водных беспозвоночных, непригодных для употребления в пищу',
        'parent_id' => 285,
    ],
    [
        'id' => 292,
        'name' => 'Переработка и консервирование фруктов и овощей',
        'parent_id' => 260,
    ],
    [
        'id' => 293,
        'name' => 'Переработка и консервирование картофеля',
        'parent_id' => 292,
    ],
    [
        'id' => 294,
        'name' => 'Производство соковой продукции из фруктов и овощей',
        'parent_id' => 292,
    ],
    [
        'id' => 295,
        'name' => 'Прочие виды переработки и консервирования фруктов и овощей',
        'parent_id' => 292,
    ],
    [
        'id' => 296,
        'name' => 'Переработка и консервирование овощей (кроме картофеля) и грибов',
        'parent_id' => 295,
    ],
    [
        'id' => 297,
        'name' => 'Переработка и консервирование фруктов и орехов',
        'parent_id' => 295,
    ],
    [
        'id' => 298,
        'name' => 'Предоставление услуг по тепловой обработке и прочим способам подготовки овощей и фруктов для консервированияF',
        'parent_id' => 295,
    ],
    [
        'id' => 299,
        'name' => 'Производство растительных и животных масел и жиров',
        'parent_id' => 260,
    ],
    [
        'id' => 300,
        'name' => 'Производство масел и жиров',
        'parent_id' => 299,
    ],
    [
        'id' => 301,
        'name' => 'Производство нерафинированных животных масел и жиров, их фракций',
        'parent_id' => 300,
    ],
    [
        'id' => 302,
        'name' => 'Производство нерафинированных растительных масел и их фракций',
        'parent_id' => 300,
    ],
    [
        'id' => 303,
        'name' => 'Производство нерафинированного соевого масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 304,
        'name' => 'Производство нерафинированного арахисового масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 305,
        'name' => 'Производство нерафинированного оливкового масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 306,
        'name' => 'Производство нерафинированного подсолнечного масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 307,
        'name' => 'Производство нерафинированного хлопкового масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 308,
        'name' => 'Производство нерафинированного рапсового сурепного и горчичного масла и их фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 309,
        'name' => 'Производство нерафинированного пальмового масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 310,
        'name' => 'Производство нерафинированного кокосового масла и его фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 311,
        'name' => 'Производство прочих нерафинированных растительных масел и их фракций',
        'parent_id' => 302,
    ],
    [
        'id' => 312,
        'name' => 'Производство хлопкового линта',
        'parent_id' => 300,
    ],
    [
        'id' => 313,
        'name' => 'Производство жмыха и муки тонкого и грубого помола из семян или плодов масличных культур',
        'parent_id' => 300,
    ],
    [
        'id' => 314,
        'name' => 'Производство рафинированных растительных масел и их фракций',
        'parent_id' => 300,
    ],
    [
        'id' => 315,
        'name' => 'Производство рафинированного соевого масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 316,
        'name' => 'Производство рафинированного арахисового масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 317,
        'name' => 'Производство рафинированного оливкового масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 318,
        'name' => 'Производство рафинированного подсолнечного масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 319,
        'name' => 'Производство рафинированного хлопкового масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 320,
        'name' => 'Производство рафинированного рапсового, сурепного, горчичного масел и их фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 321,
        'name' => 'Производство рафинированного пальмового масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 322,
        'name' => 'Производство рафинированного кокосового масла и его фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 323,
        'name' => 'Производство прочих рафинированных растительных масел и их фракций',
        'parent_id' => 314,
    ],
    [
        'id' => 324,
        'name' => 'Производство гидрогенизированных и переэтерифицированных животных и растительных жиров и масел и их фракций',
        'parent_id' => 300,
    ],
    [
        'id' => 325,
        'name' => 'Производство растительных восков и дегры',
        'parent_id' => 300,
    ],
    [
        'id' => 326,
        'name' => 'Производство маргариновой продукции',
        'parent_id' => 299,
    ],
    [
        'id' => 327,
        'name' => 'Производство молочной продукции',
        'parent_id' => 260,
    ],
    [
        'id' => 328,
        'name' => 'Производство молока (кроме сырого) и молочной продукции',
        'parent_id' => 327,
    ],
    [
        'id' => 329,
        'name' => 'Производство питьевого молока и питьевых сливок',
        'parent_id' => 328,
    ],
    [
        'id' => 330,
        'name' => 'Производство сливочного масла, топленого масла, масляной пасты, молочного жира, спредов и топленых сливочно-растительных смесей',
        'parent_id' => 328,
    ],
    [
        'id' => 331,
        'name' => 'Производство сыра и сырных продуктов',
        'parent_id' => 328,
    ],
    [
        'id' => 332,
        'name' => 'Производство молока и сливок в твердой форме',
        'parent_id' => 328,
    ],
    [
        'id' => 333,
        'name' => 'Производство мороженого',
        'parent_id' => 327,
    ],
    [
        'id' => 334,
        'name' => 'Производство продуктов мукомольной и крупяной промышленности, крахмала и крахмалосодержащих продуктов',
        'parent_id' => 260,
    ],
    [
        'id' => 335,
        'name' => 'Производство продуктов мукомольной и крупяной промышленности',
        'parent_id' => 334,
    ],
    [
        'id' => 336,
        'name' => 'Производство обработанного риса',
        'parent_id' => 335,
    ],
    [
        'id' => 337,
        'name' => 'Производство муки из зерновых культур',
        'parent_id' => 335,
    ],
    [
        'id' => 338,
        'name' => 'Производство крупы и гранул из зерновых культур',
        'parent_id' => 335,
    ],
    [
        'id' => 339,
        'name' => 'Производство мучных смесей и приготовление мучных смесей или теста для хлеба, тортов, бисквитов и блинов',
        'parent_id' => 335,
    ],
    [
        'id' => 340,
        'name' => 'Производство крахмала и крахмалосодержащих продуктов',
        'parent_id' => 334,
    ],
    [
        'id' => 341,
        'name' => 'Производство крахмала',
        'parent_id' => 340,
    ],
    [
        'id' => 342,
        'name' => 'Производство нерафинированного кукурузного масла и его фракций',
        'parent_id' => 340,
    ],
    [
        'id' => 343,
        'name' => 'Производство рафинированного кукурузного масла и его фракций',
        'parent_id' => 340,
    ],
    [
        'id' => 344,
        'name' => 'Производство прочих крахмалосодержащих продуктов',
        'parent_id' => 340,
    ],
    [
        'id' => 345,
        'name' => 'Производство хлебобулочных и мучных кондитерских изделий',
        'parent_id' => 260,
    ],
    [
        'id' => 346,
        'name' => 'Производство хлеба и мучных кондитерских изделий, тортов и пирожных недлительного хранения',
        'parent_id' => 345,
    ],
    [
        'id' => 347,
        'name' => 'Производство хлеба и хлебобулочных изделий недлительного хранения',
        'parent_id' => 346,
    ],
    [
        'id' => 348,
        'name' => 'Производство мучных кондитерских изделий, тортов и пирожных недлительного хранения',
        'parent_id' => 346,
    ],
    [
        'id' => 349,
        'name' => 'Производство охлажденных хлебобулочных полуфабрикатов',
        'parent_id' => 346,
    ],
    [
        'id' => 350,
        'name' => 'Производство сухарей, печенья и прочих сухарных хлебобулочных изделий, производство мучных кондитерских изделий, тортов, пирожных, пирогов и бисквитов, предназначенных для длительного хранения',
        'parent_id' => 345,
    ],
    [
        'id' => 351,
        'name' => 'Производство хрустящих хлебцев, сухарей и прочих сухарных хлебобулочных изделий',
        'parent_id' => 350,
    ],
    [
        'id' => 352,
        'name' => 'Производство тортов и пирожных длительного хранения',
        'parent_id' => 350,
    ],
    [
        'id' => 353,
        'name' => 'Производство прочих мучных кондитерских изделий длительного хранения',
        'parent_id' => 350,
    ],
    [
        'id' => 354,
        'name' => 'Производство печенья',
        'parent_id' => 353,
    ],
    [
        'id' => 355,
        'name' => 'Производство пряников и коврижек',
        'parent_id' => 353,
    ],
    [
        'id' => 356,
        'name' => 'Производство вафель',
        'parent_id' => 353,
    ],
    [
        'id' => 357,
        'name' => 'Производство галет и крекеров',
        'parent_id' => 353,
    ],
    [
        'id' => 358,
        'name' => 'Производство кексов, рулетов и аналогичных изделий длительного хранения',
        'parent_id' => 353,
    ],
    [
        'id' => 359,
        'name' => 'Производство восточных сладостей и прочих мучных кондитерских изделий',
        'parent_id' => 353,
    ],
    [
        'id' => 360,
        'name' => 'Производство замороженных хлебобулочных полуфабрикатов',
        'parent_id' => 350,
    ],
    [
        'id' => 361,
        'name' => 'Производство макаронных изделий кускуса и аналогичных мучных изделий',
        'parent_id' => 345,
    ],
    [
        'id' => 362,
        'name' => 'Производство макаронных изделий',
        'parent_id' => 361,
    ],
    [
        'id' => 363,
        'name' => 'Производство кускуса',
        'parent_id' => 361,
    ],
    [
        'id' => 364,
        'name' => 'Производство консервированных или замороженных макаронных изделий',
        'parent_id' => 361,
    ],
    [
        'id' => 365,
        'name' => 'Производство прочих пищевых продуктов',
        'parent_id' => 260,
    ],
    [
        'id' => 366,
        'name' => 'Производство сахара',
        'parent_id' => 365,
    ],
    [
        'id' => 367,
        'name' => 'Производство сахара из сахарной свеклы и тростникового сырца',
        'parent_id' => 366,
    ],
    [
        'id' => 368,
        'name' => 'Производство сахара из сахарной свеклы',
        'parent_id' => 367,
    ],
    [
        'id' => 369,
        'name' => 'Производство сахара из тростникового сырца',
        'parent_id' => 367,
    ],
    [
        'id' => 370,
        'name' => 'Производство сахарного сиропа',
        'parent_id' => 366,
    ],
    [
        'id' => 371,
        'name' => 'Производство мелассы',
        'parent_id' => 366,
    ],
    [
        'id' => 372,
        'name' => 'Производство какао, шоколада и сахаристых кондитерских изделий',
        'parent_id' => 365,
    ],
    [
        'id' => 373,
        'name' => 'Производство какао, масла какао, жира какао, растительного масла какао, порошка какао',
        'parent_id' => 372,
    ],
    [
        'id' => 374,
        'name' => 'Производство шоколада и сахаристых кондитерских изделий',
        'parent_id' => 372,
    ],
    [
        'id' => 375,
        'name' => 'Производство кондитерских изделий из сахара',
        'parent_id' => 372,
    ],
    [
        'id' => 376,
        'name' => 'Производство жевательной резинки',
        'parent_id' => 372,
    ],
    [
        'id' => 377,
        'name' => 'Производство засахаренных фруктов, орехов, цукатов из кожуры и прочих частей растений',
        'parent_id' => 372,
    ],
    [
        'id' => 378,
        'name' => 'Производство кондитерских леденцов и пастилок',
        'parent_id' => 372,
    ],
    [
        'id' => 379,
        'name' => 'Производство чая и кофе',
        'parent_id' => 365,
    ],
    [
        'id' => 380,
        'name' => 'Производство приправ и пряностей',
        'parent_id' => 365,
    ],
    [
        'id' => 381,
        'name' => 'Производство готовых пищевых продуктов и блюд',
        'parent_id' => 365,
    ],
    [
        'id' => 382,
        'name' => 'Производство детского питания и диетических пищевых продуктов',
        'parent_id' => 365,
    ],
    [
        'id' => 383,
        'name' => 'Производство молока и молочных продуктов для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 384,
        'name' => 'Производство молока и молочных продуктов для детей раннего возраста',
        'parent_id' => 383,
    ],
    [
        'id' => 385,
        'name' => 'Производство молока и молочных продуктов для детей дошкольного и школьного возраста',
        'parent_id' => 383,
    ],
    [
        'id' => 386,
        'name' => 'Производство соковой продукции из фруктов и овощей для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 387,
        'name' => 'Производство мясной продукции для детского питания, в том числе из мяса птицы',
        'parent_id' => 382,
    ],
    [
        'id' => 388,
        'name' => 'Производство продуктов на злаковой основе для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 389,
        'name' => 'Производство продуктов детского питания профилактического и лечебного назначения',
        'parent_id' => 382,
    ],
    [
        'id' => 390,
        'name' => 'Производство специализированной пищевой продукции, в том числе диетических пищевых продуктов',
        'parent_id' => 382,
    ],
    [
        'id' => 391,
        'name' => 'Производство пищевой продукции диетического и диабетического питания',
        'parent_id' => 390,
    ],
    [
        'id' => 392,
        'name' => 'Производство пищевой продукции для питания спортсменов',
        'parent_id' => 390,
    ],
    [
        'id' => 393,
        'name' => 'Производство пищевой продукции для питания беременных и кормящих женщин',
        'parent_id' => 390,
    ],
    [
        'id' => 394,
        'name' => 'Производство пищевой продукции энтерального питания',
        'parent_id' => 390,
    ],
    [
        'id' => 395,
        'name' => 'Производство прочих диетических пищевых продуктов',
        'parent_id' => 390,
    ],
    [
        'id' => 396,
        'name' => 'Производство воды питьевой, напитков безалкогольных для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 397,
        'name' => 'Производство рыбной продукции для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 398,
        'name' => 'Производство хлебобулочных и кондитерских изделий для детского питания',
        'parent_id' => 382,
    ],
    [
        'id' => 399,
        'name' => 'Производство прочих пищевых продуктов, не включенных в другие группировки',
        'parent_id' => 365,
    ],
    [
        'id' => 400,
        'name' => 'Производство супов и бульонов',
        'parent_id' => 399,
    ],
    [
        'id' => 401,
        'name' => 'Производство скоропортящихся продуктов, таких как: сэндвичи и свежая пицца (полуфабрикат)',
        'parent_id' => 399,
    ],
    [
        'id' => 402,
        'name' => 'Производство растительных соков и экстрактов, пептических веществ, растительных клеев и загустителей',
        'parent_id' => 399,
    ],
    [
        'id' => 403,
        'name' => 'Производство пищевых ферментов',
        'parent_id' => 399,
    ],
    [
        'id' => 404,
        'name' => 'Производство искусственного меда и карамели',
        'parent_id' => 399,
    ],
    [
        'id' => 405,
        'name' => 'Переработка меда (темперирование, фильтрация, декристаллизация и смешивание меда)',
        'parent_id' => 399,
    ],
    [
        'id' => 406,
        'name' => 'Производство рационов питания и пайков',
        'parent_id' => 399,
    ],
    [
        'id' => 407,
        'name' => 'Производство биологически активных добавок к пище',
        'parent_id' => 399,
    ],
    [
        'id' => 408,
        'name' => 'Производство прочих продуктов питания, не включенных в другие группировки',
        'parent_id' => 399,
    ],
    [
        'id' => 409,
        'name' => 'Производство готовых кормов для животных',
        'parent_id' => 260,
    ],
    [
        'id' => 410,
        'name' => 'Производство готовых кормов для животных, содержащихся на фермах',
        'parent_id' => 409,
    ],
    [
        'id' => 411,
        'name' => 'Производство готовых кормов (смешанных и несмешанных), кроме муки и гранул из люцерны, для животных, содержащихся на фермах',
        'parent_id' => 410,
    ],
    [
        'id' => 412,
        'name' => 'Производство муки грубого помола и гранул из люцерны',
        'parent_id' => 410,
    ],
    [
        'id' => 413,
        'name' => 'Производство кормового микробиологического белка, премиксов, кормовых витаминов, антибиотиков, аминокислот и ферментов',
        'parent_id' => 410,
    ],
    [
        'id' => 414,
        'name' => 'Производство готовых кормов для непродуктивных животных',
        'parent_id' => 409,
    ],
    [
        'id' => 415,
        'name' => 'Производство напитков',
        'parent_id' => null,
    ],
    [
        'id' => 416,
        'name' => 'Перегонка, очистка и смешивание спиртов',
        'parent_id' => 415,
    ],
    [
        'id' => 417,
        'name' => 'Производство дистиллированных питьевых алкогольных напитков: водки, виски, бренди, джина, ликеров и т.п.',
        'parent_id' => 416,
    ],
    [
        'id' => 418,
        'name' => 'Производство напитков, смешанных с дистиллированными алкогольными напитками',
        'parent_id' => 416,
    ],
    [
        'id' => 419,
        'name' => 'Смешивание дистиллированных спиртов',
        'parent_id' => 416,
    ],
    [
        'id' => 420,
        'name' => 'Производство пищевого спирта',
        'parent_id' => 416,
    ],
    [
        'id' => 421,
        'name' => 'Производство вина из винограда',
        'parent_id' => 415,
    ],
    [
        'id' => 422,
        'name' => 'Производство сидра и прочих плодовых вин',
        'parent_id' => 415,
    ],
    [
        'id' => 423,
        'name' => 'Производство прочих недистиллированных напитков из сброженных материалов',
        'parent_id' => 415,
    ],
    [
        'id' => 424,
        'name' => 'Производство пива',
        'parent_id' => 415,
    ],
    [
        'id' => 425,
        'name' => 'Производство солода',
        'parent_id' => 415,
    ],
    [
        'id' => 426,
        'name' => 'Производство безалкогольных напитков; производство упакованных питьевых вод, включая минеральные воды',
        'parent_id' => 415,
    ],
    [
        'id' => 427,
        'name' => 'Производство упакованных питьевых вод, включая минеральные воды',
        'parent_id' => 426,
    ],
    [
        'id' => 428,
        'name' => 'Производство упакованных природных минеральных вод',
        'parent_id' => 427,
    ],
    [
        'id' => 429,
        'name' => 'Производство упакованных природных питьевых вод',
        'parent_id' => 427,
    ],
    [
        'id' => 430,
        'name' => 'Производство упакованных обработанных питьевых вод',
        'parent_id' => 427,
    ],
    [
        'id' => 431,
        'name' => 'Производство упакованных купажированных питьевых вод',
        'parent_id' => 427,
    ],
    [
        'id' => 432,
        'name' => 'Производство упакованных искусственно минерализованных питьевых вод',
        'parent_id' => 427,
    ],
    [
        'id' => 433,
        'name' => 'Производство безалкогольных напитков ароматизированных и/или с добавлением сахара, кроме минеральных вод',
        'parent_id' => 426,
    ],
    [
        'id' => 434,
        'name' => 'Производство табачных изделий',
        'parent_id' => null,
    ],
    [
        'id' => 435,
        'name' => 'Производство изделий из табака и махорки: сигарет, папирос, сигар, сигарилл, курительного тонкорезаного табака, трубочного табака, жевательного табака, сосательного табака, нюхательного табака, табака для кальяна, курительной и нюхательной махорки',
        'parent_id' => 434,
    ],
    [
        'id' => 436,
        'name' => 'Производство гомогенизированного или восстановленного табака',
        'parent_id' => 434,
    ],
    [
        'id' => 437,
        'name' => 'Стрипсование (удаление главной жилки) и редраинг-обработка табака',
        'parent_id' => 434,
    ],
    [
        'id' => 438,
        'name' => 'Производство текстильных изделий',
        'parent_id' => null,
    ],
    [
        'id' => 439,
        'name' => 'Подготовка и прядение текстильных волокон',
        'parent_id' => 438,
    ],
    [
        'id' => 440,
        'name' => 'Прядение хлопчатобумажных волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 441,
        'name' => 'Прядение ардное шерстяных волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 442,
        'name' => 'Прядение гребенное шерстяных волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 443,
        'name' => 'Прядение льняных волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 444,
        'name' => 'Изготовление натуральных шелковых, искусственных и синтетических волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 445,
        'name' => 'Прядение швейных ниток',
        'parent_id' => 439,
    ],
    [
        'id' => 446,
        'name' => 'Подготовка и прядение прочих текстильных волокон',
        'parent_id' => 439,
    ],
    [
        'id' => 447,
        'name' => 'Производство текстильных тканей',
        'parent_id' => 438,
    ],
    [
        'id' => 448,
        'name' => 'Производство тканей (без специальных тканей) из натуральных волокон, кроме хлопка',
        'parent_id' => 447,
    ],
    [
        'id' => 449,
        'name' => 'Производство шелковых тканей',
        'parent_id' => 448,
    ],
    [
        'id' => 450,
        'name' => 'Производство шерстяных тканей',
        'parent_id' => 448,
    ],
    [
        'id' => 451,
        'name' => 'Производство льняных тканей',
        'parent_id' => 448,
    ],
    [
        'id' => 452,
        'name' => 'Производство тканей из джутовых и прочих лубяных текстильных волокон',
        'parent_id' => 448,
    ],
    [
        'id' => 453,
        'name' => 'Производство ткани из прочих растительных текстильных волокон; ткани из бумажной пряжи',
        'parent_id' => 448,
    ],
    [
        'id' => 454,
        'name' => 'Производство хлопчатобумажных тканей',
        'parent_id' => 447,
    ],
    [
        'id' => 455,
        'name' => 'Производство тканей, за исключением специальных тканей, из химических комплексных нитей и штапельных волокон',
        'parent_id' => 447,
    ],
    [
        'id' => 456,
        'name' => 'Производство ворсовых, махровых полотенечных тканей и прочих специальных тканей',
        'parent_id' => 447,
    ],
    [
        'id' => 457,
        'name' => 'Производство ворсовых тканей и ткани из синели',
        'parent_id' => 456,
    ],
    [
        'id' => 458,
        'name' => 'Производство хлопчатобумажных махровых полотенечных тканей',
        'parent_id' => 456,
    ],
    [
        'id' => 459,
        'name' => 'Производство прочих махровых полотенечных и аналогичных махровых тканей',
        'parent_id' => 456,
    ],
    [
        'id' => 460,
        'name' => 'Производство марли',
        'parent_id' => 456,
    ],
    [
        'id' => 461,
        'name' => 'Производство ворсовых тканей',
        'parent_id' => 456,
    ],
    [
        'id' => 462,
        'name' => 'Производство тканей из стекловолокна',
        'parent_id' => 456,
    ],
    [
        'id' => 463,
        'name' => 'Производство искусственного меха ткацким способом',
        'parent_id' => 447,
    ],
    [
        'id' => 464,
        'name' => 'Производство арамидных нитей и волокна',
        'parent_id' => 447,
    ],
    [
        'id' => 465,
        'name' => 'Отделка тканей и текстильных изделий',
        'parent_id' => 438,
    ],
    [
        'id' => 466,
        'name' => 'Отбеливание и окрашивание текстиля, волокон, тканей и текстильных изделий, включая готовую одежду',
        'parent_id' => 465,
    ],
    [
        'id' => 467,
        'name' => 'Аппретирование, сушка, обработка паром, декатировка, противоусадочная отделка, смягчение тканей и текстильных изделий, включая готовую одежду',
        'parent_id' => 465,
    ],
    [
        'id' => 468,
        'name' => 'Плиссировка и подобные работы на текстильных материалах',
        'parent_id' => 465,
    ],
    [
        'id' => 469,
        'name' => 'Нанесение водозащитного слоя, специальных покрытий, прорезинивание, пропитка приобретенной одежды',
        'parent_id' => 465,
    ],
    [
        'id' => 470,
        'name' => 'Нанесение рисунка на текстильные изделия и готовую одежду',
        'parent_id' => 465,
    ],
    [
        'id' => 471,
        'name' => 'Производство прочих текстильных изделий',
        'parent_id' => 438,
    ],
    [
        'id' => 472,
        'name' => 'Производство трикотажного и вязаного полотна',
        'parent_id' => 471,
    ],
    [
        'id' => 473,
        'name' => 'Производство трикотажного и вязаного полотна',
        'parent_id' => 472,
    ],
    [
        'id' => 474,
        'name' => 'Производство и обработка трикотажного или вязаного полотна',
        'parent_id' => 473,
    ],
    [
        'id' => 475,
        'name' => 'Производство искусственного меха методом вязания',
        'parent_id' => 473,
    ],
    [
        'id' => 476,
        'name' => 'Производство готовых текстильных изделий, кроме одежды',
        'parent_id' => 472,
    ],
    [
        'id' => 477,
        'name' => 'Пошив готовых текстильных изделий по индивидуальному заказу населения, кроме одежды',
        'parent_id' => 472,
    ],
    [
        'id' => 478,
        'name' => 'Производство ковров и ковровых изделий',
        'parent_id' => 472,
    ],
    [
        'id' => 479,
        'name' => 'Производство канатов, веревок, шпагата и сетей',
        'parent_id' => 472,
    ],
    [
        'id' => 480,
        'name' => 'Производство шпагата, канатов, веревок и тросов из текстильных волокон и лент, с пропиткой и без пропитки, с покрытием, защищенных или не защищенных оболочкой из резины или пластмассы',
        'parent_id' => 479,
    ],
    [
        'id' => 481,
        'name' => 'Производство изделий из веревки и сетного полотна: рыболовных сетей, предохранительных сеток на судах, защитных средств, используемых при погрузочно-разгрузочных работах, стропов, веревок или тросов с металлическими кольцами',
        'parent_id' => 479,
    ],
    [
        'id' => 482,
        'name' => 'Производство нетканых текстильных материалов и изделий из них, кроме одежды',
        'parent_id' => 472,
    ],
    [
        'id' => 483,
        'name' => 'Производство прочих технических и промышленных текстильных изделий',
        'parent_id' => 472,
    ],
    [
        'id' => 484,
        'name' => 'Производство металлизированной пряжи или металлизированной позументной тесьмы',
        'parent_id' => 483,
    ],
    [
        'id' => 485,
        'name' => 'Производство ткани из металлической нити и ткани из металлизированной пряжи',
        'parent_id' => 483,
    ],
    [
        'id' => 486,
        'name' => 'Производство резиновых нитей и шнуров с текстильным покрытием; производство текстильных нитей и лент, пропитанных или с пластмассовым или резиновым покрытием',
        'parent_id' => 483,
    ],
    [
        'id' => 487,
        'name' => 'Производство текстильных материалов, пропитанных или с покрытием',
        'parent_id' => 483,
    ],
    [
        'id' => 488,
        'name' => 'Производство кордных тканей',
        'parent_id' => 483,
    ],
    [
        'id' => 489,
        'name' => 'Производство текстильных материалов и изделий технического назначения (включая фитили, калильные сетки газовых фонарей, текстильные шланги, конвейерные ленты и приводные ремни, ситовые ткани и фильтровальные ткани)',
        'parent_id' => 483,
    ],
    [
        'id' => 490,
        'name' => 'Производство узких текстильных тканей, в том числе состоящих из основы безуточного переплетения и соединяемых клеящим веществом',
        'parent_id' => 483,
    ],
    [
        'id' => 491,
        'name' => 'Производство прочих текстильных изделий, не включенных в другие группировки',
        'parent_id' => 472,
    ],
    [
        'id' => 492,
        'name' => 'Производство кружевного сетчатого и гардинно-тюлевого полотна, а также кружев и вышитых изделий, в кусках, в форме полос или отдельных вышивок',
        'parent_id' => 491,
    ],
    [
        'id' => 493,
        'name' => 'Производство фетра и войлока',
        'parent_id' => 491,
    ],
    [
        'id' => 494,
        'name' => 'Производство ваты из текстильных материалов',
        'parent_id' => 491,
    ],
    [
        'id' => 495,
        'name' => 'Изготовление прочих текстильных изделий по индивидуальному заказу населения, не включенных в другие группировки',
        'parent_id' => 491,
    ],
    [
        'id' => 496,
        'name' => 'Производство текстильных изделий различного назначения, не включенных в другие группировки',
        'parent_id' => 491,
    ],
    [
        'id' => 497,
        'name' => 'Производство одежды',
        'parent_id' => null,
    ],
    [
        'id' => 498,
        'name' => 'Производство одежды, кроме одежды из меха',
        'parent_id' => 497,
    ],
    [
        'id' => 499,
        'name' => 'Производство одежды из кожи',
        'parent_id' => 498,
    ],
    [
        'id' => 500,
        'name' => 'Производство одежды из кожи, кроме изготовленных по индивидуальному заказу',
        'parent_id' => 499,
    ],
    [
        'id' => 501,
        'name' => 'Пошив одежды из кожи по индивидуальному заказу населения',
        'parent_id' => 499,
    ],
    [
        'id' => 502,
        'name' => 'Производство спецодежды',
        'parent_id' => 498,
    ],
    [
        'id' => 503,
        'name' => 'Производство спецодежды, кроме изготовленных по индивидуальному заказу',
        'parent_id' => 502,
    ],
    [
        'id' => 504,
        'name' => 'Пошив производственной одежды по индивидуальному заказу населения',
        'parent_id' => 502,
    ],
    [
        'id' => 505,
        'name' => 'Производство прочей верхней одежды',
        'parent_id' => 498,
    ],
    [
        'id' => 506,
        'name' => 'Производство верхней трикотажной или вязаной одежды',
        'parent_id' => 505,
    ],
    [
        'id' => 507,
        'name' => 'Производство верхней трикотажной или вязаной одежды для мужчин или мальчиков',
        'parent_id' => 506,
    ],
    [
        'id' => 508,
        'name' => 'Производство верхней трикотажной или вязаной одежды для женщин или девочек',
        'parent_id' => 506,
    ],
    [
        'id' => 509,
        'name' => 'Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных',
        'parent_id' => 505,
    ],
    [
        'id' => 510,
        'name' => 'Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных, для мужчин или мальчиков',
        'parent_id' => 509,
    ],
    [
        'id' => 511,
        'name' => 'Производство верхней одежды из текстильных материалов, кроме трикотажных или вязаных, для женщин или девочек',
        'parent_id' => 509,
    ],
    [
        'id' => 512,
        'name' => 'Пошив и вязание прочей верхней одежды по индивидуальному заказу населения',
        'parent_id' => 505,
    ],
    [
        'id' => 513,
        'name' => 'Производство нательного белья',
        'parent_id' => 498,
    ],
    [
        'id' => 514,
        'name' => 'Производство трикотажного и вязаного нательного белья',
        'parent_id' => 513,
    ],
    [
        'id' => 515,
        'name' => 'Производство трикотажных или вязаных рубашек для мужчин или для мальчиков',
        'parent_id' => 514,
    ],
    [
        'id' => 516,
        'name' => 'Производство маек и прочего трикотажного или вязаного нательного белья для мужчин или мальчиков',
        'parent_id' => 514,
    ],
    [
        'id' => 517,
        'name' => 'Производство трикотажных или вязаных блузок, рубашек и батников для женщин или для девочек',
        'parent_id' => 514,
    ],
    [
        'id' => 518,
        'name' => 'Производство маек и прочего трикотажного или вязаного нательного белья для женщин или для девочек',
        'parent_id' => 514,
    ],
    [
        'id' => 519,
        'name' => 'Производство нательного белья из тканей',
        'parent_id' => 513,
    ],
    [
        'id' => 520,
        'name' => 'Производство рубашек из текстильных материалов, кроме трикотажных или вязаных, для мужчин или для мальчиков',
        'parent_id' => 519,
    ],
    [
        'id' => 521,
        'name' => 'Производство маек и прочего нательного белья из текстильных материалов, кроме трикотажных или вязаных, для мужчин или для мальчиков',
        'parent_id' => 519,
    ],
    [
        'id' => 522,
        'name' => 'Производство блузок, рубашек и батников из текстильных материалов, кроме трикотажных или вязаных, для женщин или для девочек',
        'parent_id' => 519,
    ],
    [
        'id' => 523,
        'name' => 'Производство маек и прочего нательного белья из текстильных материалов, кроме трикотажных или вязаных, для женщин или для девочек',
        'parent_id' => 519,
    ],
    [
        'id' => 524,
        'name' => 'Производство бюстгальтеров, поясов, корсетов и аналогичных изделий, и их частей из любого текстильного материала, включая трикотажные или вязаные',
        'parent_id' => 519,
    ],
    [
        'id' => 525,
        'name' => 'Производство трикотажных или вязаных футболок, маек и прочих нижних рубашек',
        'parent_id' => 513,
    ],
    [
        'id' => 526,
        'name' => 'Пошив нательного белья по индивидуальному заказу населения',
        'parent_id' => 513,
    ],
    [
        'id' => 527,
        'name' => 'Производство прочей одежды и аксессуаров одежды',
        'parent_id' => 498,
    ],
    [
        'id' => 528,
        'name' => 'Производство трикотажной или вязаной одежды для детей младшего возраста, спортивной или прочей одежды, аксессуаров и деталей одежды',
        'parent_id' => 527,
    ],
    [
        'id' => 529,
        'name' => 'Производство трикотажных или вязаных одежды и аксессуаров одежды для детей младшего возраста',
        'parent_id' => 528,
    ],
    [
        'id' => 530,
        'name' => 'Производство спортивных костюмов, лыжных костюмов, купальных костюмов и прочей трикотажной или вязаной одежды',
        'parent_id' => 528,
    ],
    [
        'id' => 531,
        'name' => 'Производство трикотажных или вязаных перчаток, рукавиц (варежек) и митенок',
        'parent_id' => 528,
    ],
    [
        'id' => 532,
        'name' => 'Производство прочих трикотажных или вязаных аксессуаров одежды, в том числе платков, шарфов, галстуков и прочих аналогичных изделий',
        'parent_id' => 528,
    ],
    [
        'id' => 533,
        'name' => 'Производство одежды для детей младшего возраста, спортивной или прочей одежды и аксессуаров одежды из текстильных материалов, кроме трикотажных или вязаных',
        'parent_id' => 527,
    ],
    [
        'id' => 534,
        'name' => 'Производство одежды и аксессуаров одежды для детей младшего возраста из текстильных материалов, кроме трикотажных или вязаных',
        'parent_id' => 533,
    ],
    [
        'id' => 535,
        'name' => 'Производство спортивных костюмов, лыжных костюмов, купальных костюмов и прочей одежды из текстильных материалов, кроме трикотажных или вязаных',
        'parent_id' => 533,
    ],
    [
        'id' => 536,
        'name' => 'Производство аксессуаров одежды, в том числе платков, шарфов, галстуков, перчаток и прочих аналогичных изделий из текстильных материалов, кроме трикотажных или вязаных',
        'parent_id' => 533,
    ],
    [
        'id' => 537,
        'name' => 'Производство аксессуаров одежды из натуральной или композиционной кожи',
        'parent_id' => 527,
    ],
    [
        'id' => 538,
        'name' => 'Производство одежды из фетра, нетканых материалов, из текстильных материалов с пропиткой или покрытием',
        'parent_id' => 527,
    ],
    [
        'id' => 539,
        'name' => 'Производство головных уборов',
        'parent_id' => 533,
    ],
    [
        'id' => 540,
        'name' => 'Пошив и вязание прочей одежды и аксессуаров одежды, головных уборов по индивидуальному заказу населения',
        'parent_id' => 533,
    ],
    [
        'id' => 541,
        'name' => 'Производство меховых изделий',
        'parent_id' => 497,
    ],
    [
        'id' => 542,
        'name' => 'Производство меховых изделий, кроме изготовленных по индивидуальному заказу',
        'parent_id' => 541,
    ],
    [
        'id' => 543,
        'name' => 'Пошив меховых изделий по индивидуальному заказу населения',
        'parent_id' => 541,
    ],
    [
        'id' => 544,
        'name' => 'Производство вязаных и трикотажных изделий одежды',
        'parent_id' => 497,
    ],
    [
        'id' => 545,
        'name' => 'Производство вязаных и трикотажных чулочно-носочных изделий',
        'parent_id' => 544,
    ],
    [
        'id' => 546,
        'name' => 'Производство вязаных и трикотажных чулочно-носочных изделий, кроме изготовленных по индивидуальному заказу',
        'parent_id' => 545,
    ],
    [
        'id' => 547,
        'name' => 'Изготовление вязаных и трикотажных чулочно-носочных изделий по индивидуальному заказу населения',
        'parent_id' => 545,
    ],
    [
        'id' => 548,
        'name' => 'Производство прочих вязаных и трикотажных изделий',
        'parent_id' => 544,
    ],
    [
        'id' => 549,
        'name' => 'Производство прочих вязаных и трикотажных изделий, не включенных в другие группировки',
        'parent_id' => 548,
    ],
    [
        'id' => 550,
        'name' => 'Изготовление прочих вязаных и трикотажных изделий не включенных в другие группировки по индивидуальному заказу населения',
        'parent_id' => 548,
    ],
    [
        'id' => 511,
        'name' => 'Производство кожи и изделий из кожи',
        'parent_id' => null,
    ],
    [
        'id' => 512,
        'name' => 'Дубление и отделка кожи, производство чемоданов, сумок, шорно-седельных изделий из кожи; выделка и крашение меха',
        'parent_id' => 511,
    ],
    [
        'id' => 513,
        'name' => 'Дубление и выделка кожи, выделка и крашение меха',
        'parent_id' => 512,
    ],
    [
        'id' => 514,
        'name' => 'Выделка и крашение меха',
        'parent_id' => 513,
    ],
    [
        'id' => 515,
        'name' => 'Производство замши, пергаментной кожи, лакированной и металлизированной кожи',
        'parent_id' => 513,
    ],
    [
        'id' => 516,
        'name' => 'Дубление, выделка и крашение кожи из шкур крупного рогатого скота или животных семейства лошадиных',
        'parent_id' => 513,
    ],
    [
        'id' => 517,
        'name' => 'Дубление, выделка и крашение кожи из шкур овец, коз и свиней',
        'parent_id' => 513,
    ],
    [
        'id' => 518,
        'name' => 'Дубление, выделка и крашение кожи из шкур прочих животных, производство композиционной кожи',
        'parent_id' => 513,
    ],
    [
        'id' => 519,
        'name' => 'Дубление, выделка и крашение кожи из шкур прочих животных',
        'parent_id' => 518,
    ],
    [
        'id' => 520,
        'name' => 'Производство композиционной кожи',
        'parent_id' => 518,
    ],
    [
        'id' => 521,
        'name' => 'Производство чемоданов, дамских сумок и аналогичных изделий из кожи и других материалов; производство шорно-седельных и других изделий из кожи',
        'parent_id' => 512,
    ],
    [
        'id' => 522,
        'name' => 'Производство обуви',
        'parent_id' => 511,
    ],
    [
        'id' => 523,
        'name' => 'Производство обуви, кроме спортивной, защитной и ортопедической',
        'parent_id' => 522,
    ],
    [
        'id' => 524,
        'name' => 'Производство водонепроницаемой обуви с верхом из резины или пластмассы',
        'parent_id' => 523,
    ],
    [
        'id' => 525,
        'name' => 'Производство обуви с верхом из резины и пластмассы, кроме водопроницаемой',
        'parent_id' => 523,
    ],
    [
        'id' => 526,
        'name' => 'Производство обуви с верхом из кожи, кроме спортивной обуви, обуви с защитным металлическим подноском и различной специальной обуви',
        'parent_id' => 523,
    ],
    [
        'id' => 527,
        'name' => 'Производство обуви с верхом из текстильных материалов, кроме спортивной обуви',
        'parent_id' => 523,
    ],
    [
        'id' => 528,
        'name' => 'Производство спортивной обуви',
        'parent_id' => 522,
    ],
    [
        'id' => 529,
        'name' => 'Производство защитной обуви',
        'parent_id' => 522,
    ],
    [
        'id' => 530,
        'name' => 'Производство обуви с защитным металлическим подноском',
        'parent_id' => 529,
    ],
    [
        'id' => 531,
        'name' => 'Производство обуви с защитным металлическим подноском',
        'parent_id' => 529,
    ],
    [
        'id' => 532,
        'name' => 'Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий; производство гетр, гамашей и аналогичных изделий',
        'parent_id' => 522,
    ],
    [
        'id' => 533,
        'name' => 'Производство деталей обуви из кожи; вкладных стелек, подпяточников и аналогичных изделий',
        'parent_id' => 532,
    ],
    [
        'id' => 534,
        'name' => 'Производство гетр, гамашей и аналогичных изделий',
        'parent_id' => 532,
    ],
    [
        'id' => 535,
        'name' => 'Пошив обуви и различных дополнений к обуви по индивидуальному заказу населения',
        'parent_id' => 522,
    ],
    [
        'id' => 536,
        'name' => 'Обработка древесины и производство изделий из дерева и пробки, кроме мебели, производство изделий из соломки и материалов для плетения',
        'parent_id' => null,
    ],
    [
        'id' => 537,
        'name' => 'Распиловка и строгание древесины',
        'parent_id' => 536,
    ],
    [
        'id' => 538,
        'name' => 'Производство пиломатериалов, кроме профилированных, толщиной более 6 мм; производство непропитанных железнодорожных и трамвайных шпал из древесины',
        'parent_id' => 537,
    ],
    [
        'id' => 539,
        'name' => 'Производство пиломатериалов, профилированных по кромке; производство древесного полотна, древесной муки; производство технологической щепы или стружки',
        'parent_id' => 538,
    ],
    [
        'id' => 540,
        'name' => 'Производство древесины, пропитанной или обработанной защитными или другими веществами',
        'parent_id' => 538,
    ],
    [
        'id' => 541,
        'name' => 'Предоставление услуг по пропитке древесины',
        'parent_id' => 538,
    ],
    [
        'id' => 542,
        'name' => 'Производство изделий из дерева, пробки, соломки и материалов для плетения',
        'parent_id' => 536,
    ],
    [
        'id' => 543,
        'name' => 'Производство шпона, фанеры, деревянных плит и панелей',
        'parent_id' => 536,
    ],
    [
        'id' => 544,
        'name' => 'Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов, древесных плит из древесины и других одревесневших материалов',
        'parent_id' => 543,
    ],
    [
        'id' => 545,
        'name' => 'Производство фанеры, деревянных фанерованных панелей и аналогичных слоистых материалов',
        'parent_id' => 544,
    ],
    [
        'id' => 546,
        'name' => 'Производство древесно-стружечных плит из древесины или других одревесневших материалов',
        'parent_id' => 544,
    ],
    [
        'id' => 547,
        'name' => 'Производство древесно-волокнистых плит из древесины или других одревесневших материалов',
        'parent_id' => 544,
    ],
    [
        'id' => 548,
        'name' => 'Производство листов для облицовки, шпона для фанеры, производство прессованной древесины',
        'parent_id' => 543,
    ],
    [
        'id' => 549,
        'name' => 'Производство листов для облицовки, шпона для фанеры',
        'parent_id' => 548,
    ],
    [
        'id' => 550,
        'name' => 'Производство прессованной древесины',
        'parent_id' => 548,
    ],
    [
        'id' => 551,
        'name' => 'Производство сборных паркетных покрытий',
        'parent_id' => 536,
    ],
    [
        'id' => 552,
        'name' => 'Производство прочих деревянных строительных конструкций и столярных изделий',
        'parent_id' => 536,
    ],
    [
        'id' => 553,
        'name' => 'Производство деревянных строительных конструкций и столярных изделий',
        'parent_id' => 552,
    ],
    [
        'id' => 554,
        'name' => 'Производство сборных деревянных строений',
        'parent_id' => 552,
    ],
    [
        'id' => 555,
        'name' => 'Производство деревянной тары',
        'parent_id' => 536,
    ],
    [
        'id' => 556,
        'name' => 'Производство прочих деревянных изделий; производство изделий из пробки, соломки и материалов для плетения',
        'parent_id' => 536,
    ],
    [
        'id' => 557,
        'name' => 'Производство прочих деревянных изделий',
        'parent_id' => 536,
    ],
    [
        'id' => 558,
        'name' => 'Производство деревянных инструментов, корпусов и рукояток инструментов, рукояток щеток и метелок, обувных колодок и растяжек для обуви',
        'parent_id' => 557,
    ],
    [
        'id' => 559,
        'name' => 'Производство деревянных столовых и кухонных принадлежностей',
        'parent_id' => 557,
    ],
    [
        'id' => 560,
        'name' => 'Производство деревянных статуэток и украшений из дерева, мозаики и инкрустированного дерева, шкатулок, футляров для ювелирных изделий или ножей',
        'parent_id' => 557,
    ],
    [
        'id' => 561,
        'name' => 'Производство деревянных рам для картин, фотографий, зеркал или аналогичных предметов и прочих изделий из дерева',
        'parent_id' => 557,
    ],
    [
        'id' => 562,
        'name' => 'Производство топливных гранул и брикетов из отходов деревопереработки',
        'parent_id' => 557,
    ],
    [
        'id' => 563,
        'name' => 'Производство изделий из пробки, соломки и материалов для плетения; производство корзиночных и плетеных изделий',
        'parent_id' => 536,
    ],
    [
        'id' => 564,
        'name' => 'Производство изделий из пробки',
        'parent_id' => 563,
    ],
    [
        'id' => 565,
        'name' => 'Производство изделий из соломки, эспарто (альфы) и прочих материалов для плетения',
        'parent_id' => 563,
    ],
    [
        'id' => 566,
        'name' => 'Производство корзиночных и плетеных изделий',
        'parent_id' => 563,
    ],
    [
        'id' => 567,
        'name' => 'Изготовление изделий из дерева, пробки, соломки и материалов для плетения, корзиночных и плетеных изделий по индивидуальному заказу населения',
        'parent_id' => 536,
    ],
    [
        'id' => 568,
        'name' => 'Производство бумаги и бумажных изделий',
        'parent_id' => null,
    ],
    [
        'id' => 569,
        'name' => 'Производство целлюлозы, древесной массы, бумаги и картона',
        'parent_id' => 568,
    ],
    [
        'id' => 570,
        'name' => 'Производство целлюлозы и древесной массы',
        'parent_id' => 569,
    ],
    [
        'id' => 571,
        'name' => 'Производство целлюлозы',
        'parent_id' => 570,
    ],
    [
        'id' => 572,
        'name' => 'Производство древесной массы',
        'parent_id' => 570,
    ],
    [
        'id' => 573,
        'name' => 'Производство прочих волокнистых полуфабрикатов',
        'parent_id' => 570,
    ],
    [
        'id' => 574,
        'name' => 'Производство бумаги и картона',
        'parent_id' => 569,
    ],
    [
        'id' => 575,
        'name' => 'Производство бумаги',
        'parent_id' => 574,
    ],
    [
        'id' => 576,
        'name' => 'Производство картона',
        'parent_id' => 574,
    ],
    [
        'id' => 577,
        'name' => 'Производство изделий из бумаги и картона',
        'parent_id' => 568,
    ],
    [
        'id' => 578,
        'name' => 'Производство гофрированной бумаги и картона, бумажной и картонной тары',
        'parent_id' => 577,
    ],
    [
        'id' => 579,
        'name' => 'Производство бумажных изделий хозяйственно-бытового и санитарно-гигиенического назначения',
        'parent_id' => 577,
    ],
    [
        'id' => 580,
        'name' => 'Производство бумажных канцелярских принадлежностей',
        'parent_id' => 577,
    ],
    [
        'id' => 581,
        'name' => 'Производство обоев',
        'parent_id' => 577,
    ],
    [
        'id' => 582,
        'name' => 'Производство прочих изделий из бумаги и картона',
        'parent_id' => 577,
    ],
    [
        'id' => 583,
        'name' => 'Деятельность полиграфическая и копирование носителей информации',
        'parent_id' => null,
    ],
    [
        'id' => 584,
        'name' => 'Деятельность полиграфическая и предоставление услуг в этой области',
        'parent_id' => 583,
    ],
    [
        'id' => 585,
        'name' => 'Печатание газет',
        'parent_id' => 584,
    ],
    [
        'id' => 586,
        'name' => 'Прочие виды полиграфической деятельности',
        'parent_id' => 584,
    ],
    [
        'id' => 587,
        'name' => 'Изготовление печатных форм и подготовительная деятельность',
        'parent_id' => 584,
    ],
    [
        'id' => 588,
        'name' => 'Деятельность брошюровочно- переплетная и отделочная и сопутствующие услуги',
        'parent_id' => 584,
    ],
    [
        'id' => 589,
        'name' => 'Копирование записанных носителей информации',
        'parent_id' => 583,
    ],
    [
        'id' => 590,
        'name' => 'Производство кокса и нефтепродуктов',
        'parent_id' => null,
    ],
    [
        'id' => 591,
        'name' => 'Производство кокса',
        'parent_id' => 590,
    ],
    [
        'id' => 592,
        'name' => 'Производство нефтепродуктов',
        'parent_id' => 590,
    ],
    [
        'id' => 593,
        'name' => 'Производство жидкого топлива',
        'parent_id' => 592,
    ],
    [
        'id' => 594,
        'name' => 'Разделение и извлечение фракций из нефтяного (попутного) газа',
        'parent_id' => 592,
    ],
    [
        'id' => 595,
        'name' => 'Производство прочих нефтепродуктов',
        'parent_id' => 592,
    ],
    [
        'id' => 596,
        'name' => 'Агломерация угля, антрацита и бурого угля (лигнита) и производство термоуглей',
        'parent_id' => 590,
    ],
    [
        'id' => 597,
        'name' => 'Агломерация антрацита',
        'parent_id' => 596,
    ],
    [
        'id' => 598,
        'name' => 'Агломерация угля',
        'parent_id' => 596,
    ],
    [
        'id' => 599,
        'name' => 'Агломерация бурого угля (лигнита)',
        'parent_id' => 596,
    ],
    [
        'id' => 600,
        'name' => 'Производство термоуглей',
        'parent_id' => 596,
    ],
    [
        'id' => 601,
        'name' => 'Производство термоуглей из антрацита',
        'parent_id' => 600,
    ],
    [
        'id' => 602,
        'name' => 'Производство термоуглей из бурого угля (лигнита)',
        'parent_id' => 600,
    ],
    [
        'id' => 603,
        'name' => 'Производство термоуглей из угля за исключением антрацитов, лигнитов и угля каменного коксующегося',
        'parent_id' => 600,
    ],
    [
        'id' => 604,
        'name' => 'Производство химических веществ и химических продуктов',
        'parent_id' => null,
    ],
    [
        'id' => 605,
        'name' => 'Производство основных химических веществ, удобрений и азотных соединений, пластмасс и синтетического каучука в первичных формах',
        'parent_id' => 604,
    ],
    [
        'id' => 606,
        'name' => 'Производство промышленных газов',
        'parent_id' => 605,
    ],
    [
        'id' => 607,
        'name' => 'Производство красителей и пигментов',
        'parent_id' => 605,
    ],
    [
        'id' => 608,
        'name' => 'Производство прочих основных неорганических химических веществ',
        'parent_id' => 605,
    ],
    [
        'id' => 609,
        'name' => 'Производство прочих основных органических химических веществ',
        'parent_id' => 605,
    ],
    [
        'id' => 610,
        'name' => 'Производство углеводородов и их производных',
        'parent_id' => 609,
    ],
    [
        'id' => 611,
        'name' => 'Производство спиртов, фенолов, фенолоспиртов и их галогенированных, сульфированных, нитрованных или нитрозированных производных; производство жирных промышленных спиртов',
        'parent_id' => 609,
    ],
    [
        'id' => 612,
        'name' => 'Производство промышленных монокарбоновых жирных кислот, карбоновых кислот и их производных',
        'parent_id' => 609,
    ],
    [
        'id' => 613,
        'name' => 'Производство органических соединений с азотсодержащими функциональными группами',
        'parent_id' => 609,
    ],
    [
        'id' => 614,
        'name' => 'Производство сераорганических соединений и прочих элементоорганических соединений',
        'parent_id' => 609,
    ],
    [
        'id' => 615,
        'name' => 'Производство простых эфиров, органических пероксидов, эпоксидов, ацеталей и полуацеталей, прочих органических соединений',
        'parent_id' => 609,
    ],
    [
        'id' => 616,
        'name' => 'Производство прочих химических органических основных веществ',
        'parent_id' => 609,
    ],
    [
        'id' => 617,
        'name' => 'Производство удобрений и азотных соединений',
        'parent_id' => 605,
    ],
    [
        'id' => 618,
        'name' => 'Производство азотных кислот, сульфоазотных кислот, аммиака',
        'parent_id' => 617,
    ],
    [
        'id' => 619,
        'name' => 'Производство хлорида аммония, нитритов',
        'parent_id' => 617,
    ],
    [
        'id' => 620,
        'name' => 'Производство азотных минеральных или химических удобрений',
        'parent_id' => 617,
    ],
    [
        'id' => 621,
        'name' => 'Производство фосфорных минеральных или химических удобрений',
        'parent_id' => 617,
    ],
    [
        'id' => 622,
        'name' => 'Производство калийных минеральных или химических удобрений',
        'parent_id' => 617,
    ],
    [
        'id' => 623,
        'name' => 'Производство нитрата натрия',
        'parent_id' => 617,
    ],
    [
        'id' => 624,
        'name' => 'Производство удобрений, не включенных в другие группировки',
        'parent_id' => 617,
    ],
    [
        'id' => 625,
        'name' => 'Производство удобрений животного или растительного происхождения',
        'parent_id' => 617,
    ],
    [
        'id' => 626,
        'name' => 'Производство пластмасс и синтетических смол в первичных формах',
        'parent_id' => 605,
    ],
    [
        'id' => 627,
        'name' => 'Производство синтетического каучука в первичных формах',
        'parent_id' => 605,
    ],
    [
        'id' => 628,
        'name' => 'Производство пестицидов и прочих агрохимических продуктов',
        'parent_id' => 604,
    ],
    [
        'id' => 629,
        'name' => 'Производство красок, лаков и аналогичных материалов для нанесения покрытий, полиграфических красок и мастик',
        'parent_id' => 604,
    ],
    [
        'id' => 630,
        'name' => 'Производство красок и лаков на основе полимеров',
        'parent_id' => 629,
    ],
    [
        'id' => 631,
        'name' => 'Производство прочих красок, лаков, эмалей и аналогичных материалов для нанесения покрытий, художественных и полиграфических красок',
        'parent_id' => 629,
    ],
    [
        'id' => 632,
        'name' => 'Производство мыла и моющих, чистящих и полирующих средств; парфюмерных и косметических средств',
        'parent_id' => 604,
    ],
    [
        'id' => 633,
        'name' => 'Производство мыла и моющих, чистящих и полирующих средств',
        'parent_id' => 632,
    ],
    [
        'id' => 634,
        'name' => 'Производство глицерина',
        'parent_id' => 633,
    ],
    [
        'id' => 635,
        'name' => 'Производство органических поверхностно-активных веществ, кроме мыла',
        'parent_id' => 633,
    ],
    [
        'id' => 636,
        'name' => 'Производство мыла и моющих средств, чистящих и полирующих средств',
        'parent_id' => 633,
    ],
    [
        'id' => 637,
        'name' => 'Производство средств для ароматизации и дезодорирования воздуха и восков',
        'parent_id' => 633,
    ],
    [
        'id' => 638,
        'name' => 'Производство парфюмерных и косметических средств',
        'parent_id' => 632,
    ],
    [
        'id' => 639,
        'name' => 'Производство прочих химических продуктов',
        'parent_id' => 604,
    ],
    [
        'id' => 640,
        'name' => 'Производство взрывчатых веществ',
        'parent_id' => 639,
    ],
    [
        'id' => 641,
        'name' => 'Производство клеев',
        'parent_id' => 639,
    ],
    [
        'id' => 642,
        'name' => 'Производство эфирных масел',
        'parent_id' => 639,
    ],
    [
        'id' => 643,
        'name' => 'Производство прочих химических продуктов, не включенных в другие группировки',
        'parent_id' => 639,
    ],
    [
        'id' => 644,
        'name' => 'Производство фотопластинок и фотопленок; фотопленок для моментальных фотоснимков; химических составов и несмешанных продуктов, используемых в фотографии',
        'parent_id' => 643,
    ],
    [
        'id' => 645,
        'name' => 'Производство химически модифицированных животных или растительных жиров и масел (включая олифу), непищевых смесей животных или растительных жиров и масел',
        'parent_id' => 643,
    ],
    [
        'id' => 646,
        'name' => 'Производство чернил для письма и рисования',
        'parent_id' => 643,
    ],
    [
        'id' => 647,
        'name' => 'Производство смазочных материалов, присадок к смазочным материалам и антифризов',
        'parent_id' => 643,
    ],
    [
        'id' => 648,
        'name' => 'Производство прочих химических продуктов, не включенных в другие группировки',
        'parent_id' => 643,
    ],
    [
        'id' => 649,
        'name' => 'Производство желатина и его производных',
        'parent_id' => 643,
    ],
    [
        'id' => 650,
        'name' => 'Производство химических волокон',
        'parent_id' => 604,
    ],
    [
        'id' => 651,
        'name' => 'Производство синтетических волокон',
        'parent_id' => 650,
    ],
    [
        'id' => 652,
        'name' => 'Производство искусственных волокон',
        'parent_id' => 650,
    ],
    [
        'id' => 653,
        'name' => 'Производство лекарственных средств и материалов, применяемых в медицинских целях',
        'parent_id' => null,
    ],
    [
        'id' => 654,
        'name' => 'Производство фармацевтических субстанций',
        'parent_id' => 653,
    ],
    [
        'id' => 655,
        'name' => 'Производство лекарственных препаратов и материалов, применяемых в медицинских целях',
        'parent_id' => 653,
    ],
    [
        'id' => 656,
        'name' => 'Производство лекарственных препаратов',
        'parent_id' => 655,
    ],
    [
        'id' => 657,
        'name' => 'Производство материалов, применяемых в медицинских целях',
        'parent_id' => null,
    ],
    [
        'id' => 658,
        'name' => 'Производство фармацевтических субстанций',
        'parent_id' => 657,
    ],
    [
        'id' => 659,
        'name' => 'Производство лекарственных препаратов и материалов, применяемых в медицинских целях',
        'parent_id' => 657,
    ],
    [
        'id' => 660,
        'name' => 'Производство лекарственных препаратов',
        'parent_id' => 659,
    ],
    [
        'id' => 661,
        'name' => 'Производство материалов, применяемых в медицинских целях',
        'parent_id' => 659,
    ],
    [
        'id' => 662,
        'name' => 'Производство резиновых и пластмассовых изделий',
        'parent_id' => null,
    ],
    [
        'id' => 663,
        'name' => 'Производство резиновых изделий',
        'parent_id' => 662,
    ],
    [
        'id' => 664,
        'name' => 'Производство резиновых шин, покрышек и камер; восстановление резиновых шин и покрышек',
        'parent_id' => 663,
    ],
    [
        'id' => 665,
        'name' => 'Производство прочих резиновых изделий',
        'parent_id' => 663,
    ],
    [
        'id' => 666,
        'name' => 'Производство регенерированной резины в первичной форме или в виде пластин, листов или полос (лент)',
        'parent_id' => 665,
    ],
    [
        'id' => 667,
        'name' => 'Производство резиновых смесей и изделий из них; производство вулканизированной резины в виде нити, корда, пластин, листов, полос, прутков и профилей',
        'parent_id' => 665,
    ],
    [
        'id' => 668,
        'name' => 'Производство труб, трубок, рукавов и шлангов из вулканизированной резины, листов, полос, прутков и профилей',
        'parent_id' => 665,
    ],
    [
        'id' => 669,
        'name' => 'Производство конвейерных лент и приводных ремней, бельтинга из вулканизированной резины',
        'parent_id' => 665,
    ],
    [
        'id' => 670,
        'name' => 'Производство прорезиненных текстильных материалов, кроме кордных тканей',
        'parent_id' => 665,
    ],
    [
        'id' => 671,
        'name' => 'Производство предметов одежды и ее аксессуаров из вулканизированной резины',
        'parent_id' => 665,
    ],
    [
        'id' => 672,
        'name' => 'Производство изделий из вулканизированной резины, не включенных в другие группировки',
        'parent_id' => 665,
    ],
    [
        'id' => 673,
        'name' => 'Производство изделий из пластмасс',
        'parent_id' => 662,
    ],
    [
        'id' => 674,
        'name' => 'Производство пластмассовых плит, полос, труб и профилей',
        'parent_id' => 673,
    ],
    [
        'id' => 675,
        'name' => 'Производство пластмассовых изделий для упаковывания товаров',
        'parent_id' => 673,
    ],
    [
        'id' => 676,
        'name' => 'Производство пластмассовых изделий, используемых в строительстве',
        'parent_id' => 673,
    ],
    [
        'id' => 677,
        'name' => 'Производство прочих пластмассовых изделий',
        'parent_id' => 673,
    ],
    [
        'id' => 678,
        'name' => 'Производство предметов одежды и аксессуаров для нее, включая перчатки, из пластмасс',
        'parent_id' => 677,
    ],
    [
        'id' => 679,
        'name' => 'Производство прочих изделий из пластмасс, не включенных в другие группировки, кроме устройств пломбировочных их пластика',
        'parent_id' => 677,
    ],
    [
        'id' => 680,
        'name' => 'Производство устройств пломбировочных из пластика',
        'parent_id' => 677,
    ],
    [
        'id' => 681,
        'name' => 'Предоставление услуг в области производства прочих пластмассовых изделий',
        'parent_id' => 677,
    ],
    [
        'id' => 682,
        'name' => 'Производство прочей неметаллической минеральной продукции',
        'parent_id' => null,
    ],
    [
        'id' => 683,
        'name' => 'Производство стекла и изделий из стекла',
        'parent_id' => 682,
    ],
    [
        'id' => 684,
        'name' => 'Производство листового стекла',
        'parent_id' => 683,
    ],
    [
        'id' => 685,
        'name' => 'Производство листового тянутого стекла',
        'parent_id' => 684,
    ],
    [
        'id' => 686,
        'name' => 'Производство листового узорчатого, прокатного (но не обработанного другим способом): неармированного стекла',
        'parent_id' => 684,
    ],
    [
        'id' => 687,
        'name' => 'Производство листового узорчатого, прокатного (но не обработанного другим способом): армированного стекла',
        'parent_id' => 684,
    ],
    [
        'id' => 688,
        'name' => 'Производство бесцветного листового стекла, изготовленного методом флоат',
        'parent_id' => 684,
    ],
    [
        'id' => 689,
        'name' => 'Производство листового матового стекла',
        'parent_id' => 684,
    ],
    [
        'id' => 690,
        'name' => 'Производство полированного стекла в листах (кроме изготовленного методом флоат)',
        'parent_id' => 684,
    ],
    [
        'id' => 691,
        'name' => 'Производство листового стекла с покрытием (кроме лакокрасочного в т.ч. эмалевого)',
        'parent_id' => 684,
    ],
    [
        'id' => 692,
        'name' => 'Производство листового стекла, прочего',
        'parent_id' => 684,
    ],
    [
        'id' => 693,
        'name' => 'Формирование и обработка листового стекла',
        'parent_id' => 683,
    ],
    [
        'id' => 694,
        'name' => 'Производство упрочненного (в том числе термически упрочненного и закаленного) стекла',
        'parent_id' => 693,
    ],
    [
        'id' => 695,
        'name' => 'Производство стеклянных зеркал',
        'parent_id' => 693,
    ],
    [
        'id' => 696,
        'name' => 'Производство многослойного стекла для строительства',
        'parent_id' => 693,
    ],
    [
        'id' => 697,
        'name' => 'Производство безопасного многослойного стекла для транспорта (в том числе наземного)',
        'parent_id' => 693,
    ],
    [
        'id' => 698,
        'name' => 'Производство стеклопакетов',
        'parent_id' => 693,
    ],
    [
        'id' => 699,
        'name' => 'Производство полых стеклянных изделий',
        'parent_id' => 683,
    ],
    [
        'id' => 700,
        'name' => 'Производство бутылок и прочих емкостей из стекла или хрусталя',
        'parent_id' => 699,
    ],
    [
        'id' => 701,
        'name' => 'Производство стаканов и прочих сосудов для питья из стекла или хрусталя',
        'parent_id' => 699,
    ],
    [
        'id' => 702,
        'name' => 'Производство столовой и кухонной посуды из стекла или хрусталя',
        'parent_id' => 699,
    ],
    [
        'id' => 703,
        'name' => 'Производство туалетных и канцелярских принадлежностей из стекла или хрусталя',
        'parent_id' => 699,
    ],
    [
        'id' => 704,
        'name' => 'Производство украшений для интерьера и аналогичных изделий из стекла или хрусталя',
        'parent_id' => 699,
    ],
    [
        'id' => 705,
        'name' => 'Производство стеклянных колб для вакуумных сосудов',
        'parent_id' => 699,
    ],
    [
        'id' => 706,
        'name' => 'Производство стекловолокна',
        'parent_id' => 683,
    ],
    [
        'id' => 707,
        'name' => 'Производство и обработка прочих стеклянных изделий, включая технические изделия из стекла',
        'parent_id' => 683,
    ],
    [
        'id' => 708,
        'name' => 'Производство необработанного стекла в блоках, в виде шаров, прутков, труб или трубок',
        'parent_id' => 707,
    ],
    [
        'id' => 709,
        'name' => 'Производство блоков для мощения, стеклоблоков, плит и прочих изделий из прессованного или отформованного стекла, используемых в строительстве; производство стекла для витражей; производство многоячеистого стекла или пеностекла в блоках, плитах и аналогичных формах',
        'parent_id' => 707,
    ],
    [
        'id' => 710,
        'name' => 'Производство стеклянных колб для электрических ламп, электронно-лучевых приборов или аналогичных изделий',
        'parent_id' => 707,
    ],
    [
        'id' => 711,
        'name' => 'Производство стекол для часов или очков, не подвергнутых оптической обработке',
        'parent_id' => 707,
    ],
    [
        'id' => 712,
        'name' => 'Производство посуды для лабораторных, фармацевтических и гигиенических целей из стекла; производство ампул и прочих изделий из медицинского стекла',
        'parent_id' => 707,
    ],
    [
        'id' => 713,
        'name' => 'Производство стеклянных деталей электрических ламп и осветительной арматуры, световых указателей, световых табло и аналогичных изделий',
        'parent_id' => 707,
    ],
    [
        'id' => 714,
        'name' => 'Производство электрических изоляторов из стекла',
        'parent_id' => 707,
    ],
    [
        'id' => 715,
        'name' => 'Производство прочих изделий из стекла, не включенных в другие группировки',
        'parent_id' => 707,
    ],
    [
        'id' => 716,
        'name' => 'Производство огнеупорных изделий',
        'parent_id' => 682,
    ],
    [
        'id' => 717,
        'name' => 'Производство огнеупорных кирпичей, блоков, плиток',
        'parent_id' => 716,
    ],
    [
        'id' => 718,
        'name' => 'Производство огнеупорных цементов, растворов, бетонов и аналогичных составов',
        'parent_id' => 716,
    ],
    [
        'id' => 719,
        'name' => 'Производство безобжиговых огнеупорных изделий',
        'parent_id' => 716,
    ],
    [
        'id' => 720,
        'name' => 'Производство прочих огнеупорных керамических изделий',
        'parent_id' => 716,
    ],
    [
        'id' => 721,
        'name' => 'Производство строительных керамических материалов',
        'parent_id' => 682,
    ],
    [
        'id' => 722,
        'name' => 'Производство керамических плит и плиток',
        'parent_id' => 721,
    ],
    [
        'id' => 723,
        'name' => 'Производство кирпича, черепицы и прочих строительных изделий из обожженной глины',
        'parent_id' => 721,
    ],
    [
        'id' => 724,
        'name' => 'Производство прочих фарфоровых и керамических изделий',
        'parent_id' => 682,
    ],
    [
        'id' => 725,
        'name' => 'Производство хозяйственных и декоративных керамических изделий',
        'parent_id' => 724,
    ],
    [
        'id' => 726,
        'name' => 'Производство столовой и кухонной керамической посуды',
        'parent_id' => 725,
    ],
    [
        'id' => 726,
        'name' => 'Производство прочих хозяйственных и туалетных керамических принадлежностей',
        'parent_id' => 725,
    ],
    [
        'id' => 727,
        'name' => 'Производство статуэток и прочих декоративных керамических изделий',
        'parent_id' => 725,
    ],
    [
        'id' => 728,
        'name' => 'Производство керамических санитарно-технических изделий',
        'parent_id' => 724,
    ],
    [
        'id' => 729,
        'name' => 'Производство керамических изоляторов и изолирующей арматуры',
        'parent_id' => 724,
    ],
    [
        'id' => 730,
        'name' => 'Производство прочих технических керамических изделий',
        'parent_id' => 724,
    ],
    [
        'id' => 731,
        'name' => 'Производство керамических изделий лабораторного, химического и промышленного назначения',
        'parent_id' => 730,
    ],
    [
        'id' => 732,
        'name' => 'Производство керамических и ферритовых магнитов',
        'parent_id' => 730,
    ],
    [
        'id' => 733,
        'name' => 'Производство прочих керамических изделий',
        'parent_id' => 724,
    ],
    [
        'id' => 734,
        'name' => 'Производство керамических горшков, банок, кувшинов и подобных изделий, используемых для транспортирования или упаковывания товаров',
        'parent_id' => 733,
    ],
    [
        'id' => 735,
        'name' => 'Производство керамических изделий, не включенных в другие группировки',
        'parent_id' => 733,
    ],
    [
        'id' => 736,
        'name' => 'Производство цемента, извести и гипса',
        'parent_id' => 682,
    ],
    [
        'id' => 737,
        'name' => 'Производство цемента',
        'parent_id' => 736,
    ],
    [
        'id' => 738,
        'name' => 'Производство извести и гипса',
        'parent_id' => 736,
    ],
    [
        'id' => 739,
        'name' => 'Производство негашеной, гашеной и гидравлической извести',
        'parent_id' => 738,
    ],
    [
        'id' => 740,
        'name' => 'Производство гипса',
        'parent_id' => 738,
    ],
    [
        'id' => 741,
        'name' => 'Производство кальцинированного доломита',
        'parent_id' => 738,
    ],
    [
        'id' => 742,
        'name' => 'Производство изделий из бетона, цемента и гипса',
        'parent_id' => 682,
    ],
    [
        'id' => 743,
        'name' => 'Производство изделий из бетона для использования в строительстве',
        'parent_id' => 742,
    ],
    [
        'id' => 744,
        'name' => 'Производство изделий готовых строительных изделий из бетона, цемента и искусственного камня',
        'parent_id' => 743,
    ],
    [
        'id' => 745,
        'name' => 'Производство изделий сборных строительных конструкций из бетона, цемента и искусственного камня',
        'parent_id' => 743,
    ],
    [
        'id' => 746,
        'name' => 'Производство изделий гипсовых изделий для использования в строительстве',
        'parent_id' => 742,
    ],
    [
        'id' => 747,
        'name' => 'Производство товарного бетона',
        'parent_id' => 742,
    ],
    [
        'id' => 748,
        'name' => 'Производство сухих бетонных смесей',
        'parent_id' => 742,
    ],
    [
        'id' => 749,
        'name' => 'Производство изделий из хризотилцемента и волокнистого цемента',
        'parent_id' => 742,
    ],
    [
        'id' => 750,
        'name' => 'Производство строительных материалов из растительного сырья, смешанного с цементом, гипсом или прочими минеральными связующими веществами',
        'parent_id' => 749,
    ],
    [
        'id' => 751,
        'name' => 'Производство изделий из хризотилцемента и волокнистого цемента с волокнами целлюлозы или аналогичных материалов',
        'parent_id' => 749,
    ],
    [
        'id' => 752,
        'name' => 'Производство прочих изделий из гипса, бетона или цемента',
        'parent_id' => 742,
    ],
    [
        'id' => 753,
        'name' => 'Резка, обработка и отделка камня',
        'parent_id' => 682,
    ],
    [
        'id' => 754,
        'name' => 'Резка, обработка и отделка камня для использования в строительстве в качестве дорожного покрытия',
        'parent_id' => 753,
    ],
    [
        'id' => 755,
        'name' => 'Резка, обработка и отделка камня для памятников',
        'parent_id' => 753,
    ],
    [
        'id' => 756,
        'name' => 'Производство гранул и порошков из природного камня',
        'parent_id' => 753,
    ],
    [
        'id' => 757,
        'name' => 'Производство абразивных и неметаллических минеральных изделий, не включенных в другие группировки',
        'parent_id' => 682,
    ],
    [
        'id' => 758,
        'name' => 'Производство абразивных изделий',
        'parent_id' => 757,
    ],
    [
        'id' => 759,
        'name' => 'Производство прочей неметаллической минеральной продукции, не включенной в другие группировки',
        'parent_id' => 757,
    ],
    [
        'id' => 760,
        'name' => 'Производство обработанных хризотиловых волокон, смесей на основе хризотила и изделий из них',
        'parent_id' => 759,
    ],
    [
        'id' => 761,
        'name' => 'Производство изделий из асфальта или аналогичных материалов',
        'parent_id' => 759,
    ],
    [
        'id' => 762,
        'name' => 'Производство битуминозных смесей на основе природного асфальта или битума, нефтяного битума, минеральных смол или их пеков',
        'parent_id' => 759,
    ],
    [
        'id' => 763,
        'name' => 'Производство искусственного графита, коллоидного или полуколлоидного графита, продуктов на основе графита или прочих форм углерода в виде полуфабрикатов',
        'parent_id' => 759,
    ],
    [
        'id' => 764,
        'name' => 'Производство искусственного корунда',
        'parent_id' => 759,
    ],
    [
        'id' => 765,
        'name' => 'Производство минеральных тепло- и звукоизоляционных материалов и изделий',
        'parent_id' => 759,
    ],
    [
        'id' => 766,
        'name' => 'Производство минеральных теплоизоляционных материалов и изделий',
        'parent_id' => 765,
    ],
    [
        'id' => 767,
        'name' => 'Производство минеральных звукоизоляционных материалов и изделий',
        'parent_id' => 765,
    ],
    [
        'id' => 768,
        'name' => 'Производство металлургическое',
        'parent_id' => null,
    ],
    [
        'id' => 769,
        'name' => 'Производство чугуна, стали и ферросплавов',
        'parent_id' => 768,
    ],
    [
        'id' => 770,
        'name' => 'Производство основных продуктов из железа и стали',
        'parent_id' => 769,
    ],
    [
        'id' => 771,
        'name' => 'Производство чугуна',
        'parent_id' => 770,
    ],
    [
        'id' => 772,
        'name' => 'Производство ферросплавов',
        'parent_id' => 770,
    ],
    [
        'id' => 773,
        'name' => 'Производство продуктов прямого восстановления железной руды и губчатого железа',
        'parent_id' => 770,
    ],
    [
        'id' => 774,
        'name' => 'Производство гранул и порошков из чугуна или стали',
        'parent_id' => 770,
    ],
    [
        'id' => 775,
        'name' => 'Производство стали',
        'parent_id' => 769,
    ],
    [
        'id' => 776,
        'name' => 'Производство листового горячекатаного стального проката',
        'parent_id' => 769,
    ],
    [
        'id' => 777,
        'name' => 'Производство листового холоднокатаного стального проката',
        'parent_id' => 769,
    ],
    [
        'id' => 778,
        'name' => 'Производство листового холоднокатаного стального проката, плакированного, с гальваническим или иным покрытием',
        'parent_id' => 769,
    ],
    [
        'id' => 779,
        'name' => 'Производство сортового горячекатаного проката и катанки',
        'parent_id' => 769,
    ],
    [
        'id' => 780,
        'name' => 'Производство незамкнутых стальных профилей горячей обработки, листового проката в пакетах и стального рельсового профиля для железных дорог и трамвайных путей',
        'parent_id' => 769,
    ],
    [
        'id' => 781,
        'name' => 'Производство прочего проката из черных металлов, не включенного в другие группировки',
        'parent_id' => 769,
    ],
    [
        'id' => 782,
        'name' => 'Производство стальных труб, полых профилей и фитингов',
        'parent_id' => 768,
    ],
    [
        'id' => 783,
        'name' => 'Производство бесшовных труб и пустотелых профилей',
        'parent_id' => 782,
    ],
    [
        'id' => 784,
        'name' => 'Производство сварных труб',
        'parent_id' => 782,
    ],
    [
        'id' => 785,
        'name' => 'Производство стальных фитингов для труб, кроме литых',
        'parent_id' => 782,
    ],
    [
        'id' => 786,
        'name' => 'Производство прочих стальных изделий первичной обработкой',
        'parent_id' => 768,
    ],
    [
        'id' => 787,
        'name' => 'Производство стальных прутков и сплошных профилей методом холодного волочения',
        'parent_id' => 786,
    ],
    [
        'id' => 788,
        'name' => 'Производство холоднотянутого штрипса',
        'parent_id' => 786,
    ],
    [
        'id' => 789,
        'name' => 'Производство профилей с помощью холодной штамповки или гибки',
        'parent_id' => 786,
    ],
    [
        'id' => 790,
        'name' => 'Производство проволоки методом холодного волочения',
        'parent_id' => 786,
    ],
    [
        'id' => 791,
        'name' => 'Производство основных драгоценных металлов и прочих цветных металлов, производство ядерного топлива',
        'parent_id' => 768,
    ],
    [
        'id' => 792,
        'name' => 'Производство драгоценных металлов',
        'parent_id' => 791,
    ],
    [
        'id' => 793,
        'name' => 'Производство алюминия',
        'parent_id' => 791,
    ],
    [
        'id' => 794,
        'name' => 'Производство свинца, цинка и олова',
        'parent_id' => 791,
    ],
    [
        'id' => 795,
        'name' => 'Производство свинца',
        'parent_id' => 794,
    ],
    [
        'id' => 796,
        'name' => 'Производство цинка',
        'parent_id' => 794,
    ],
    [
        'id' => 797,
        'name' => 'Производство олова',
        'parent_id' => 794,
    ],
    [
        'id' => 798,
        'name' => 'Производство меди',
        'parent_id' => 791,
    ],
    [
        'id' => 799,
        'name' => 'Производство прочих цветных металлов',
        'parent_id' => 791,
    ],
    [
        'id' => 800,
        'name' => 'Производство никеля',
        'parent_id' => 799,
    ],
    [
        'id' => 801,
        'name' => 'Производство титана',
        'parent_id' => 799,
    ],
    [
        'id' => 802,
        'name' => 'Производство магния',
        'parent_id' => 799,
    ],
    [
        'id' => 803,
        'name' => 'Производство вольфрама',
        'parent_id' => 799,
    ],
    [
        'id' => 804,
        'name' => 'Производство молибдена',
        'parent_id' => 799,
    ],
    [
        'id' => 805,
        'name' => 'Производство кобальта',
        'parent_id' => 799,
    ],
    [
        'id' => 806,
        'name' => 'Производство хрома',
        'parent_id' => 799,
    ],
    [
        'id' => 807,
        'name' => 'Производство марганца',
        'parent_id' => 799,
    ],
    [
        'id' => 808,
        'name' => 'Производство редких (тантал, ниобий, галлий, германий, иридий) и редкоземельных металлов',
        'parent_id' => 799,
    ],
    [
        'id' => 810,
        'name' => 'Производство ядерного топлива',
        'parent_id' => 791,
    ],
    [
        'id' => 811,
        'name' => 'Литье металлов',
        'parent_id' => 768,
    ],
    [
        'id' => 812,
        'name' => 'Литье чугуна',
        'parent_id' => 811,
    ],
    [
        'id' => 813,
        'name' => 'Литье стали',
        'parent_id' => 811,
    ],
    [
        'id' => 814,
        'name' => 'Литье легких металлов',
        'parent_id' => 811,
    ],
    [
        'id' => 815,
        'name' => 'Литье прочих цветных металлов',
        'parent_id' => 811,
    ],
    [
        'id' => 816,
        'name' => 'Производство готовых металлических изделий, кроме машин и оборудования',
        'parent_id' => null,
    ],
    [
        'id' => 817,
        'name' => 'Производство строительных металлических конструкций и изделий',
        'parent_id' => 816,
    ],
    [
        'id' => 818,
        'name' => 'Производство строительных металлических конструкций, изделий и их частей',
        'parent_id' => 817,
    ],
    [
        'id' => 819,
        'name' => 'Производство металлических дверей и окон',
        'parent_id' => 817,
    ],
    [
        'id' => 820,
        'name' => 'Производство металлических цистерн, резервуаров и прочих емкостей',
        'parent_id' => 816,
    ],
    [
        'id' => 821,
        'name' => 'Производство радиаторов и котлов центрального отопления',
        'parent_id' => 820,
    ],
    [
        'id' => 822,
        'name' => 'Производство радиаторов',
        'parent_id' => 821,
    ],
    [
        'id' => 823,
        'name' => 'Производство котлов центрального отопления',
        'parent_id' => 821,
    ],
    [
        'id' => 824,
        'name' => 'Производство прочих металлических цистерн, резервуаров и емкостей',
        'parent_id' => 820,
    ],
    [
        'id' => 825,
        'name' => 'Производство паровых котлов, кроме котлов центрального отопления',
        'parent_id' => 816,
    ],
    [
        'id' => 826,
        'name' => 'Производство паровых котлов и их частей',
        'parent_id' => 825,
    ],
    [
        'id' => 827,
        'name' => 'Производство ядерных установок и их составных частей, в том числе для транспортных средств',
        'parent_id' => 825,
    ],
    [
        'id' => 828,
        'name' => 'Производство ядерных установок, кроме устройств для разделения изотопов',
        'parent_id' => 827,
    ],
    [
        'id' => 829,
        'name' => 'Производство частей ядерных установок, кроме устройств для разделения изотопов',
        'parent_id' => 827,
    ],
    [
        'id' => 830,
        'name' => 'Производство оружия и боеприпасов',
        'parent_id' => 816,
    ],
    [
        'id' => 831,
        'name' => 'Ковка, прессование, штамповка и профилирование, изготовление изделий методом порошковой металлургии',
        'parent_id' => 816,
    ],
    [
        'id' => 832,
        'name' => 'Предоставление услуг по ковке, прессованию, объемной и листовой штамповке и профилированию листового металла',
        'parent_id' => 831,
    ],
    [
        'id' => 833,
        'name' => 'Предоставление услуг по производству изделий методом порошковой металлургии',
        'parent_id' => 831,
    ],
    [
        'id' => 834,
        'name' => 'Обработка металлов и нанесение покрытий на металлы; механическая обработка металлов',
        'parent_id' => 816,
    ],
    [
        'id' => 835,
        'name' => 'Обработка металлов и нанесение покрытий на металлы',
        'parent_id' => 834,
    ],
    [
        'id' => 836,
        'name' => 'Обработка металлических изделий механическаяв',
        'parent_id' => 834,
    ],
    [
        'id' => 837,
        'name' => 'Производство ножевых изделий и столовых приборов, инструментов и универсальных скобяных изделий',
        'parent_id' => 816,
    ],
    [
        'id' => 838,
        'name' => 'Производство ножевых изделий и столовых приборов',
        'parent_id' => 837,
    ],
    [
        'id' => 839,
        'name' => 'Производство замков, петель',
        'parent_id' => 837,
    ],
    [
        'id' => 840,
        'name' => 'Производство инструмента',
        'parent_id' => 837,
    ],
    [
        'id' => 841,
        'name' => 'Производство прочих готовых металлических изделий',
        'parent_id' => 816,
    ],
    [
        'id' => 842,
        'name' => 'Производство металлических бочек и аналогичных емкостей',
        'parent_id' => 841,
    ],
    [
        'id' => 843,
        'name' => 'Производство тары из легких металлов',
        'parent_id' => 841,
    ],
    [
        'id' => 844,
        'name' => 'Производство изделий из проволоки, цепей и пружин',
        'parent_id' => 841,
    ],
    [
        'id' => 845,
        'name' => 'Производство изделий из проволоки и пружин',
        'parent_id' => 844,
    ],
    [
        'id' => 846,
        'name' => 'Производство цепей, кроме шарнирных, и составных частей к ним',
        'parent_id' => 844,
    ],
    [
        'id' => 847,
        'name' => 'Производство крепежных изделий',
        'parent_id' => 841,
    ],
    [
        'id' => 848,
        'name' => 'Производство прочих готовых металлических изделий, не включенных в другие группировки',
        'parent_id' => 841,
    ],
    [
        'id' => 849,
        'name' => 'Производство металлических изделий для ванных комнат и кухни',
        'parent_id' => 841,
    ],
    [
        'id' => 850,
        'name' => 'Производство раковин, моек, ванн и прочих санитарно-технических изделий и их составных частей из черных металлов, меди или алюминия',
        'parent_id' => 849,
    ],
    [
        'id' => 851,
        'name' => 'Производство столовых, кухонных и прочих бытовых изделий, кроме столовых и кухонных приборов, и их составных частей из черных металлов, меди или алюминия',
        'parent_id' => 849,
    ],
    [
        'id' => 852,
        'name' => 'Производство прочих металлических изделий',
        'parent_id' => 841,
    ],
    [
        'id' => 853,
        'name' => 'Производство бронированных или армированных сейфов, несгораемых шкафов и дверей',
        'parent_id' => 852,
    ],
    [
        'id' => 854,
        'name' => 'Производство канцелярского настольного оборудования (ящиков, картотек, лотков и т. п.) из недрагоценных металлов',
        'parent_id' => 852,
    ],
    [
        'id' => 855,
        'name' => 'Производство деталей для скоросшивателей или папок; канцелярских принадлежностей и скоб в виде полос из недрагоценных металлов',
        'parent_id' => 852,
    ],
    [
        'id' => 856,
        'name' => 'Производство статуэток, рам для фотографий, картин, зеркал и прочих декоративных изделий из недрагоценных металлов',
        'parent_id' => 852,
    ],
    [
        'id' => 857,
        'name' => 'Производство фурнитуры из недрагоценных металлов для одежды, обуви, кожгалантереи и прочих изделий, в том числе крючков, пряжек, застежек, петелек, колечек, трубчатых и раздвоенных заклепок и др.',
        'parent_id' => 852,
    ],
    [
        'id' => 858,
        'name' => 'Производство судовых гребных винтов и гребных колес',
        'parent_id' => 852,
    ],
    [
        'id' => 859,
        'name' => 'Производство металлических изделий для области использования атомной энергии',
        'parent_id' => 852,
    ],
    [
        'id' => 860,
        'name' => 'Производство прочих изделий из недрагоценных металлов, не включенных в другие группировки',
        'parent_id' => 852,
    ],
    [
        'id' => 861,
        'name' => 'Изготовление готовых металлических изделий хозяйственного назначения по индивидуальному заказу населения',
        'parent_id' => 841,
    ],
    //
    [
        'id' => 862,
        'name' => 'Производство компьютеров, электронных и оптических изделий',
        'parent_id' => null,
    ],
    [
        'id' => 863,
        'name' => 'Производство элементов электронной аппаратуры и печатных схем (плат)',
        'parent_id' => 862,
    ],
    [
        'id' => 864,
        'name' => 'Производство элементов электронной аппаратуры',
        'parent_id' => 863,
    ],
    [
        'id' => 865,
        'name' => 'Производство электронных вакуумных ламп и трубок и прочих электронных вакуумных приборов',
        'parent_id' => 864,
    ],
    [
        'id' => 866,
        'name' => 'Производство диодов, транзисторов и прочих полупроводниковых приборов, включая светоизлучающие диоды, пьезоэлектрические приборы и их части',
        'parent_id' => 864,
    ],
    [
        'id' => 867,
        'name' => 'Производство интегральных электронных схем',
        'parent_id' => 864,
    ],
    [
        'id' => 868,
        'name' => 'Производство частей электронных ламп, трубок и прочих электронных компонентов, не включенных в другие группировки',
        'parent_id' => 864,
    ],
    [
        'id' => 869,
        'name' => 'Производство электронных печатных плат',
        'parent_id' => 863,
    ],
    [
        'id' => 870,
        'name' => 'Производство компьютеров и периферийного оборудования',
        'parent_id' => 862,
    ],
    [
        'id' => 871,
        'name' => 'Производство компьютеров',
        'parent_id' => 870,
    ],
    [
        'id' => 872,
        'name' => 'Производство периферийного оборудования',
        'parent_id' => 870,
    ],
    [
        'id' => 873,
        'name' => 'Производство запоминающих устройств и прочих устройств хранения данных',
        'parent_id' => 870,
    ],
    [
        'id' => 874,
        'name' => 'Производство средств защиты информации, а также информационных и телекоммуникационных систем, защищенных с использованием средств защиты информации',
        'parent_id' => 870,
    ],
    [
        'id' => 875,
        'name' => 'Производство прочих устройств автоматической обработки данных',
        'parent_id' => 870,
    ],
    [
        'id' => 876,
        'name' => 'Производство коммуникационного оборудования',
        'parent_id' => 862,
    ],
    [
        'id' => 877,
        'name' => 'Производство коммуникационной аппаратуры, радио- и телевизионной передающей аппаратуры, телевизионных камер',
        'parent_id' => 876,
    ],
    [
        'id' => 878,
        'name' => 'Производство средств связи, выполняющих функцию систем коммутации',
        'parent_id' => 877,
    ],
    [
        'id' => 879,
        'name' => 'Производство средств связи, выполняющих функцию цифровых транспортных систем',
        'parent_id' => 877,
    ],
    [
        'id' => 880,
        'name' => 'Производство средств связи, выполняющих функцию систем управления и мониторинга',
        'parent_id' => 877,
    ],
    [
        'id' => 881,
        'name' => 'Производство оборудования, используемого для учета объема оказанных услуг связи',
        'parent_id' => 877,
    ],
    [
        'id' => 882,
        'name' => 'Производство радиоэлектронных средств связи',
        'parent_id' => 877,
    ],
    [
        'id' => 883,
        'name' => 'Производство оборудования средств связи, в том числе программное обеспечение, обеспечивающее выполнение установленных действий при проведении оперативно-розыскных мероприятий',
        'parent_id' => 877,
    ],
    [
        'id' => 884,
        'name' => 'Производство радио- и телевизионной передающей аппаратуры',
        'parent_id' => 877,
    ],
    [
        'id' => 885,
        'name' => 'Производство телевизионных камер',
        'parent_id' => 877,
    ],
    [
        'id' => 886,
        'name' => 'Производство прочего коммуникационного оборудования',
        'parent_id' => 877,
    ],
    [
        'id' => 887,
        'name' => 'Производство оконечного (пользовательского) оборудования телефонной или телеграфной связи, аппаратуры видеосвязир',
        'parent_id' => 876,
    ],
    [
        'id' => 888,
        'name' => 'Производство пользовательского (оконечного) оборудования проводной телефонной связи с проводными или беспроводными телефонными трубками',
        'parent_id' => 887,
    ],
    [
        'id' => 889,
        'name' => 'Производство телефонных аппаратов для работы в сотовых или иных беспроводных сетях связи',
        'parent_id' => 887,
    ],
    [
        'id' => 890,
        'name' => 'Производство прочих телефонных аппаратов, устройств и аппаратуры для передачи и приема речи, изображений или других данных, включая оборудование коммуникационное для работы в проводных или беспроводных сетях связи (например, локальных и глобальных сетях)',
        'parent_id' => 887,
    ],
    [
        'id' => 891,
        'name' => 'Производство запасных частей и комплектующих коммуникационного оборудования',
        'parent_id' => 876,
    ],
    [
        'id' => 892,
        'name' => 'Производство антенн, антенных отражателей всех видов и их деталей',
        'parent_id' => 876,
    ],
    [
        'id' => 893,
        'name' => 'Производство запасных частей и комплектующих радио- и телевизионной передающей аппаратуры и телевизионных камер',
        'parent_id' => 876,
    ],
    [
        'id' => 894,
        'name' => 'Производство охранно-пожарной сигнализации и аналогичных приборов',
        'parent_id' => 876,
    ],
    [
        'id' => 895,
        'name' => 'Производство бытовой электроники',
        'parent_id' => 862,
    ],
    [
        'id' => 896,
        'name' => 'Производство радиоприемников',
        'parent_id' => 895,
    ],
    [
        'id' => 897,
        'name' => 'Производство телевизионных приемников, включая видеомониторы и видеопроекторы',
        'parent_id' => 895,
    ],
    [
        'id' => 898,
        'name' => 'Производство телевизоров с электронно-лучевой трубкой',
        'parent_id' => 897,
    ],
    [
        'id' => 899,
        'name' => 'Производство телевизоров жидкокристаллических и плазменных',
        'parent_id' => 897,
    ],
    [
        'id' => 900,
        'name' => 'Производство видеомониторов и видеопроекторов',
        'parent_id' => 897,
    ],
    [
        'id' => 901,
        'name' => 'Производство аппаратуры для записи и воспроизведения звука и изображения',
        'parent_id' => 895,
    ],
    [
        'id' => 902,
        'name' => 'Производство электроакустической аппаратуры',
        'parent_id' => 895,
    ],
    [
        'id' => 903,
        'name' => 'Производство частей звукозаписывающей и звуковоспроизводящей аппаратуры и видеоаппаратуры',
        'parent_id' => 895,
    ],
    [
        'id' => 904,
        'name' => 'Производство контрольно-измерительных и навигационных приборов и аппаратов; производство часов',
        'parent_id' => 862,
    ],
    [
        'id' => 905,
        'name' => 'Производство инструментов и приборов для измерения, тестирования и навигации',
        'parent_id' => 904,
    ],
    [
        'id' => 906,
        'name' => 'Производство навигационных, метеорологических, геодезических, геофизических и аналогичного типа приборов, аппаратуры и инструментов',
        'parent_id' => 905,
    ],
    [
        'id' => 907,
        'name' => 'Производство радиолокационной, радионавигационной аппаратуры и радиоаппаратуры дистанционного управления',
        'parent_id' => 905,
    ],
    [
        'id' => 908,
        'name' => 'Производство точных весов; производство ручных инструментов для черчения, разметки и математических расчетов; производство ручных инструментов для измерения линейных размеров, не включенных в другие группировки',
        'parent_id' => 905,
    ],
    [
        'id' => 909,
        'name' => 'Производство приборов и аппаратуры для измерения электрических величин или ионизирующих излучений',
        'parent_id' => 905,
    ],
    [
        'id' => 910,
        'name' => 'Производство приборов для контроля прочих физических величин',
        'parent_id' => 905,
    ],
    [
        'id' => 911,
        'name' => 'Производство прочих приборов, датчиков, аппаратуры и инструментов для измерения, контроля и испытаний',
        'parent_id' => 905,
    ],
    [
        'id' => 912,
        'name' => 'Производство приборов и аппаратуры для автоматического регулирования или управления',
        'parent_id' => 905,
    ],
    [
        'id' => 913,
        'name' => 'Производство частей приборов и инструментов для навигации, управления, измерения, контроля, испытаний и прочих целей',
        'parent_id' => 905,
    ],
    [
        'id' => 914,
        'name' => 'Производство часов',
        'parent_id' => 904,
    ],
    [
        'id' => 915,
        'name' => 'Производство часов всех видов и прочих приборов времени',
        'parent_id' => 914,
    ],
    [
        'id' => 916,
        'name' => 'Производство часовых механизмов, деталей и составных частей часов и приборов времени',
        'parent_id' => 914,
    ],
    [
        'id' => 917,
        'name' => 'Производство облучающего и электротерапевтического оборудования, применяемого в медицинских целях',
        'parent_id' => 862,
    ],
    [
        'id' => 918,
        'name' => 'Производство аппаратов, применяемых в медицинских целях, основанных на использовании рентгеновского, альфа-, бета- и гамма-излучений',
        'parent_id' => 917,
    ],
    [
        'id' => 919,
        'name' => 'Производство гемодиализного, диатермического, наркозного оборудования, применяемого в медицинских целях',
        'parent_id' => 917,
    ],
    [
        'id' => 920,
        'name' => 'Производство оборудования для переливания крови',
        'parent_id' => 917,
    ],
    [
        'id' => 921,
        'name' => 'Производство инструмента, оборудования и приспособлений, применяемых в медицинских целях',
        'parent_id' => 917,
    ],
    [
        'id' => 922,
        'name' => 'Производство диагностического и терапевтического оборудования, применяемого в медицинских целях',
        'parent_id' => 917,
    ],
    [
        'id' => 923,
        'name' => 'Производство компьютерных томографов',
        'parent_id' => 917,
    ],
    [
        'id' => 924,
        'name' => 'Производство ультразвукового оборудования, применяемого в медицинских целях',
        'parent_id' => 917,
    ],
    [
        'id' => 925,
        'name' => 'Производство прочего оборудования, применяемого в медицинских целях',
        'parent_id' => 917,
    ],
    [
        'id' => 926,
        'name' => 'Производство оптических приборов, фото- и кинооборудования',
        'parent_id' => 862,
    ],
    [
        'id' => 927,
        'name' => 'Производство фото- и кинооборудования',
        'parent_id' => 926,
    ],
    [
        'id' => 928,
        'name' => 'Производство микроскопов (кроме электронных и протонных)',
        'parent_id' => 926,
    ],
    [
        'id' => 929,
        'name' => 'Производство оптических систем обнаружения оружия',
        'parent_id' => 926,
    ],
    [
        'id' => 930,
        'name' => 'Производство оборудования оптического позиционирования на местности',
        'parent_id' => 926,
    ],
    [
        'id' => 931,
        'name' => 'Производство линз, оптических микроскопов, биноклей и телескопов',
        'parent_id' => 926,
    ],
    [
        'id' => 932,
        'name' => 'Производство оптических прицелов и приборов определения координат целей',
        'parent_id' => 926,
    ],
    [
        'id' => 933,
        'name' => 'Производство пленочных и цифровых фото- и кинокамер',
        'parent_id' => 926,
    ],
    [
        'id' => 934,
        'name' => 'Производство незаписанных магнитных и оптических технических носителей информации',
        'parent_id' => 862,
    ],
    [
        'id' => 935,
        'name' => 'Производство электрического оборудования',
        'parent_id' => null,
    ],
    [
        'id' => 936,
        'name' => 'Производство электродвигателей, генераторов, трансформаторов и распределительных устройств, а также контрольно-измерительной аппаратуры',
        'parent_id' => 935,
    ],
    [
        'id' => 937,
        'name' => 'Производство электродвигателей, электрогенераторов и трансформаторов',
        'parent_id' => 936,
    ],
    [
        'id' => 938,
        'name' => 'Производство электродвигателей, генераторов и трансформаторов, кроме ремонта',
        'parent_id' => 937,
    ],
    [
        'id' => 939,
        'name' => 'Производство электродвигателя',
        'parent_id' => 938,
    ],
    [
        'id' => 940,
        'name' => 'Производство генераторов',
        'parent_id' => 938,
    ],
    [
        'id' => 941,
        'name' => 'Производство трансформаторов',
        'parent_id' => 938,
    ],
    [
        'id' => 942,
        'name' => 'Производство электрической распределительной и регулирующей аппаратуры',
        'parent_id' => 937,
    ],
    [
        'id' => 943,
        'name' => 'Производство электрических аккумуляторов и аккумуляторных батарей',
        'parent_id' => 935,
    ],
    [
        'id' => 944,
        'name' => 'Производство первичных элементов, батарей первичных элементов и их частей',
        'parent_id' => 943,
    ],
    [
        'id' => 945,
        'name' => 'Производство аккумуляторов, в том числе для автомобилей, аккумуляторных батарей и их составных частей',
        'parent_id' => 943,
    ],
    [
        'id' => 946,
        'name' => 'Производство аккумуляторов для автомобилей',
        'parent_id' => 945,
    ],
    [
        'id' => 947,
        'name' => 'Производство аккумуляторных батарей и их частей',
        'parent_id' => 945,
    ],
    [
        'id' => 948,
        'name' => 'Производство прочих аккумуляторов',
        'parent_id' => 945,
    ],
    [
        'id' => 949,
        'name' => 'Производство солнечных батарей для наземного энергообеспечения и их составных частей',
        'parent_id' => 943,
    ],
    [
        'id' => 950,
        'name' => 'Производство кабелей и кабельной арматуры',
        'parent_id' => 935,
    ],
    [
        'id' => 951,
        'name' => 'Производство волоконно-оптических кабелей',
        'parent_id' => 950,
    ],
    [
        'id' => 952,
        'name' => 'Производство прочих проводов и кабелей для электронного и электрического оборудования',
        'parent_id' => 950,
    ],
    [
        'id' => 953,
        'name' => 'Производство кабелей для телефонной связи',
        'parent_id' => 952,
    ],
    [
        'id' => 954,
        'name' => 'Производство силовых кабелей',
        'parent_id' => 952,
    ],
    [
        'id' => 955,
        'name' => 'Производство обмоточных эмалированных кабелей',
        'parent_id' => 952,
    ],
    [
        'id' => 956,
        'name' => 'Производство электроустановочных изделий',
        'parent_id' => 950,
    ],
    [
        'id' => 957,
        'name' => 'Производство электрических ламп и осветительного оборудования',
        'parent_id' => 935,
    ],
    [
        'id' => 958,
        'name' => 'Производство бытовых приборов',
        'parent_id' => 935,
    ],
    [
        'id' => 959,
        'name' => 'Производство бытовых электрических приборов',
        'parent_id' => 958,
    ],
    [
        'id' => 960,
        'name' => 'Производство стиральных машин',
        'parent_id' => 959,
    ],
    [
        'id' => 961,
        'name' => 'Производство холодильников и морозильников',
        'parent_id' => 959,
    ],
    [
        'id' => 962,
        'name' => 'Производство пылесосов',
        'parent_id' => 959,
    ],
    [
        'id' => 963,
        'name' => 'Производство посудомоечных машин',
        'parent_id' => 959,
    ],
    [
        'id' => 964,
        'name' => 'Производство электропечей',
        'parent_id' => 959,
    ],
    [
        'id' => 965,
        'name' => 'Производство микроволновых печей',
        'parent_id' => 959,
    ],
    [
        'id' => 966,
        'name' => 'Производство бытовых неэлектрических приборов',
        'parent_id' => 958,
    ],
    [
        'id' => 967,
        'name' => 'Производство прочего электрического оборудования',
        'parent_id' => 935,
    ],
    [
        'id' => 968,
        'name' => 'Производство ускорителей заряженных частиц',
        'parent_id' => 967,
    ],
    [
        'id' => 969,
        'name' => 'Производство радиационных аппаратов и радионуклидных энергетических устройств (РЭУ)',
        'parent_id' => 967,
    ],
    [
        'id' => 970,
        'name' => 'Производство электрического оборудования прочего, не включенного в другие группировки',
        'parent_id' => 967,
    ],
    [
        'id' => 971,
        'name' => 'Производство машин и оборудования, не включенных в другие группировки',
        'parent_id' => null,
    ],
    [
        'id' => 972,
        'name' => 'Производство машин и оборудования общего назначения',
        'parent_id' => 971,
    ],
    [
        'id' => 973,
        'name' => 'Производство двигателей и турбин, кроме авиационных, автомобильных и мотоциклетных двигателей',
        'parent_id' => 972,
    ],
    [
        'id' => 974,
        'name' => 'Производство двигателей, кроме авиационных, автомобильных и мотоциклетных',
        'parent_id' => 973,
    ],
    [
        'id' => 975,
        'name' => 'Производство турбин',
        'parent_id' => 973,
    ],
    [
        'id' => 976,
        'name' => 'Производство паровых турбин',
        'parent_id' => 975,
    ],
    [
        'id' => 977,
        'name' => 'Производство гидравлических турбин и водяных колес',
        'parent_id' => 975,
    ],
    [
        'id' => 978,
        'name' => 'Производство газовых турбин, кроме турбореактивных и турбовинтовых',
        'parent_id' => 975,
    ],
    [
        'id' => 979,
        'name' => 'Производство гидравлического и пневматического силового оборудования',
        'parent_id' => 972,
    ],
    [
        'id' => 980,
        'name' => 'Производство гидравлических и пневматических силовых установок и двигателей',
        'parent_id' => 979,
    ],
    [
        'id' => 981,
        'name' => 'Производство гидравлических насосов',
        'parent_id' => 979,
    ],
    [
        'id' => 982,
        'name' => 'Производство прочих насосов и компрессоров',
        'parent_id' => 972,
    ],
    [
        'id' => 983,
        'name' => 'Производство арматуры трубопроводной (арматуры)',
        'parent_id' => 972,
    ],
    [
        'id' => 984,
        'name' => 'Производство подшипников, зубчатых передач, элементов механических передач и приводов',
        'parent_id' => 972,
    ],
    [
        'id' => 985,
        'name' => 'Производство шариковых и роликовых подшипников',
        'parent_id' => 984,
    ],
    [
        'id' => 986,
        'name' => 'Производство корпусов подшипников и подшипников скольжения, зубчатых колес, зубчатых передач и элементов приводов',
        'parent_id' => 984,
    ],
    [
        'id' => 987,
        'name' => 'Производство прочих подшипников',
        'parent_id' => 984,
    ],
    [
        'id' => 988,
        'name' => 'Производство прочих машин и оборудования общего назначения',
        'parent_id' => 971,
    ],
    [
        'id' => 989,
        'name' => 'Производство печей, термокамер и печных горелок',
        'parent_id' => 988,
    ],
    [
        'id' => 990,
        'name' => 'Производство неэлектрических печей, горелок и устройств для них',
        'parent_id' => 989,
    ],
    [
        'id' => 991,
        'name' => 'Производство электрических печей',
        'parent_id' => 989,
    ],
    [
        'id' => 992,
        'name' => 'Производство подъемно-транспортного оборудования',
        'parent_id' => 988,
    ],
    [
        'id' => 993,
        'name' => 'Производство талей и подъемников',
        'parent_id' => 992,
    ],
    [
        'id' => 994,
        'name' => 'Производство лебедок и кабестанов',
        'parent_id' => 992,
    ],
    [
        'id' => 995,
        'name' => 'Производство домкратов и подъемных механизмов для транспортных средств',
        'parent_id' => 992,
    ],
    [
        'id' => 996,
        'name' => 'Производство подъемных кранов',
        'parent_id' => 992,
    ],
    [
        'id' => 997,
        'name' => 'Производство подъемных кранов для строительства',
        'parent_id' => 996,
    ],
    [
        'id' => 998,
        'name' => 'Производство прочих подъемных кранов',
        'parent_id' => 996,
    ],
    [
        'id' => 999,
        'name' => 'Производство автопогрузчиков и тягачей, используемых на железнодорожных платформах',
        'parent_id' => 992,
    ],
    [
        'id' => 1000,
        'name' => 'Производство лифтов, скриповых подъемников, эскалаторов и движущихся пешеходных дорожек',
        'parent_id' => 992,
    ],
    [
        'id' => 1001,
        'name' => 'Производство пневматических подъемников и конвейеров и прочего оборудования непрерывного действия для товаров или материалов',
        'parent_id' => 992,
    ],
    [
        'id' => 1002,
        'name' => 'Производство прочего грузоподъемного, транспортирующего и погрузочно-разгрузочного оборудования',
        'parent_id' => 992,
    ],
    [
        'id' => 1003,
        'name' => 'Производство офисной техники и оборудования (кроме компьютеров и периферийного оборудования)',
        'parent_id' => 988,
    ],
    [
        'id' => 1004,
        'name' => 'Производство пишущих машин, машин для обработки текста, калькуляторов, счетных машин и их частей',
        'parent_id' => 1003,
    ],
    [
        'id' => 1005,
        'name' => 'Производство фотокопировальных машин, офисных машин для офсетной печати и прочих офисных машин и оборудования и их составных частей',
        'parent_id' => 1003,
    ],
    [
        'id' => 1006,
        'name' => 'Производство ручных инструментов с механизированным приводом',
        'parent_id' => 988,
    ],
    [
        'id' => 1007,
        'name' => 'Производство промышленного холодильного и вентиляционного оборудования',
        'parent_id' => 988,
    ],
    [
        'id' => 1008,
        'name' => 'Производство теплообменных устройств, оборудования для кондиционирования воздуха промышленного холодильного и морозильного оборудования, производство оборудования для фильтрования и очистки газов',
        'parent_id' => 1007,
    ],
    [
        'id' => 1008,
        'name' => 'Производство теплообменных устройств и машин для сжижения воздуха или прочих газов',
        'parent_id' => 1007,
    ],
    [
        'id' => 1009,
        'name' => 'Производство оборудования для кондиционирования воздуха',
        'parent_id' => 1007,
    ],
    [
        'id' => 1010,
        'name' => 'Производство промышленного холодильного и морозильного оборудования',
        'parent_id' => 1007,
    ],
    [
        'id' => 1011,
        'name' => 'Производство оборудования для фильтрования и очистки газов',
        'parent_id' => 1007,
    ],
    [
        'id' => 1012,
        'name' => 'Производство вентиляторов',
        'parent_id' => 1007,
    ],
    [
        'id' => 1013,
        'name' => 'Производство прочих машин и оборудования общего назначения, не включенного в другие группировки',
        'parent_id' => 988,
    ],
    [
        'id' => 1014,
        'name' => 'Производство газогенераторов, аппаратов для дистилляции и фильтрования',
        'parent_id' => 1013,
    ],
    [
        'id' => 1015,
        'name' => 'Производство генераторов для получения генераторного или водяного газа, ацетиленовых и аналогичных газогенераторов, установок для дистилляции или очистки',
        'parent_id' => 1014,
    ],
    [
        'id' => 1015,
        'name' => 'Производство оборудования и установок для фильтрования или очистки жидкостей',
        'parent_id' => 1014,
    ],
    [
        'id' => 1015,
        'name' => 'Производство масляных, бензиновых и всасывающих воздушных фильтров для двигателей внутреннего сгорания',
        'parent_id' => 1014,
    ],
    [
        'id' => 1016,
        'name' => 'Производство оборудования для мойки, заполнения, закупоривания или упаковывания бутылок или прочих емкостей, огнетушителей, распылителей, пароструйных или пескоструйных машин, прокладок',
        'parent_id' => 1013,
    ],
    [
        'id' => 1017,
        'name' => 'Производство оборудования для мойки, заполнения, закупоривания или упаковывания бутылок или прочих емкостей',
        'parent_id' => 1016,
    ],
    [
        'id' => 1018,
        'name' => 'Производство огнетушителей, распылителей, пароструйных или пескоструйных машин',
        'parent_id' => 1016,
    ],
    [
        'id' => 1019,
        'name' => 'Производство промышленного, бытового и прочего оборудования для взвешивания и дозировки',
        'parent_id' => 1013,
    ],
    [
        'id' => 1020,
        'name' => 'Производство промышленного оборудования для взвешивания и дозировки',
        'parent_id' => 1019,
    ],
    [
        'id' => 1021,
        'name' => 'Производство бытового оборудования для взвешивания',
        'parent_id' => 1019,
    ],
    [
        'id' => 1022,
        'name' => 'Производство прочего оборудования для взвешивания и дозировки',
        'parent_id' => 1019,
    ],
    [
        'id' => 1023,
        'name' => 'Производство центрифуг, каландров и торговых автоматов',
        'parent_id' => 1013,
    ],
    [
        'id' => 1024,
        'name' => 'Производство центрифуг',
        'parent_id' => 1023,
    ],
    [
        'id' => 1025,
        'name' => 'Производство каландров или прочих валковых машин, кроме машин для обработки металлов или стекла',
        'parent_id' => 1023,
    ],
    [
        'id' => 1026,
        'name' => 'Производство торговых автоматов',
        'parent_id' => 1023,
    ],
    [
        'id' => 1027,
        'name' => 'Производство посудомоечных машин промышленного типа',
        'parent_id' => 1013,
    ],
    [
        'id' => 1028,
        'name' => 'Производство оборудования для обработки материалов с использованием процессов, включающих изменение температуры, не включенного в другие группировки',
        'parent_id' => 1013,
    ],
    [
        'id' => 1029,
        'name' => 'Производство неэлектрического оборудования и инструментов для пайки мягким и твердым припоем или сварки, машин и аппаратов для газотермического напыления',
        'parent_id' => 1013,
    ],
    [
        'id' => 1030,
        'name' => 'Производство машин и оборудования для сельского и лесного хозяйства',
        'parent_id' => 971,
    ],
    [
        'id' => 1031,
        'name' => 'Производство тракторов, управляемых рядом идущим водителем',
        'parent_id' => 1030,
    ],
    [
        'id' => 1032,
        'name' => 'Производство тракторов для сельского хозяйства',
        'parent_id' => 1030,
    ],
    [
        'id' => 1033,
        'name' => 'Производство колесных тракторов для сельского хозяйства',
        'parent_id' => 1032,
    ],
    [
        'id' => 1034,
        'name' => 'Производство гусеничных тракторов для сельского хозяйства',
        'parent_id' => 1032,
    ],
    [
        'id' => 1035,
        'name' => 'Производство машин и сельскохозяйственного оборудования для обработки почвы',
        'parent_id' => 1030,
    ],
    [
        'id' => 1036,
        'name' => 'Производство косилок для газонов, парков или спортивных площадок',
        'parent_id' => 1030,
    ],
    [
        'id' => 1037,
        'name' => 'Производство машин для уборки урожая',
        'parent_id' => 1030,
    ],
    [
        'id' => 1038,
        'name' => 'Производство зерноуборочных комбайнов',
        'parent_id' => 1037,
    ],
    [
        'id' => 1039,
        'name' => 'Производство кормозаготовительных комбайнов',
        'parent_id' => 1037,
    ],
    [
        'id' => 1040,
        'name' => 'Производство корнеуборочных или клубнеуборочных машин',
        'parent_id' => 1037,
    ],
    [
        'id' => 1041,
        'name' => 'Производство прочих машин для уборки урожая',
        'parent_id' => 1037,
    ],
    [
        'id' => 1042,
        'name' => 'Производство механических устройств для разбрасывания или распыления жидкостей или порошков, используемых в сельском хозяйстве или садоводстве',
        'parent_id' => 1030,
    ],
    [
        'id' => 1043,
        'name' => 'Производство самозагружающихся или саморазгружающихся прицепов и полуприцепов для сельского хозяйства',
        'parent_id' => 1030,
    ],
    [
        'id' => 1044,
        'name' => 'Производство прочих машин и оборудования для сельского и лесного хозяйства',
        'parent_id' => 1030,
    ],
    [
        'id' => 1045,
        'name' => 'Производство машин для очистки, сортировки или калибровки яиц, фруктов или прочих сельскохозяйственных продуктов, кроме семян, зерна или сухих бобовых культур',
        'parent_id' => 1044,
    ],
    [
        'id' => 1046,
        'name' => 'Производство доильных аппаратов',
        'parent_id' => 1044,
    ],
    [
        'id' => 1047,
        'name' => 'Производство оборудования для приготовления кормов для животных',
        'parent_id' => 1044,
    ],
    [
        'id' => 1048,
        'name' => 'Производство инкубаторов и брудеров для птицеводства',
        'parent_id' => 1044,
    ],
    [
        'id' => 1049,
        'name' => 'Производство машин и оборудования для содержания птицы',
        'parent_id' => 1044,
    ],
    [
        'id' => 1050,
        'name' => 'Производство машин и оборудования для лесного хозяйства',
        'parent_id' => 1044,
    ],
    [
        'id' => 1051,
        'name' => 'Производство прочих машин и оборудования для сельского хозяйства, садоводства, птицеводства или пчеловодства, не включенных в другие группировки',
        'parent_id' => 1044,
    ],
    [
        'id' => 1052,
        'name' => 'Производство станков, машин и оборудования для обработки металлов и прочих твердых материалов',
        'parent_id' => 971,
    ],
    [
        'id' => 1053,
        'name' => 'Производство металлообрабатывающего оборудования',
        'parent_id' => 1052,
    ],
    [
        'id' => 1054,
        'name' => 'Производство металлообрабатывающих станков',
        'parent_id' => 1053,
    ],
    [
        'id' => 1055,
        'name' => 'Производство кузнечно-прессового оборудования',
        'parent_id' => 1053,
    ],
    [
        'id' => 1056,
        'name' => 'Производство аддитивных установок, использующих в качестве сырья металл, керамику и композиты',
        'parent_id' => 1053,
    ],
    [
        'id' => 1057,
        'name' => 'Производство прочих станков',
        'parent_id' => 1052,
    ],
    [
        'id' => 1058,
        'name' => 'Производство станков для обработки камня, дерева и аналогичных твердых материалов',
        'parent_id' => 1057,
    ],
    [
        'id' => 1059,
        'name' => 'Производство станков для обработки камня, керамики, бетона или аналогичных минеральных материалов или для холодной обработки стекла',
        'parent_id' => 1058,
    ],
    [
        'id' => 1060,
        'name' => 'Производство деревообрабатывающих станков',
        'parent_id' => 1058,
    ],
    [
        'id' => 1061,
        'name' => 'Производство станков для обработки кости, твердой резины, твердых пластмасс или аналогичных твердых материалов',
        'parent_id' => 1058,
    ],
    [
        'id' => 1062,
        'name' => 'Производство оборудования для нанесения гальванического покрытия',
        'parent_id' => 1057,
    ],
    [
        'id' => 1063,
        'name' => 'Производство оправок для крепления инструмента',
        'parent_id' => 1057,
    ],
    [
        'id' => 1064,
        'name' => 'Производство делительных головок и прочих специальных приспособлений для станков',
        'parent_id' => 1057,
    ],
    [
        'id' => 1065,
        'name' => 'Производство прочих машин специального назначения',
        'parent_id' => 971,
    ],
    [
        'id' => 1066,
        'name' => 'Производство машин и оборудования для металлургии',
        'parent_id' => 1065,
    ],
    [
        'id' => 1067,
        'name' => 'Производство конвертеров, ковшей, изложниц и литейных машин',
        'parent_id' => 1066,
    ],
    [
        'id' => 1068,
        'name' => 'Производство прокатных станов',
        'parent_id' => 1066,
    ],
    [
        'id' => 1069,
        'name' => 'Производство валков для прокатных станов',
        'parent_id' => 1066,
    ],
    [
        'id' => 1070,
        'name' => 'Производство машин и оборудования для добычи полезных ископаемых и строительства',
        'parent_id' => 1065,
    ],
    [
        'id' => 1071,
        'name' => 'Производство оборудования для добычи полезных ископаемых подземным способом',
        'parent_id' => 1070,
    ],
    [
        'id' => 1072,
        'name' => 'Производство подъемников и конвейеров непрерывного действия для подземных работ',
        'parent_id' => 1071,
    ],
    [
        'id' => 1073,
        'name' => 'Производство врубовых машин и оборудования для проходки тоннелей',
        'parent_id' => 1071,
    ],
    [
        'id' => 1074,
        'name' => 'Производство прочих машин для перемещения, грейдерных работ, планирования, скреперных работ, выемки, трамбовки, уплотнения или добычи, самоходных, для грунта, минералов или руд',
        'parent_id' => 1070,
    ],
    [
        'id' => 1075,
        'name' => 'Производство бульдозеров',
        'parent_id' => 1074,
    ],
    [
        'id' => 1076,
        'name' => 'Производство самоходных грейдеров и планировщиков',
        'parent_id' => 1074,
    ],
    [
        'id' => 1077,
        'name' => 'Производство самоходных скреперов',
        'parent_id' => 1074,
    ],
    [
        'id' => 1078,
        'name' => 'Производство трамбовочных машин и дорожных самоходных катков',
        'parent_id' => 1074,
    ],
    [
        'id' => 1079,
        'name' => 'Производство самоходных фронтальных одноковшовых погрузчиков',
        'parent_id' => 1074,
    ],
    [
        'id' => 1080,
        'name' => 'Производство одноковшовых полноповоротных экскаваторов и погрузчиков',
        'parent_id' => 1074,
    ],
    [
        'id' => 1081,
        'name' => 'Производство прочих экскаваторов и самоходных ковшовых погрузчиков',
        'parent_id' => 1074,
    ],
    [
        'id' => 1082,
        'name' => 'Производство отвалов бульдозеров',
        'parent_id' => 1074,
    ],
    [
        'id' => 1083,
        'name' => 'Производство автомобилей-самосвалов, предназначенных для использования в условиях бездорожья',
        'parent_id' => 1074,
    ],
    [
        'id' => 1084,
        'name' => 'Производство прочих машин для выемки грунта',
        'parent_id' => 1070,
    ],
    [
        'id' => 1085,
        'name' => 'Производство машин для сортировки, дробления, смешивания и аналогичной обработки грунта, камня, руды и прочих минеральных веществ',
        'parent_id' => 1070,
    ],
    [
        'id' => 1086,
        'name' => 'Производство гусеничных тракторов',
        'parent_id' => 1070,
    ],
    [
        'id' => 1087,
        'name' => 'Производство машин и оборудования для производства пищевых продуктов, напитков и табачных изделий',
        'parent_id' => 1065,
    ],
    [
        'id' => 1088,
        'name' => 'Производство машин и оборудования для изготовления текстильных, швейных, меховых и кожаных изделий',
        'parent_id' => 1065,
    ],
    [
        'id' => 1089,
        'name' => 'Производство оборудования для подготовки, прядения текстильных волокон, производства тканых и трикотажных текстильных изделий',
        'parent_id' => 1088,
    ],
    [
        'id' => 1090,
        'name' => 'Производство прочего оборудования для текстильной и швейной промышленности, в том числе промышленных швейных машин',
        'parent_id' => 1088,
    ],
    [
        'id' => 1091,
        'name' => 'Производство оборудования для обработки шкур, сырых кож и выделанной кожи и для изготовления или ремонта обуви и прочих изделий',
        'parent_id' => 1088,
    ],
    [
        'id' => 1092,
        'name' => 'Производство бытовых швейных машин',
        'parent_id' => 1088,
    ],
    [
        'id' => 1093,
        'name' => 'Производство составных частей и принадлежностей машин для текстильного и швейного производства и для обработки кож',
        'parent_id' => 1088,
    ],
    [
        'id' => 1094,
        'name' => 'Производство машин и оборудования для изготовления бумаги и картона',
        'parent_id' => 1065,
    ],
    [
        'id' => 1095,
        'name' => 'Производство машин и оборудования для переработки пластмасс и резины',
        'parent_id' => 1065,
    ],
    [
        'id' => 1096,
        'name' => 'Производство аддитивных установок, использующих в качестве сырья полимеры, включая пластики',
        'parent_id' => 1095,
    ],
    [
        'id' => 1097,
        'name' => 'Производство аддитивных установок, использующих прочие виды сырья',
        'parent_id' => 1095,
    ],
    [
        'id' => 1098,
        'name' => 'Производство прочих машин и оборудования специального назначения, не включенных в другие группировки',
        'parent_id' => 1065,
    ],
    [
        'id' => 1099,
        'name' => 'Производство переплетного, наборного, включая фотонаборные машины, печатного оборудования и его составных частей',
        'parent_id' => 1098,
    ],
    [
        'id' => 1100,
        'name' => 'Производство оборудования и аппаратуры для производства полупроводниковых слитков или пластин, полупроводниковых устройств, электронных интегральных микросхем или плоскопанельных дисплеев',
        'parent_id' => 1098,
    ],
    [
        'id' => 1101,
        'name' => 'Производство пусковых устройств для воздушных судов, катапультирующих устройств для воздушных судов и т. п. оборудования',
        'parent_id' => 1098,
    ],
    [
        'id' => 1102,
        'name' => 'Производство оборудования технологического специального для объектов использования атомной энергии',
        'parent_id' => 1098,
    ],
    [
        'id' => 1103,
        'name' => 'Производство оборудования и устройств по разделению изотопов',
        'parent_id' => 1102,
    ],
    [
        'id' => 1104,
        'name' => 'Производство оборудования и устройств для транспортировки продуктов',
        'parent_id' => 1102,
    ],
    [
        'id' => 1105,
        'name' => 'Производство оборудования для автоматизированных систем управления технологическим процессом атомных электростанций',
        'parent_id' => 1102,
    ],
    [
        'id' => 1106,
        'name' => 'Производство оборудования технологического специального прочего для объектов использования атомной энергии, не включенного в другие группировки',
        'parent_id' => 1102,
    ],
    [
        'id' => 1107,
        'name' => 'Производство промышленных роботов и робототехнических устройств',
        'parent_id' => 1098,
    ],
    [
        'id' => 1108,
        'name' => 'Производство оборудования специального назначения, не включенного в другие группировки',
        'parent_id' => 1098,
    ],
    [
        'id' => 1109,
        'name' => 'Производство автотранспортных средств, прицепов и полуприцепов',
        'parent_id' => null,
    ],
    [
        'id' => 1110,
        'name' => 'Производство автотранспортных средств',
        'parent_id' => 1109,
    ],
    [
        'id' => 1111,
        'name' => 'Производство двигателей внутреннего сгорания автотранспортных средств',
        'parent_id' => 1110,
    ],
    [
        'id' => 1112,
        'name' => 'Производство двигателей внутреннего сгорания с искровым зажиганием с рабочим объемом цилиндров не более 1000 см3',
        'parent_id' => 1111,
    ],
    [
        'id' => 1113,
        'name' => 'Производство двигателей внутреннего сгорания с рабочим объемом цилиндров более 1000 см3',
        'parent_id' => 1111,
    ],
    [
        'id' => 1114,
        'name' => 'Производство двигателей внутреннего сгорания с воспламенением от сжатия',
        'parent_id' => 1111,
    ],
    [
        'id' => 1115,
        'name' => 'Производство легковых автомобилей',
        'parent_id' => 1110,
    ],
    [
        'id' => 1116,
        'name' => 'Производство автобусов и троллейбусов',
        'parent_id' => 1110,
    ],
    [
        'id' => 1117,
        'name' => 'Производство автобусов',
        'parent_id' => 1116,
    ],
    [
        'id' => 1118,
        'name' => 'Производство троллейбусов',
        'parent_id' => 1116,
    ],
    [
        'id' => 1119,
        'name' => 'Производство грузовых автомобилей',
        'parent_id' => 1110,
    ],
    [
        'id' => 1120,
        'name' => 'Производство автомобилей специального назначения',
        'parent_id' => 1110,
    ],
    [
        'id' => 1121,
        'name' => 'Производство кузовов для автотранспортных средств; производство прицепов и полуприцепов',
        'parent_id' => 1109,
    ],
    [
        'id' => 1122,
        'name' => 'Производство кузовов для легковых автомобилей',
        'parent_id' => 1121,
    ],
    [
        'id' => 1123,
        'name' => 'Производство кузовов для грузовых автомобилей',
        'parent_id' => 1121,
    ],
    [
        'id' => 1124,
        'name' => 'Производство кузовов для автобусов',
        'parent_id' => 1121,
    ],
    [
        'id' => 1125,
        'name' => 'Производство прицепов и полуприцепов',
        'parent_id' => 1121,
    ],
    [
        'id' => 1126,
        'name' => 'Производство грузовых контейнеров',
        'parent_id' => 1121,
    ],
    [
        'id' => 1127,
        'name' => 'Производство комплектующих и принадлежностей для автотранспортных средств',
        'parent_id' => 1109,
    ],
    [
        'id' => 1128,
        'name' => 'Производство электрического и электронного оборудования для автотранспортных средств',
        'parent_id' => 1127,
    ],
    [
        'id' => 1129,
        'name' => 'Производство прочих комплектующих и принадлежностей для автотранспортных средств',
        'parent_id' => 1127,
    ],
    [
        'id' => 1130,
        'name' => 'Производство сидений для автотранспортных средств',
        'parent_id' => 1129,
    ],
    [
        'id' => 1131,
        'name' => 'Производство ремней безопасности, подушек безопасности, их частей и принадлежностей кузовов',
        'parent_id' => 1129,
    ],
    [
        'id' => 1132,
        'name' => 'Производство частей и принадлежностей для автотранспортных средств, не включенных в другие группировки',
        'parent_id' => 1129,
    ],
    [
        'id' => 1133,
        'name' => 'Производство прочих транспортных средств и оборудования',
        'parent_id' => null,
    ],
    [
        'id' => 1134,
        'name' => 'Строительство кораблей, судов и лодок',
        'parent_id' => 1133,
    ],
    [
        'id' => 1135,
        'name' => 'Строительство кораблей, судов и плавучих конструкций',
        'parent_id' => 1134,
    ],
    [
        'id' => 1136,
        'name' => 'Строительство прогулочных и спортивных судов',
        'parent_id' => 1134,
    ],
    [
        'id' => 1137,
        'name' => 'Производство железнодорожных локомотивов и подвижного состава',
        'parent_id' => 1133,
    ],
    [
        'id' => 1138,
        'name' => 'Производство железнодорожных локомотивов',
        'parent_id' => 1133,
    ],
    [
        'id' => 1139,
        'name' => 'Производство магистральных электровозов',
        'parent_id' => 1139,
    ],
    [
        'id' => 1140,
        'name' => 'Производство магистральных тепловозов',
        'parent_id' => 1139,
    ],
    [
        'id' => 1141,
        'name' => 'Производство маневровых тепловозов',
        'parent_id' => 1139,
    ],
    [
        'id' => 1142,
        'name' => 'Производство моторных железнодорожных, трамвайных вагонов и вагонов метро, автодрезин, кроме транспортных средств для ремонта и технического обслуживания железнодорожных и трамвайных путей',
        'parent_id' => 1133,
    ],
    [
        'id' => 1143,
        'name' => 'Производство прочего подвижного состава',
        'parent_id' => 1133,
    ],
    [
        'id' => 1144,
        'name' => 'Производство транспортных средств для ремонта и технического обслуживания железнодорожных, трамвайных и прочих путей',
        'parent_id' => 1143,
    ],
    [
        'id' => 1145,
        'name' => 'Производство немоторных пассажирских железнодорожных, трамвайных вагонов и вагонов метро, багажных, почтовых и прочих вагонов специального назначения, кроме вагонов, предназначенных для ремонта и технического обслуживания путей',
        'parent_id' => 1143,
    ],
    [
        'id' => 1146,
        'name' => 'Производство несамоходных железнодорожных, трамвайных и прочих вагонов для перевозки грузов',
        'parent_id' => 1143,
    ],
    [
        'id' => 1147,
        'name' => 'Производство частей железнодорожных локомотивов, трамвайных и прочих моторных вагонов и подвижного состава; производство путевого оборудования и устройств для железнодорожных, трамвайных и прочих путей, механического и электромеханического оборудования для управления движением',
        'parent_id' => 1133,
    ],
    [
        'id' => 1148,
        'name' => 'Предоставление услуг по восстановлению и оснащению (завершению) железнодорожных локомотивов, трамвайных моторных вагонов и прочего подвижного состава',
        'parent_id' => 1133,
    ],
    [
        'id' => 1149,
        'name' => 'Производство летательных аппаратов, включая космические, и соответствующего оборудования',
        'parent_id' => 1133,
    ],
    [
        'id' => 1150,
        'name' => 'Производство силовых установок и двигателей для летательных аппаратов, включая космические; наземных тренажеров для летного состава; их частей',
        'parent_id' => 1149,
    ],
    [
        'id' => 1151,
        'name' => 'Производство двигателей летательных аппаратов с искровым зажиганием и их частей',
        'parent_id' => 1150,
    ],
    [
        'id' => 1152,
        'name' => 'Производство турбореактивных и турбовинтовых двигателей и их частей',
        'parent_id' => 1150,
    ],
    [
        'id' => 1153,
        'name' => 'Производство реактивных двигателей и их частей',
        'parent_id' => 1150,
    ],
    [
        'id' => 1154,
        'name' => 'Производство наземных тренажеров для летного состава и их частей',
        'parent_id' => 1150,
    ],
    [
        'id' => 1155,
        'name' => 'Производство аэростатов, дирижаблей, планеров, дельтапланов и прочих безмоторных летательных аппаратов',
        'parent_id' => 1149,
    ],
    [
        'id' => 1156,
        'name' => 'Производство вертолетов, самолетов и прочих летательных аппаратов',
        'parent_id' => 1149,
    ],
    [
        'id' => 1157,
        'name' => 'Производство вертолетов',
        'parent_id' => 1156,
    ],
    [
        'id' => 1158,
        'name' => 'Производство самолетов',
        'parent_id' => 1156,
    ],
    [
        'id' => 1159,
        'name' => 'Производство прочих летательных аппаратов',
        'parent_id' => 1156,
    ],
    [
        'id' => 1160,
        'name' => 'Производство космических аппаратов (в том числе спутников), ракет-носителей',
        'parent_id' => 1149,
    ],
    [
        'id' => 1161,
        'name' => 'Производство автоматических космических аппаратов',
        'parent_id' => 1160,
    ],
    [
        'id' => 1162,
        'name' => 'Производство пилотируемых и беспилотных космических кораблей и станций, включая орбитальные, межпланетные, многоразового использования',
        'parent_id' => 1160,
    ],
    [
        'id' => 1163,
        'name' => 'Производство ракет-носителей',
        'parent_id' => 1160,
    ],
    [
        'id' => 1164,
        'name' => 'Производство межконтинентальных баллистических ракет',
        'parent_id' => 1160,
    ],
    [
        'id' => 1165,
        'name' => 'Производство частей и принадлежностей летательных и космических аппаратов',
        'parent_id' => 1149,
    ],
    [
        'id' => 1166,
        'name' => 'Производство военных боевых машин',
        'parent_id' => 1133,
    ],
    [
        'id' => 1167,
        'name' => 'Производство транспортных средств и оборудования, не включенных в другие группировки',
        'parent_id' => 1133,
    ],
    [
        'id' => 1168,
        'name' => 'Производство мотоциклов',
        'parent_id' => 1167,
    ],
    [
        'id' => 1169,
        'name' => 'Производство велосипедов и инвалидных колясок',
        'parent_id' => 1167,
    ],
    [
        'id' => 1170,
        'name' => 'Производство велосипедов',
        'parent_id' => 1169,
    ],
    [
        'id' => 1171,
        'name' => 'Производство инвалидных колясок',
        'parent_id' => 1169,
    ],
    [
        'id' => 1172,
        'name' => 'Производство частей и принадлежности велосипедов и инвалидных колясок',
        'parent_id' => 1169,
    ],
    [
        'id' => 1173,
        'name' => 'Производство детских колясок и их частей',
        'parent_id' => 1169,
    ],
    [
        'id' => 1174,
        'name' => 'Производство прочих транспортных средств и оборудования, не включенных в другие группировки',
        'parent_id' => 1167,
    ],
    [
        'id' => 1175,
        'name' => 'Производство мебели',
        'parent_id' => null,
    ],
    [
        'id' => 1176,
        'name' => 'Производство мебели для офисов и предприятий торговли',
        'parent_id' => 1175,
    ],
    [
        'id' => 1176,
        'name' => 'Производство мебели кухонной мебели',
        'parent_id' => 1175,
    ],
    [
        'id' => 1177,
        'name' => 'Производство кухонной мебели, кроме изготовленной по индивидуальному заказу населения',
        'parent_id' => 1176,
    ],
    [
        'id' => 1178,
        'name' => 'Изготовление кухонной мебели по индивидуальному заказу населения',
        'parent_id' => 1176,
    ],
    [
        'id' => 1179,
        'name' => 'Производство матрасов',
        'parent_id' => 1175,
    ],
    [
        'id' => 1180,
        'name' => 'Производство прочей мебели',
        'parent_id' => 1179,
    ],
    [
        'id' => 1181,
        'name' => 'Производство прочей мебели, кроме изготовленной по индивидуальному заказу населения',
        'parent_id' => 1180,
    ],
    [
        'id' => 1182,
        'name' => 'Изготовление прочей мебели и отдельных мебельных деталей, не включенных в другие группировки по индивидуальному заказу населения',
        'parent_id' => 1180,
    ],
    [
        'id' => 1183,
        'name' => 'Производство прочих готовых изделий',
        'parent_id' => null,
    ],
    [
        'id' => 1184,
        'name' => 'Производство ювелирных изделий, бижутерии и подобных товаров',
        'parent_id' => 1183,
    ],
    [
        'id' => 1185,
        'name' => 'Чеканка монет',
        'parent_id' => 1184,
    ],
    [
        'id' => 1186,
        'name' => 'Производство ювелирных изделий и аналогичных изделий',
        'parent_id' => 1184,
    ],
    [
        'id' => 1187,
        'name' => 'Производство изделий технического назначения из драгоценных металлов',
        'parent_id' => 1186,
    ],
    [
        'id' => 1188,
        'name' => 'Производство изделий технического назначения из драгоценных камней',
        'parent_id' => 1186,
    ],
    [
        'id' => 1189,
        'name' => 'Обработка алмазов',
        'parent_id' => 1186,
    ],
    [
        'id' => 1190,
        'name' => 'Обработка драгоценных, полудрагоценных, поделочных и синтетических камней, кроме алмазов и янтаря; производство изделий из полудрагоценных, поделочных и синтетических камней, кроме янтаря',
        'parent_id' => 1186,
    ],
    [
        'id' => 1191,
        'name' => 'Производство ювелирных изделий, медалей из драгоценных металлов и драгоценных камней',
        'parent_id' => 1186,
    ],
    [
        'id' => 1192,
        'name' => 'Изготовление ювелирных изделий и аналогичных изделий по индивидуальному заказу населения',
        'parent_id' => 1186,
    ],
    [
        'id' => 1193,
        'name' => 'Обработка янтаря и производство изделий из янтаря',
        'parent_id' => 1186,
    ],
    [
        'id' => 1194,
        'name' => 'Производство бижутерии и подобных товаров',
        'parent_id' => 1184,
    ],
    [
        'id' => 1195,
        'name' => 'Производство бижутерии и подобных товаров, кроме изготовленных по индивидуальному заказу',
        'parent_id' => 1194,
    ],
    [
        'id' => 1196,
        'name' => 'Изготовление бижутерии и подобных товаров по индивидуальному заказу населения',
        'parent_id' => 1194,
    ],
    [
        'id' => 1197,
        'name' => 'Производство музыкальных инструментов',
        'parent_id' => 1183,
    ],
    [
        'id' => 1198,
        'name' => 'Производство спортивных товаров',
        'parent_id' => 1183,
    ],
    [
        'id' => 1199,
        'name' => 'Производство игр и игрушек',
        'parent_id' => 1183,
    ],
    [
        'id' => 1200,
        'name' => 'Производство медицинских инструментов и оборудования',
        'parent_id' => 1183,
    ],
    [
        'id' => 1201,
        'name' => 'Производство изделий, не включенных в другие группировки',
        'parent_id' => 1183,
    ],
    [
        'id' => 1202,
        'name' => 'Производство метел и щеток',
        'parent_id' => 1201,
    ],
    [
        'id' => 1203,
        'name' => 'Производство прочих готовых изделий, не включенных в другие группировки',
        'parent_id' => 1201,
    ],
    [
        'id' => 1204,
        'name' => 'Производство головных защитных уборов и прочих средств защиты',
        'parent_id' => 1203,
    ],
    [
        'id' => 1205,
        'name' => 'Производство пишущих принадлежностей',
        'parent_id' => 1203,
    ],
    [
        'id' => 1206,
        'name' => 'Производство зонтов, тростей, пуговиц, кнопок, застежек-молний',
        'parent_id' => 1203,
    ],
    [
        'id' => 1207,
        'name' => 'Производство изделий из волоса человека или животных; производство аналогичных изделий из текстильных материалов',
        'parent_id' => 1203,
    ],
    [
        'id' => 1208,
        'name' => 'Производство зажигалок и прочих курительных принадлежностей',
        'parent_id' => 1203,
    ],
    [
        'id' => 1209,
        'name' => 'Производство изделий для праздников, карнавалов или прочих изделий для увеселения',
        'parent_id' => 1203,
    ],
    [
        'id' => 1210,
        'name' => 'Производство приборов, аппаратуры и моделей, предназначенных для демонстрационных целей',
        'parent_id' => 1203,
    ],
    [
        'id' => 1211,
        'name' => 'Производство изделий народных художественных промыслов',
        'parent_id' => 1203,
    ],
    [
        'id' => 1212,
        'name' => 'Производство прочих изделий, не включенных в другие группировки',
        'parent_id' => 1203,
    ],
    [
        'id' => 1213,
        'name' => 'Ремонт и монтаж машин и оборудования',
        'parent_id' => null,
    ],
    [
        'id' => 1214,
        'name' => 'Ремонт и монтаж металлических изделий, машин и оборудования',
        'parent_id' => 1213,
    ],
    [
        'id' => 1215,
        'name' => 'Ремонт металлоизделий',
        'parent_id' => 1214,
    ],
    [
        'id' => 1216,
        'name' => 'Ремонт машин и оборудования',
        'parent_id' => 1214,
    ],
    [
        'id' => 1217,
        'name' => 'Ремонт электронного и оптического оборудования',
        'parent_id' => 1214,
    ],
    [
        'id' => 1218,
        'name' => 'Ремонт электрического оборудования',
        'parent_id' => 1214,
    ],
    [
        'id' => 1219,
        'name' => 'Ремонт и техническое обслуживание судов и лодок',
        'parent_id' => 1214,
    ],
    [
        'id' => 1220,
        'name' => 'Ремонт и техническое обслуживание летательных аппаратов, включая космические',
        'parent_id' => 1214,
    ],
    [
        'id' => 1221,
        'name' => 'Ремонт и техническое обслуживание прочих транспортных средств и оборудования',
        'parent_id' => 1214,
    ],
    [
        'id' => 1222,
        'name' => 'Ремонт прочего оборудования',
        'parent_id' => 1214,
    ],
    [
        'id' => 1223,
        'name' => 'Монтаж промышленных машин и оборудования',
        'parent_id' => 1213,
    ],
    [
        'id' => 1224,
        'name' => 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха',
        'parent_id' => null,
    ],
    [
        'id' => 1225,
        'name' => 'Производство, передача и распределение электроэнергии',
        'parent_id' => 1224,
    ],
    [
        'id' => 1226,
        'name' => 'Производство электроэнергии',
        'parent_id' => 1225,
    ],
    [
        'id' => 1227,
        'name' => 'Производство электроэнергии тепловыми электростанциями, в том числе деятельность по обеспечению работоспособности электростанций',
        'parent_id' => 1226,
    ],
    [
        'id' => 1228,
        'name' => 'Производство электроэнергии гидроэлектростанциями, в том числе деятельность по обеспечению работоспособности электростанций',
        'parent_id' => 1226,
    ],
    [
        'id' => 1229,
        'name' => 'Производство электроэнергии атомными электростанциями, в том числе деятельность по обеспечению работоспособности электростанций',
        'parent_id' => 1226,
    ],
    [
        'id' => 1230,
        'name' => 'Производство электроэнергии, получаемой из возобновляемых источников энергии, включая выработанную солнечными, ветровыми, геотермальными электростанциями, в том числе деятельность по обеспечению их работоспособности',
        'parent_id' => 1226,
    ],
    [
        'id' => 1231,
        'name' => 'Передача электроэнергии и технологическое присоединение к распределительным электросетям',
        'parent_id' => 1225,
    ],
    [
        'id' => 1232,
        'name' => 'Передача электроэнергии',
        'parent_id' => 1231,
    ],
    [
        'id' => 1233,
        'name' => 'Технологическое присоединение к распределительным электросетям',
        'parent_id' => 1231,
    ],
    [
        'id' => 1234,
        'name' => 'Распределение электроэнергии',
        'parent_id' => 1225,
    ],
    [
        'id' => 1235,
        'name' => 'Торговля электроэнергией',
        'parent_id' => 1225,
    ],
    [
        'id' => 1236,
        'name' => 'Производство и распределение газообразного топлива',
        'parent_id' => 1224,
    ],
    [
        'id' => 1237,
        'name' => 'Производство газа',
        'parent_id' => 1236,
    ],
    [
        'id' => 1238,
        'name' => 'Газификация угля',
        'parent_id' => 1237,
    ],
    [
        'id' => 1239,
        'name' => 'Газификация антрацита',
        'parent_id' => 1238,
    ],
    [
        'id' => 1240,
        'name' => 'Газификация каменного угля за исключением антрацита',
        'parent_id' => 1238,
    ],
    [
        'id' => 1241,
        'name' => 'Газификация бурого угля (лигнита)',
        'parent_id' => 1238,
    ],
    [
        'id' => 1242,
        'name' => 'Сжижение углей',
        'parent_id' => 1237,
    ],
    [
        'id' => 1243,
        'name' => 'Сжижение антрацита',
        'parent_id' => 1242,
    ],
    [
        'id' => 1244,
        'name' => 'Сжижение каменного угля за исключением антрацита',
        'parent_id' => 1242,
    ],
    [
        'id' => 1245,
        'name' => 'Сжижение бурого угля (лигнита)',
        'parent_id' => 1242,
    ],
    [
        'id' => 1246,
        'name' => 'Распределение газообразного топлива по газораспределительным сетям',
        'parent_id' => 1236,
    ],
    [
        'id' => 1247,
        'name' => 'Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям',
        'parent_id' => 1246,
    ],
    [
        'id' => 1248,
        'name' => 'Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям по тарифам, регулируемым государством',
        'parent_id' => 1247,
    ],
    [
        'id' => 1249,
        'name' => 'Распределение природного, сухого (отбензиненного) газа по газораспределительным сетям по тарифам, не регулируемым государством',
        'parent_id' => 1247,
    ],
    [
        'id' => 1250,
        'name' => 'Распределение сжиженных углеводородных газов по газораспределительным сетям',
        'parent_id' => 1246,
    ],
    [
        'id' => 1251,
        'name' => 'Распределение сжиженных углеводородных газов по газораспределительным сетям по тарифам, регулируемым государством',
        'parent_id' => 1250,
    ],
    [
        'id' => 1252,
        'name' => 'Распределение сжиженных углеводородных газов по газораспределительным сетям по тарифам, не регулируемым государством',
        'parent_id' => 1250,
    ],
    [
        'id' => 1253,
        'name' => 'Торговля газообразным топливом, подаваемым по распределительным сетям',
        'parent_id' => 1236,
    ],
    [
        'id' => 1254,
        'name' => 'Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям',
        'parent_id' => 1253,
    ],
    [
        'id' => 1255,
        'name' => 'Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям по регулируемым государством ценам (тарифам)',
        'parent_id' => 1254,
    ],
    [
        'id' => 1256,
        'name' => 'Торговля природным, сухим (отбензиненным) газом, подаваемым по распределительным сетям по не регулируемым государством ценам (тарифам)',
        'parent_id' => 1254,
    ],
    [
        'id' => 1257,
        'name' => 'Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям',
        'parent_id' => 1253,
    ],
    [
        'id' => 1258,
        'name' => 'Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям по регулируемым государством ценам (тарифам)',
        'parent_id' => 1257,
    ],
    [
        'id' => 1259,
        'name' => 'Торговля сжиженными углеводородными газами, подаваемыми по распределительным сетям по не регулируемым государством ценам (тарифам)',
        'parent_id' => 1257,
    ],
    [
        'id' => 1260,
        'name' => 'Производство, передача и распределение пара и горячей воды; кондиционирование воздуха',
        'parent_id' => 1224,
    ],
    [
        'id' => 1261,
        'name' => 'Производство пара и горячей воды (тепловой энергии)',
        'parent_id' => 1260,
    ],
    [
        'id' => 1262,
        'name' => 'Производство пара и горячей воды (тепловой энергии) тепловыми электростанциями',
        'parent_id' => 1261,
    ],
    [
        'id' => 1263,
        'name' => 'Производство пара и горячей воды (тепловой энергии) атомными электростанциями',
        'parent_id' => 1261,
    ],
    [
        'id' => 1264,
        'name' => 'Производство пара и горячей воды (тепловой энергии) прочими электростанциями и промышленными блок-станциями',
        'parent_id' => 1261,
    ],
    [
        'id' => 1265,
        'name' => 'Производство пара и горячей воды (тепловой энергии) котельными',
        'parent_id' => 1261,
    ],
    [
        'id' => 1266,
        'name' => 'Производство охлажденной воды или льда (натурального из воды) для целей охлаждения',
        'parent_id' => 1261,
    ],
    [
        'id' => 1267,
        'name' => 'Передача пара и горячей воды (тепловой энергии)',
        'parent_id' => 1260,
    ],
    [
        'id' => 1268,
        'name' => 'Распределение пара и горячей воды (тепловой энергии)',
        'parent_id' => 1260,
    ],
    [
        'id' => 1269,
        'name' => 'Обеспечение работоспособности котельных',
        'parent_id' => 1260,
    ],
    [
        'id' => 1270,
        'name' => 'Обеспечение работоспособности тепловых сетей',
        'parent_id' => 1260,
    ],
    [
        'id' => 1271,
        'name' => 'Торговля паром и горячей водой (тепловой энергией)',
        'parent_id' => 1260,
    ],
    [
        'id' => 1272,
        'name' => 'Забор, очистка и распределение воды',
        'parent_id' => null,
    ],
    [
        'id' => 1273,
        'name' => 'Забор и очистка воды для питьевых и промышленных нужд',
        'parent_id' => 1272,
    ],
    [
        'id' => 1274,
        'name' => 'Распределение воды для питьевых и промышленных нужд',
        'parent_id' => 1272,
    ],
    [
        'id' => 1275,
        'name' => 'Сбор и обработка сточных вод',
        'parent_id' => null,
    ],
    [
        'id' => 1276,
        'name' => 'Сбор, обработка и утилизация отходов; обработка вторичного сырья',
        'parent_id' => null,
    ],
    [
        'id' => 1277,
        'name' => 'Сбор отходов',
        'parent_id' => 1276,
    ],
    [
        'id' => 1278,
        'name' => 'Сбор неопасных отходов',
        'parent_id' => 1277,
    ],
    [
        'id' => 1279,
        'name' => 'Сбор опасных отходов',
        'parent_id' => 1277,
    ],
    [
        'id' => 1280,
        'name' => 'Обработка и утилизация отходов',
        'parent_id' => 1276,
    ],
    [
        'id' => 1281,
        'name' => 'Обработка и утилизация неопасных отходов',
        'parent_id' => 1280,
    ],
    [
        'id' => 1282,
        'name' => 'Обработка и утилизация опасных отходов',
        'parent_id' => 1280,
    ],
    [
        'id' => 1283,
        'name' => 'Обработка и утилизация радиоактивных отходов',
        'parent_id' => 1282,
    ],
    [
        'id' => 1284,
        'name' => 'Деятельность по обращению с отработавшим ядерным топливом',
        'parent_id' => 1283,
    ],
    [
        'id' => 1285,
        'name' => 'Деятельность по обращению с особыми радиоактивными отходами',
        'parent_id' => 1283,
    ],
    [
        'id' => 1286,
        'name' => 'Деятельность по обращению с удаляемыми радиоактивными отходами',
        'parent_id' => 1283,
    ],
    [
        'id' => 1287,
        'name' => 'Обработка и утилизация опасных отходов прочих, не включенных в другие группировки',
        'parent_id' => 1282,
    ],
    [
        'id' => 1288,
        'name' => 'Деятельность по обработке вторичного сырья',
        'parent_id' => 1276,
    ],
    [
        'id' => 1289,
        'name' => 'Демонтаж техники, не подлежащей восстановлению',
        'parent_id' => 1288,
    ],
    [
        'id' => 1290,
        'name' => 'Утилизация отсортированных материалов',
        'parent_id' => 1288,
    ],
    [
        'id' => 1291,
        'name' => 'Сортировка материалов для дальнейшего использования',
        'parent_id' => 1290,
    ],
    [
        'id' => 1292,
        'name' => 'Сортировка металлических материалов для дальнейшего использования',
        'parent_id' => 1291,
    ],
    [
        'id' => 1293,
        'name' => 'Сортировка неметаллических материалов для дальнейшего использования',
        'parent_id' => 1291,
    ],
    [
        'id' => 1294,
        'name' => 'Обработка отходов и лома драгоценных металлов',
        'parent_id' => 1290,
    ],
    [
        'id' => 1295,
        'name' => 'Обработка отходов и лома черных металлов',
        'parent_id' => 1290,
    ],
    [
        'id' => 1296,
        'name' => 'Обработка отходов и лома цветных металлов',
        'parent_id' => 1290,
    ],
    [
        'id' => 1297,
        'name' => 'Обработка отходов и лома металлов, содержащих медь',
        'parent_id' => 1296,
    ],
    [
        'id' => 1298,
        'name' => 'Обработка отходов и лома металлов, содержащих никель',
        'parent_id' => 1296,
    ],
    [
        'id' => 1299,
        'name' => 'Обработка отходов и лома металлов, содержащих алюминий',
        'parent_id' => 1296,
    ],
    [
        'id' => 1300,
        'name' => 'Обработка вторичного сырья, содержащего прочие цветные металлы',
        'parent_id' => 1296,
    ],
    [
        'id' => 1301,
        'name' => 'Обработка вторичного неметаллического сырья',
        'parent_id' => 1290,
    ],
    [
        'id' => 1302,
        'name' => 'Обработка отходов и лома стекла',
        'parent_id' => 1301,
    ],
    [
        'id' => 1303,
        'name' => 'Обработка отходов бумаги и картона',
        'parent_id' => 1301,
    ],
    [
        'id' => 1304,
        'name' => 'Обработка отходов и лома пластмасс',
        'parent_id' => 1301,
    ],
    [
        'id' => 1305,
        'name' => 'Обработка отходов резины',
        'parent_id' => 1301,
    ],
    [
        'id' => 1306,
        'name' => 'Обработка отходов текстильных материалов',
        'parent_id' => 1301,
    ],
    [
        'id' => 1307,
        'name' => 'Обработка прочего вторичного неметаллического сырья',
        'parent_id' => 1301,
    ],
    [
        'id' => 1308,
        'name' => 'Предоставление услуг в области ликвидации последствий загрязнений и прочих услуг, связанных с удалением отходов',
        'parent_id' => null,
    ],
    [
        'id' => 1309,
        'name' => 'Строительство зданий',
        'parent_id' => null,
    ],
    [
        'id' => 1310,
        'name' => 'Разработка строительных проектов',
        'parent_id' => 1309,
    ],
    [
        'id' => 1311,
        'name' => 'Разработка жилых и нежилых зданий',
        'parent_id' => 1309,
    ],
    [
        'id' => 1312,
        'name' => 'Строительство инженерных сооружений',
        'parent_id' => null,
    ],
    [
        'id' => 1313,
        'name' => 'Строительство автомобильных и железных дорог',
        'parent_id' => 1312,
    ],
    [
        'id' => 1314,
        'name' => 'Строительство автомобильных дорог и автомагистралей',
        'parent_id' => 1313,
    ],
    [
        'id' => 1315,
        'name' => 'Строительство железных дорог и метро',
        'parent_id' => 1313,
    ],
    [
        'id' => 1316,
        'name' => 'Строительство мостов и тоннелей',
        'parent_id' => 1313,
    ],
    [
        'id' => 1317,
        'name' => 'Строительство инженерных коммуникаций',
        'parent_id' => 1312,
    ],
    [
        'id' => 1318,
        'name' => 'Строительство инженерных коммуникаций для водоснабжения и водоотведения, газоснабжения',
        'parent_id' => 1317,
    ],
    [
        'id' => 1319,
        'name' => 'Строительство коммунальных объектов для обеспечения электроэнергией и телекоммуникациями',
        'parent_id' => 1317,
    ],
    [
        'id' => 1320,
        'name' => 'Строительство междугородних линий электропередачи и связи',
        'parent_id' => 1319,
    ],
    [
        'id' => 1321,
        'name' => 'Строительство местных линий электропередачи и связи',
        'parent_id' => 1319,
    ],
    [
        'id' => 1322,
        'name' => 'Строительство электростанций',
        'parent_id' => 1319,
    ],
    [
        'id' => 1323,
        'name' => 'Строительство прочих инженерных сооружений',
        'parent_id' => 1312,
    ],
    [
        'id' => 1324,
        'name' => 'Строительство водных сооружений',
        'parent_id' => 1323,
    ],
    [
        'id' => 1325,
        'name' => 'Строительство портовых сооружений',
        'parent_id' => 1324,
    ],
    [
        'id' => 1326,
        'name' => 'Строительство гидротехнических сооружений',
        'parent_id' => 1324,
    ],
    [
        'id' => 1327,
        'name' => 'Строительство ирригационных систем',
        'parent_id' => 1324,
    ],
    [
        'id' => 1328,
        'name' => 'Производство дноочистительных, дноуглубительных и берегоукрепительных работ',
        'parent_id' => 1324,
    ],
    [
        'id' => 1329,
        'name' => 'Производство подводных работ, включая водолазные',
        'parent_id' => 1324,
    ],
    [
        'id' => 1330,
        'name' => 'Строительство прочих инженерных сооружений, не включенных в другие группировки',
        'parent_id' => 1323,
    ],
    [
        'id' => 1331,
        'name' => 'Работы строительные специализированные',
        'parent_id' => null,
    ],
    [
        'id' => 1332,
        'name' => 'Разборка и снос зданий, подготовка строительного участка',
        'parent_id' => 1331,
    ],
    [
        'id' => 1333,
        'name' => 'Разборка и снос зданий',
        'parent_id' => 1332,
    ],
    [
        'id' => 1334,
        'name' => 'Подготовка строительной площадки',
        'parent_id' => 1332,
    ],
    [
        'id' => 1335,
        'name' => 'Расчистка территории строительной площадки',
        'parent_id' => 1334,
    ],
    [
        'id' => 1336,
        'name' => 'Производство дренажных работ на сельскохозяйственных землях, землях лесных территорий, а также на строительных площадках',
        'parent_id' => 1334,
    ],
    [
        'id' => 1337,
        'name' => 'Производство земляных работ',
        'parent_id' => 1334,
    ],
    [
        'id' => 1338,
        'name' => 'Подготовка участка к разработке и добыче полезных ископаемых, за исключением нефтяных и газовых участков',
        'parent_id' => 1334,
    ],
    [
        'id' => 1339,
        'name' => 'Разведочное бурение',
        'parent_id' => 1332,
    ],
    [
        'id' => 1340,
        'name' => 'Производство электромонтажных, санитарно-технических и прочих строительно-монтажных работ',
        'parent_id' => 1331,
    ],
    [
        'id' => 1341,
        'name' => 'Производство электромонтажных работ',
        'parent_id' => 1340,
    ],
    [
        'id' => 1342,
        'name' => 'Производство санитарно-технических работ, монтаж отопительных систем и систем кондиционирования воздуха',
        'parent_id' => 1340,
    ],
    [
        'id' => 1343,
        'name' => 'Производство прочих строительно-монтажных работ',
        'parent_id' => 1340,
    ],
    [
        'id' => 1344,
        'name' => 'Работы строительные отделочные',
        'parent_id' => 1331,
    ],
    [
        'id' => 1345,
        'name' => 'Производство штукатурных работ',
        'parent_id' => 1344,
    ],
    [
        'id' => 1346,
        'name' => 'Работы столярные и плотничные',
        'parent_id' => 1344,
    ],
    [
        'id' => 1347,
        'name' => 'Установка дверей (кроме автоматических и вращающихся), окон, дверных и оконных рам из дерева или прочих материалов',
        'parent_id' => 1346,
    ],
    [
        'id' => 1348,
        'name' => 'Работы по установке внутренних лестниц, встроенных шкафов, встроенного кухонного оборудования',
        'parent_id' => 1346,
    ],
    [
        'id' => 1349,
        'name' => 'Производство работ по внутренней отделке зданий (включая потолки, раздвижные и съемные перегородки и т.д.)',
        'parent_id' => 1346,
    ],
    [
        'id' => 1350,
        'name' => 'Работы по устройству покрытий полов и облицовке стен',
        'parent_id' => 1344,
    ],
    [
        'id' => 1351,
        'name' => 'Производство малярных и стекольных работ',
        'parent_id' => 1344,
    ],
    [
        'id' => 1352,
        'name' => 'Производство малярных работ',
        'parent_id' => 1351,
    ],
    [
        'id' => 1353,
        'name' => 'Производство стекольных работ',
        'parent_id' => 1351,
    ],
    [
        'id' => 1354,
        'name' => 'Производство прочих отделочных и завершающих работ',
        'parent_id' => 1344,
    ],
    [
        'id' => 1355,
        'name' => 'Работы строительные специализированные прочие',
        'parent_id' => 1331,
    ],
    [
        'id' => 1356,
        'name' => 'Производство кровельных работ',
        'parent_id' => 1355,
    ],
    [
        'id' => 1357,
        'name' => 'Работы строительные специализированные прочие, не включенные в другие группировки',
        'parent_id' => 1355,
    ],
    [
        'id' => 1358,
        'name' => 'Работы гидроизоляционные',
        'parent_id' => 1357,
    ],
    [
        'id' => 1359,
        'name' => 'Работы по установке строительных лесов и подмостей',
        'parent_id' => 1357,
    ],
    [
        'id' => 1360,
        'name' => 'Работы свайные и работы по строительству фундаментов',
        'parent_id' => 1357,
    ],
    [
        'id' => 1361,
        'name' => 'Работы бетонные и железобетонные',
        'parent_id' => 1357,
    ],
    [
        'id' => 1362,
        'name' => 'Работы по монтажу стальных строительных конструкций',
        'parent_id' => 1357,
    ],
    [
        'id' => 1363,
        'name' => 'Работы каменные и кирпичные',
        'parent_id' => 1357,
    ],
    [
        'id' => 1364,
        'name' => 'Работы по сборке и монтажу сборных конструкций',
        'parent_id' => 1357,
    ],
    [
        'id' => 1365,
        'name' => 'Работы строительные специализированные, не включенные в другие группировки',
        'parent_id' => 1357,
    ],
    [
        'id' => 1366,
        'name' => 'Торговля оптовая и розничная автотранспортными средствами и мотоциклами и их ремонт',
        'parent_id' => null,
    ],
    [
        'id' => 1367,
        'name' => 'Торговля автотранспортными средствами',
        'parent_id' => 1366,
    ],
    [
        'id' => 1368,
        'name' => 'Торговля легковыми автомобилями и грузовыми автомобилями малой грузоподъемности',
        'parent_id' => 1367,
    ],
    [
        'id' => 1369,
        'name' => 'Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами',
        'parent_id' => 1368,
    ],
    [
        'id' => 1370,
        'name' => 'Торговля розничная легковыми автомобилями и легкими автотранспортными средствами в специализированных магазинах',
        'parent_id' => 1368,
    ],
    [
        'id' => 1371,
        'name' => 'Торговля розничная легковыми автомобилями и легкими автотранспортными средствами прочая',
        'parent_id' => 1368,
    ],
    [
        'id' => 1372,
        'name' => 'Торговля розничная легковыми автомобилями и легкими автотранспортными средствами через информационно-коммуникационную сеть Интернет',
        'parent_id' => 1371,
    ],
    [
        'id' => 1373,
        'name' => 'Торговля розничная легковыми автомобилями и легкими автотранспортными средствами прочая, не включенная в другие группировки',
        'parent_id' => 1371,
    ],
    [
        'id' => 1374,
        'name' => 'Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами за вознаграждение или на договорной основе',
        'parent_id' => 1368,
    ],
    [
        'id' => 1375,
        'name' => 'Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами через информационно-коммуникационную сеть Интернет за вознаграждение или на договорной основе',
        'parent_id' => 1374,
    ],
    [
        'id' => 1376,
        'name' => 'Торговля оптовая легковыми автомобилями и легкими автотранспортными средствами за вознаграждение или на договорной основе прочая',
        'parent_id' => 1374,
    ],
    [
        'id' => 1377,
        'name' => 'Торговля прочими автотранспортными средствами',
        'parent_id' => 1367,
    ],
    [
        'id' => 1378,
        'name' => 'Торговля оптовая прочими автотранспортными средствами, кроме пассажирских',
        'parent_id' => 1377,
    ],
    [
        'id' => 1379,
        'name' => 'Торговля розничная прочими автотранспортными средствами, кроме пассажирских, в специализированных магазинах',
        'parent_id' => 1377,
    ],
    [
        'id' => 1380,
        'name' => 'Торговля розничная прочими автотранспортными средствами, кроме пассажирских, через информационно-коммуникационную сеть Интернет',
        'parent_id' => 1379,
    ],
    [
        'id' => 1381,
        'name' => 'Торговля розничная прочими автотранспортными средствами, кроме пассажирских, прочая, не включенная в другие группировки',
        'parent_id' => 1379,
    ],
    [
        'id' => 1382,
        'name' => 'Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, за вознаграждение или на договорной основе',
        'parent_id' => 1377,
    ],
    [
        'id' => 1383,
        'name' => 'Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, через информационно-коммуникационную сеть Интернет за вознаграждение или на договорной основе',
        'parent_id' => 1382,
    ],
    [
        'id' => 1384,
        'name' => 'Торговля оптовая прочими автотранспортными средствами, кроме пассажирских, за вознаграждение или на договорной основе прочая',
        'parent_id' => 1382,
    ],
    [
        'id' => 1385,
        'name' => 'Техническое обслуживание и ремонт автотранспортных средств',
        'parent_id' => 1366,
    ],
    [
        'id' => 1386,
        'name' => 'Техническое обслуживание и ремонт легковых автомобилей и легких грузовых автотранспортных средств',
        'parent_id' => 1385,
    ],
    [
        'id' => 1387,
        'name' => 'Техническое обслуживание и ремонт прочих автотранспортных средств',
        'parent_id' => 1385,
    ],
    [
        'id' => 1388,
        'name' => 'Мойка автотранспортных средств, полирование и предоставление аналогичных услуг',
        'parent_id' => 1385,
    ],
    [
        'id' => 1389,
        'name' => 'Техническая помощь на дорогах и транспортирование неисправных автотранспортных средств к месту их ремонта или стоянки',
        'parent_id' => 1385,
    ],
    [
        'id' => 1390,
        'name' => 'Деятельность по зарядке аккумуляторных батарей транспортных средств с электродвигателями',
        'parent_id' => 1385,
    ],
    [
        'id' => 1391,
        'name' => 'Торговля автомобильными деталями, узлами и принадлежностями',
        'parent_id' => 1366,
    ],
    [
        'id' => 1392,
        'name' => 'Торговля оптовая автомобильными деталями, узлами и принадлежностями',
        'parent_id' => 1391,
    ],
    [
        'id' => 1393,
        'name' => 'Торговля оптовая автомобильными деталями, узлами и принадлежностями, кроме деятельности агентов',
        'parent_id' => 1392,
    ],
    [
        'id' => 1394,
        'name' => 'Деятельность агентов по оптовой торговле автомобильными деталями, узлами и принадлежностями',
        'parent_id' => 1392,
    ],
    [
        'id' => 1395,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями',
        'parent_id' => 1391,
    ],
    [
        'id' => 1396,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями в специализированных магазинах',
        'parent_id' => 1395,
    ],
    [
        'id' => 1397,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями прочая',
        'parent_id' => 1395,
    ],
    [
        'id' => 1398,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями через информационно-коммуникационную сеть Интернет',
        'parent_id' => 1397,
    ],
    [
        'id' => 1399,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями по почтовым заказам',
        'parent_id' => 1397,
    ],
    [
        'id' => 1400,
        'name' => 'Торговля розничная автомобильными деталями, узлами и принадлежностями прочая, не включенная в другие группировки',
        'parent_id' => 1397,
    ],
    [
        'id' => 1401,
        'name' => 'Торговля мотоциклами, их деталями, узлами и принадлежностями; техническое обслуживание и ремонт мотоциклов',
        'parent_id' => 1366,
    ],
    [
        'id' => 1402,
        'name' => 'Торговля оптовая мотоциклами, их деталями, узлами и принадлежностями',
        'parent_id' => 1401,
    ],
    [
        'id' => 1403,
        'name' => 'Торговля розничная мотоциклами, их деталями, составными частями и принадлежностями в специализированных магазинах',
        'parent_id' => 1401,
    ],
    [
        'id' => 1404,
        'name' => 'Торговля розничная мотоциклами, их деталями, узлами и принадлежностями прочая',
        'parent_id' => 1401,
    ],
    [
        'id' => 1405,
        'name' => 'Деятельность агентов по оптовой торговле мотоциклами, их деталями, узлами и принадлежностями',
        'parent_id' => 1401,
    ],
    [
        'id' => 1406,
        'name' => 'Техническое обслуживание и ремонт мотоциклов и мототранспортных средств',
        'parent_id' => 1401,
    ],
    [
        'id' => 1407,
        'name' => 'Торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами',
        'parent_id' => null,
    ],
    [
        'id' => 1408,
        'name' => 'Торговля оптовая за вознаграждение или на договорной основе',
        'parent_id' => 1407,
    ],
    [
        'id' => 1409,
        'name' => 'Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами',
        'parent_id' => 1408,
    ],
    [
        'id' => 1410,
        'name' => 'Деятельность агентов по оптовой торговле живыми животными',
        'parent_id' => 1409,
    ],
    [
        'id' => 1411,
        'name' => 'Деятельность агентов по оптовой торговле цветами и растениями',
        'parent_id' => 1409,
    ],
    [
        'id' => 1412,
        'name' => 'Деятельность агентов по оптовой торговле прочим сельскохозяйственным сырьем, текстильным сырьем и полуфабрикатами',
        'parent_id' => 1409,
    ],
    [
        'id' => 1413,
        'name' => 'Деятельность агентов по оптовой торговле зерном',
        'parent_id' => 1412,
    ],
    [
        'id' => 1414,
        'name' => 'Деятельность агентов по оптовой торговле семенами, кроме семян масличных культур',
        'parent_id' => 1412,
    ],
    [
        'id' => 1415,
        'name' => 'Деятельность агентов по оптовой торговле семенами масличных культур',
        'parent_id' => 1412,
    ],
    [
        'id' => 1416,
        'name' => 'Деятельность агентов по оптовой торговле кормами для сельскохозяйственных животных',
        'parent_id' => 1412,
    ],
    [
        'id' => 1417,
        'name' => 'Деятельность агентов по оптовой торговле текстильным сырьем и полуфабрикатами',
        'parent_id' => 1412,
    ],
    [
        'id' => 1418,
        'name' => 'Деятельность агентов по оптовой торговле прочими сельскохозяйственным сырьем и сельскохозяйственными полуфабрикатами, не включенными в другие группировки',
        'parent_id' => 1412,
    ],
    [
        'id' => 1419,
        'name' => 'Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами',
        'parent_id' => 1408,
    ],
    [
        'id' => 1420,
        'name' => 'Деятельность агентов по оптовой торговле твердым, жидким и газообразным топливом и связанными продуктами',
        'parent_id' => 1419,
    ],
    [
        'id' => 1421,
        'name' => 'Деятельность агентов по оптовой торговле рудами и металлами в первичных формах',
        'parent_id' => 1419,
    ],
    [
        'id' => 1422,
        'name' => 'Деятельность агентов по оптовой торговле рудами',
        'parent_id' => 1421,
    ],
    [
        'id' => 1423,
        'name' => 'Деятельность агентов по оптовой торговле металлами в первичных формах',
        'parent_id' => 1421,
    ],
    [
        'id' => 1424,
        'name' => 'Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами, удобрениями и агрохимикатами',
        'parent_id' => 1419,
    ],
    [
        'id' => 1425,
        'name' => 'Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами',
        'parent_id' => 1424,
    ],
    [
        'id' => 1426,
        'name' => 'Деятельность агентов по оптовой торговле удобрениями и агрохимикатами',
        'parent_id' => 1424,
    ],
    [
        'id' => 1427,
        'name' => 'Деятельность агентов по оптовой торговле лесоматериалами и строительными материалами',
        'parent_id' => 1408,
    ],
    [
        'id' => 1428,
        'name' => 'Деятельность агентов по оптовой торговле лесоматериалами',
        'parent_id' => 1247,
    ],
    [
        'id' => 1429,
        'name' => 'Деятельность агентов по оптовой торговле строительными материалами',
        'parent_id' => 1247,
    ],
    [
        'id' => 1430,
        'name' => 'Деятельность агентов по оптовой торговле машинами, промышленным оборудованием, судами и летательными аппаратами',
        'parent_id' => 1408,
    ],
    [
        'id' => 1431,
        'name' => 'Деятельность агентов по оптовой торговле вычислительной техникой, телекоммуникационным оборудованием и прочим офисным оборудованием',
        'parent_id' => 1250,
    ],
    [
        'id' => 1432,
        'name' => 'Деятельность агентов по оптовой торговле судами, летательными аппаратами и прочими транспортными средствами, не включенными в другие группировки',
        'parent_id' => 1250,
    ],
    [
        'id' => 1433,
        'name' => 'Деятельность агентов по оптовой торговле прочими видами машин и промышленным оборудованием',
        'parent_id' => 1250,
    ],
    [
        'id' => 1434,
        'name' => 'Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными, ножевыми и прочими металлическими изделиями',
        'parent_id' => 1408,
    ],
    [
        'id' => 1435,
        'name' => 'Деятельность агентов по оптовой торговле мебелью',
        'parent_id' => 1434,
    ],
    [
        'id' => 1436,
        'name' => 'Деятельность агентов по оптовой торговле скобяными, ножевыми и прочими бытовыми металлическими изделиями',
        'parent_id' => 1434,
    ],
    [
        'id' => 1437,
        'name' => 'Деятельность агентов по оптовой торговле электротоварами и бытовыми электроустановочными изделиями',
        'parent_id' => 1434,
    ],
    [
        'id' => 1438,
        'name' => 'Деятельность агентов по оптовой торговле радио- и телеаппаратурой, техническими носителями информации',
        'parent_id' => 1434,
    ],
    [
        'id' => 1439,
        'name' => 'Деятельность агентов по оптовой торговле прочими бытовыми товарами, не включенными в другие группировки',
        'parent_id' => 1434,
    ],
    [
        'id' => 1440,
        'name' => 'Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха',
        'parent_id' => 1408,
    ],
    [
        'id' => 1441,
        'name' => 'Деятельность агентов по оптовой торговле текстильными изделиями',
        'parent_id' => 1440,
    ],
    [
        'id' => 1442,
        'name' => 'Деятельность агентов по оптовой торговле одеждой, изделиями из меха и обувью',
        'parent_id' => 1440,
    ],
    [
        'id' => 1443,
        'name' => 'Деятельность агентов по оптовой торговле изделиями из кожи и дорожными принадлежностями',
        'parent_id' => 1440,
    ],
    [
        'id' => 1444,
        'name' => 'Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями',
        'parent_id' => 1408,
    ],
    [
        'id' => 1445,
        'name' => 'Деятельность агентов по оптовой торговле пищевыми продуктами',
        'parent_id' => 1444,
    ],
    [
        'id' => 1446,
        'name' => 'Деятельность агентов по оптовой торговле напитками',
        'parent_id' => 1444,
    ],
    [
        'id' => 1447,
        'name' => 'Деятельность агентов по оптовой торговле безалкогольными напитками',
        'parent_id' => 1446,
    ],
    [
        'id' => 1448,
        'name' => 'Деятельность агентов по оптовой торговле алкогольными напитками, кроме пива',
        'parent_id' => 1446,
    ],
    [
        'id' => 1449,
        'name' => 'Деятельность агентов по оптовой торговле пивом',
        'parent_id' => 1446,
    ],
    [
        'id' => 1450,
        'name' => 'Деятельность агентов по оптовой торговле табачными изделиями',
        'parent_id' => 1444,
    ],
    [
        'id' => 1451,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле прочими отдельными видами товаров',
        'parent_id' => 1408,
    ],
    [
        'id' => 1452,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией, изделиями, применяемыми в медицинских целях, парфюмерными и косметическими товарами, включая мыло, и чистящими средствами',
        'parent_id' => 1451,
    ],
    [
        'id' => 1453,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией',
        'parent_id' => 1452,
    ],
    [
        'id' => 1454,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле изделиями, применяемыми в медицинских целях',
        'parent_id' => 1452,
    ],
    [
        'id' => 1455,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле парфюмерными и косметическими товарами, включая мыло',
        'parent_id' => 1452,
    ],
    [
        'id' => 1456,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле чистящими средствами',
        'parent_id' => 1452,
    ],
    [
        'id' => 1457,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле играми и игрушками, спортивными товарами, велосипедами, книгами, газетами, журналами, писчебумажными и канцелярскими товарами, музыкальными инструментами, часами и ювелирными изделиями, фототоварами и оптическими товарами',
        'parent_id' => 1451,
    ],
    [
        'id' => 1458,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле техникой, оборудованием и инструментами, применяемыми в медицинских целях',
        'parent_id' => 1451,
    ],
    [
        'id' => 1459,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле товарами, не включенными в другие группировки',
        'parent_id' => 1451,
    ],
    [
        'id' => 1460,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле бумагой и картоном',
        'parent_id' => 1459,
    ],
    [
        'id' => 1461,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле древесным сырьем и необработанными лесоматериалами',
        'parent_id' => 1459,
    ],
    [
        'id' => 1462,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле отходами, ломом и материалами для переработки',
        'parent_id' => 1459,
    ],
    [
        'id' => 1463,
        'name' => 'Деятельность агентов, специализирующихся на оптовой торговле прочими товарами, не включенными в другие группировки',
        'parent_id' => 1459,
    ],
    [
        'id' => 1464,
        'name' => 'Деятельность агентов по оптовой торговле универсальным ассортиментом товаров',
        'parent_id' => 1408,
    ],
    [
        'id' => 1465,
        'name' => 'Торговля оптовая сельскохозяйственным сырьем и живыми животными',
        'parent_id' => 1407,
    ],
    [
        'id' => 1466,
        'name' => 'Торговля оптовая зерном, необработанным табаком, семенами и кормами для сельскохозяйственных животных',
        'parent_id' => 1465,
    ],
    [
        'id' => 1467,
        'name' => 'Торговля оптовая зерном, семенами и кормами для животных',
        'parent_id' => 1466,
    ],
    [
        'id' => 1468,
        'name' => 'Торговля оптовая зерном',
        'parent_id' => 1467,
    ],
    [
        'id' => 1469,
        'name' => 'Торговля оптовая семенами, кроме семян масличных культур',
        'parent_id' => 1467,
    ],
    [
        'id' => 1470,
        'name' => 'Торговля оптовая масличными семенами и маслосодержащими плодами',
        'parent_id' => 1467,
    ],
    [
        'id' => 1471,
        'name' => 'Торговля оптовая кормами для сельскохозяйственных животных',
        'parent_id' => 1467,
    ],
    [
        'id' => 1472,
        'name' => 'Торговля оптовая сельскохозяйственным сырьем, не включенным в другие группировки',
        'parent_id' => 1467,
    ],
    [
        'id' => 1473,
        'name' => 'Торговля оптовая цветами и растениями',
        'parent_id' => 1465,
    ],
    [
        'id' => 1474,
        'name' => 'Торговля оптовая живыми животными',
        'parent_id' => 1465,
    ],
    [
        'id' => 1475,
        'name' => 'Торговля оптовая шкурами и кожей',
        'parent_id' => 1465,
    ],
    [
        "id" => 1475,
        "name" => "Торговля оптовая пищевыми продуктами, напитками и табачными изделиями",
        "parent_id" => 1407
    ],
    [
        "id" => 1476,
        "name" => "Торговля оптовая фруктами и овощами",
        "parent_id" => 1475
    ],
    [
        "id" => 1477,
        "name" => "Торговля оптовая свежими овощами, фруктами и орехами",
        "parent_id" => 1476
    ],
    [
        "id" => 1478,
        "name" => "Торговля оптовая свежим картофелем",
        "parent_id" => 1477
    ],
    [
        "id" => 1479,
        "name" => "Торговля оптовая прочими свежими овощами",
        "parent_id" => 1477
    ],
    [
        "id" => 1480,
        "name" => "Торговля оптовая свежими фруктами и орехами",
        "parent_id" => 1477
    ],
    [
        "id" => 1481,
        "name" => "Торговля оптовая консервированными овощами, фруктами и орехами",
        "parent_id" => 1476
    ],
    [
        "id" => 1482,
        "name" => "Торговля оптовая мясом и мясными продуктами",
        "parent_id" => 1475
    ],
    [
        "id" => 1483,
        "name" => "Мясом и мясом птицы, включая субпродукты",
        "parent_id" => 1482
    ],
    [
        "id" => 1484,
        "name" => "Торговля оптовая продуктами из мяса и мяса птицы",
        "parent_id" => 1482
    ],
    [
        "id" => 1485,
        "name" => "Торговля оптовая консервами из мяса и мяса птицы",
        "parent_id" => 1482
    ],
    [
        "id" => 1515,
        "name" => "Торговля оптовая консервами из мяса и мяса птицы",
        "parent_id" => 1482
    ],
    [
        "id" => 1486,
        "name" => "Торговля оптовая молочными продуктами, яйцами и пищевыми маслами и жирами",
        "parent_id" => 1475
    ],
    [
        "id" => 1487,
        "name" => "Торговля оптовая молочными продуктами",
        "parent_id" => 1486
    ],
    [
        "id" => 1488,
        "name" => "Торговля оптовая яйцами",
        "parent_id" => 1486
    ],
    [
        "id" => 1489,
        "name" => "Торговля оптовая пищевыми маслами и жирами",
        "parent_id" => 1486
    ],
    [
        "id" => 1490,
        "name" => "Торговля оптовая напитками",
        "parent_id" => 1475
    ],
    [
        "id" => 1491,
        "name" => "Торговля оптовая соками, минеральной водой и прочими безалкогольными напитками",
        "parent_id" => 1490
    ],
    [
        "id" => 1492,
        "name" => "Торговля оптовая алкогольными напитками, включая пиво и пищевой этиловый спирт",
        "parent_id" => 1490
    ],
    [
        "id" => 1493,
        "name" => "Торговля оптовая алкогольными напитками, кроме пива и пищевого этилового спирта",
        "parent_id" => 1492
    ],
    [
        "id" => 1494,
        "name" => "Торговля оптовая пищевым этиловым спиртом",
        "parent_id" => 1492
    ],
    [
        "id" => 1495,
        "name" => "Торговля оптовая пивом",
        "parent_id" => 1492
    ],
    [
        "id" => 1496,
        "name" => "Торговля оптовая табачными изделиями",
        "parent_id" => 1475
    ],
    [
        "id" => 1497,
        "name" => "Торговля оптовая сахаром, шоколадом и сахаристыми кондитерскими изделиями",
        "parent_id" => 1475
    ],
    [
        "id" => 1498,
        "name" => "Торговля оптовая сахаром",
        "parent_id" => 1497
    ],
    [
        "id" => 1499,
        "name" => "Торговля оптовая шоколадом и сахаристыми кондитерскими изделиями",
        "parent_id" => 1497
    ],
    [
        "id" => 1500,
        "name" => "Торговля оптовая мучными кондитерскими изделиями",
        "parent_id" => 1475
    ],
    [
        "id" => 1501,
        "name" => "Торговля оптовая хлебобулочными изделиями",
        "parent_id" => 1475
    ],
    [
        "id" => 1502,
        "name" => "Торговля оптовая кофе, чаем, какао и пряностями",
        "parent_id" => 1475
    ],
    [
        "id" => 1503,
        "name" => "Торговля оптовая рыбой, ракообразными и моллюсками, консервами и пресервами из рыбы и морепродуктов",
        "parent_id" => 1475
    ],
    [
        "id" => 1504,
        "name" => "Торговля оптовая прочими пищевыми продуктами",
        "parent_id" => 1475
    ],
    [
        "id" => 1505,
        "name" => "Торговля оптовая гомогенизированными пищевыми продуктами, детским и диетическим питанием",
        "parent_id" => 1504
    ],
    [
        "id" => 1506,
        "name" => "Торговля оптовая кормами для домашних животных",
        "parent_id" => 1504
    ],
    [
        "id" => 1507,
        "name" => "Торговля оптовая мукой и макаронными изделиями",
        "parent_id" => 1504
    ],
    [
        "id" => 1508,
        "name" => "Торговля оптовая крупами",
        "parent_id" => 1504
    ],
    [
        "id" => 1509,
        "name" => "Торговля оптовая солью",
        "parentid" => 1504
    ],
    [
        "id" => 1510,
        "name" => "Торговля оптовая мороженым и замороженными десертами",
        "parentid" => 1504
    ],

    [
        "id" => 1511,
        "name" => "Торговля оптовая прочими пищевыми продуктами, не включенными в другие группировки",
        "parent_id" => 1504,
    ],
    [
        "id" => 1512,
        "name" => "Торговля оптовая неспециализированная пищевыми продуктами, напитками и табачными изделиями",
        "parent_id" => 1475,
    ],
    [
        "id" => 1513,
        "name" => "Торговля оптовая неспециализированная замороженными пищевыми продуктами",
        "parent_id" => 1512,
    ],
    [
        "id" => 1514,
        "name" => "Торговля оптовая неспециализированная незамороженными пищевыми продуктами, напитками и табачными изделиями",
        "parent_id" => 1512
    ],
    [
        "id" => 1514,
        "name" => "Торговля оптовая неспециализированная незамороженными пищевыми продуктами, напитками и табачными изделиями",
        "parent_id" => 1512
    ],
    [
        'id' => 1516,
        'name' => 'Торговля оптовая непродовольственными потребительскими товарами',
        'parent_id' => 1407
    ],
    [
        'id' => 1517,
        'name' => 'Торговля оптовая текстильными изделиями',
        'parent_id' => 1516
    ],
    [
        'id' => 1518,
        'name' => 'Торговля оптовая текстильными изделиями, кроме текстильных галантерейных изделий',
        'parent_id' => 1517
    ],
    [
        'id' => 1519,
        'name' => 'Торговля оптовая галантерейными изделиями',
        'parent_id' => 1517
    ],
    [
        'id' => 1520,
        'name' => 'Торговля оптовая одеждой и обувью',
        'parent_id' => 1516
    ],
    [
        'id' => 1521,
        'name' => 'Торговля оптовая одеждой',
        'parent_id' => 1520
    ],
    [
        'id' => 1522,
        'name' => 'Торговля оптовая одеждой, включая спортивную, кроме нательного белья',
        'parent_id' => 1521
    ],
    [
        'id' => 1523,
        'name' => 'Торговля оптовая нательным бельем',
        'parent_id' => 1521
    ],
    [
        'id' => 1524,
        'name' => 'Торговля оптовая изделиями из меха',
        'parent_id' => 1521
    ],
    [
        'id' => 1525,
        'name' => 'Торговля оптовая аксессуарами одежды и головными уборами, кроме меховых',
        'parent_id' => 1521
    ],
    [
        'id' => 1526,
        'name' => 'Торговля оптовая обувью',
        'parent_id' => 1520
    ],
    [
        'id' => 1527,
        'name' => 'Торговля оптовая бытовыми электротоварами',
        'parent_id' => 1516
    ],
    [
        'id' => 1528,
        'name' => 'Торговля оптовая электрической бытовой техникой',
        'parent_id' => 1527
    ],
    [
        'id' => 1529,
        'name' => 'Торговля оптовая радио-, теле- и видеоаппаратурой и аппаратурой для цифровых видеодисков (DVD)',
        'parent_id' => 1527
    ],
    [
        'id' => 1530,
        'name' => 'Торговля оптовая грампластинками, аудио- и видеомагнитными лентами, компакт-дисками (CD) и цифровыми видеодисками (DVD) (кроме носителей без записей)',
        'parent_id' => 1527
    ],
    [
        'id' => 1531,
        'name' => 'Торговля оптовая фототоварами и оптическими товарами',
        'parent_id' => 1527
    ],
    [
        'id' => 1532,
        'name' => 'Торговля оптовая изделиями из керамики и стекла и чистящими средствами',
        'parent_id' => 1516
    ],
    [
        'id' => 1533,
        'name' => 'Торговля оптовая изделиями из керамики и стекла',
        'parent_id' => 1532
    ],
    [
        'id' => 1534,
        'name' => 'Торговля оптовая чистящими средствами',
        'parent_id' => 1532
    ],
    [
        'id' => 1535,
        'name' => 'Торговля оптовая парфюмерными и косметическими товарами',
        'parent_id' => 1516
    ],
    [
        'id' => 1536,
        'name' => 'Торговля оптовая парфюмерными и косметическими товарами, кроме мыла',
        'parent_id' => 1535
    ],
    [
        'id' => 1537,
        'name' => 'Торговля оптовая туалетным и хозяйственным мылом',
        'parent_id' => 1535
    ],
    [
        'id' => 1538,
        'name' => 'Торговля оптовая фармацевтической продукцией',
        'parent_id' => 1516
    ],
    [
        'id' => 1539,
        'name' => 'Торговля оптовая фармацевтической продукцией',
        'parent_id' => 1538
    ],
    [
        'id' => 1540,
        'name' => 'Торговля оптовая изделиями, применяемыми в медицинских целях',
        'parent_id' => 1538
    ],
    [
        'id' => 1541,
        'name' => 'Торговля оптовая мебелью, коврами и осветительным оборудованием',
        'parent_id' => 1516
    ],
    [
        'id' => 1542,
        'name' => 'Торговля оптовая бытовой мебелью',
        'parent_id' => 1541
    ],
    [
        'id' => 1543,
        'name' => 'Торговля оптовая осветительным оборудованием',
        'parent_id' => 1541
    ],
    [
        'id' => 1544,
        'name' => 'Торговля оптовая коврами и ковровыми изделиями',
        'parent_id' => 1541
    ],
    [
        'id' => 1545,
        'name' => 'Торговля оптовая часами и ювелирными изделиями',
        'parent_id' => 1516
    ],
    [
        'id' => 1546,
        'name' => 'Торговля оптовая часами',
        'parent_id' => 1545
    ],
    [
        'id' => 1547,
        'name' => 'Торговля оптовая ювелирными изделиями',
        'parent_id' => 1545
    ],
    [
        'id' => 1548,
        'name' => 'Торговля оптовая прочими бытовыми товарами',
        'parent_id' => 1516
    ],
    [
        'id' => 1549,
        'name' => 'Торговля оптовая ножевыми изделиями и бытовой металлической посудой',
        'parent_id' => 1548
    ],
    [
        'id' => 1550,
        'name' => 'Торговля оптовая плетеными изделиями, изделиями из пробки, бондарными изделиями и прочими бытовыми деревянными изделиями',
        'parent_id' => 1548
    ],
    [
        'id' => 1551,
        'name' => 'Торговля оптовая книгами, газетами и журналами, писчебумажными и канцелярскими товарами',
        'parent_id' => 1548
    ],
    [
        'id' => 1552,
        'name' => 'Торговля оптовая книгами',
        'parent_id' => 1551
    ],
    [
        'id' => 1553,
        'name' => 'Торговля оптовая газетами и журналами',
        'parent_id' => 1551
    ],
    [
        'id' => 1554,
        'name' => 'Торговля оптовая писчебумажными и канцелярскими товарами',
        'parent_id' => 1551
    ],
    [
        'id' => 1555,
        'name' => 'Торговля оптовая прочими потребительскими товарами',
        'parent_id' => 1548
    ],
    [
        'id' => 1556,
        'name' => 'Торговля оптовая музыкальными инструментами и нотными изданиями',
        'parent_id' => 1555
    ],
    [
        'id' => 1557,
        'name' => 'Торговля оптовая играми и игрушками',
        'parent_id' => 1555
    ],
    [
        'id' => 1558,
        'name' => 'Торговля оптовая спортивными товарами, включая велосипеды',
        'parent_id' => 1555
    ],
    [
        'id' => 1559,
        'name' => 'Торговля оптовая изделиями из кожи и дорожными аксессуарами',
        'parent_id' => 1555
    ],
    [
        'id' => 1560,
        'name' => 'Торговля оптовая прочими потребительскими товарами, не включенными в другие группировки',
        'parent_id' => 1555
    ],
    [
        'id' => 1561,
        'name' => 'Торговля оптовая неэлектрическими бытовыми приборами',
        'parent_id' => 1548
    ],
    [
        'id' => 1562,
        'name' => 'Торговля оптовая информационным и коммуникационным оборудованием',
        'parent_id' => 1407
    ],
    [
        'id' => 1563,
        'name' => 'Торговля оптовая компьютерами, периферийными устройствами к компьютерам и программным обеспечением',
        'parent_id' => 1562
    ],
    [
        'id' => 1564,
        'name' => 'Торговля оптовая компьютерами и периферийными устройствами',
        'parent_id' => 1563
    ],
    [
        'id' => 1565,
        'name' => 'Торговля оптовая программным обеспечением',
        'parent_id' => 1563
    ],
    [
        'id' => 1566,
        'name' => 'Торговля оптовая электронным и телекоммуникационным оборудованием и его запасными частями',
        'parent_id' => 1562
    ],
    [
        'id' => 1567,
        'name' => 'Торговля оптовая телекоммуникационным оборудованием и его запасными частями',
        'parent_id' => 1566
    ],
    [
        'id' => 1568,
        'name' => 'Торговля оптовая электронным оборудованием и его запасными частями',
        'parent_id' => 1566
    ],
    [
        'id' => 1569,
        'name' => 'Торговля оптовая аудио- и видеомагнитными лентами и дискетами, магнитными и оптическими дисками, компакт-дисками (CD), цифровыми видеодисками (DVD) и прочими техническими носителями информации без записей',
        'parent_id' => 1566
    ],
    ['id' => 1570, 'name' => 'Торговля оптовая прочими машинами, оборудованием и принадлежностями', 'parent_id' => 1407],
    ['id' => 1571, 'name' => 'Торговля оптовая машинами, оборудованием и инструментами для сельского хозяйства', 'parent_id' => 1570],
    ['id' => 1572, 'name' => 'Торговля оптовая сельскохозяйственными и лесохозяйственными машинами, оборудованием и инструментами, включая тракторы', 'parent_id' => 1571],
    ['id' => 1573, 'name' => 'Торговля оптовая садово-огородной техникой и инвентарем', 'parent_id' => 1571],
    ['id' => 1574, 'name' => 'Торговля оптовая станками', 'parent_id' => 1570],
    ['id' => 1575, 'name' => 'Торговля оптовая деревообрабатывающими станками', 'parent_id' => 1574],
    ['id' => 1576, 'name' => 'Торговля оптовая металлообрабатывающими станками', 'parent_id' => 1574],
    ['id' => 1577, 'name' => 'Торговля оптовая станками для обработки прочих материалов', 'parent_id' => 1574],
    ['id' => 1578, 'name' => 'Торговля оптовая машинами и оборудованием для добычи полезных ископаемых и строительства', 'parent_id' => 1570],
    ['id' => 1579, 'name' => 'Торговля оптовая машинами и оборудованием для текстильного, швейного и трикотажного производства', 'parent_id' => 1570],
    ['id' => 1580, 'name' => 'Торговля оптовая офисной мебелью', 'parent_id' => 1570],
    ['id' => 1581, 'name' => 'Торговля оптовая прочей офисной техникой и оборудованием', 'parent_id' => 1570],
    ['id' => 1582, 'name' => 'Торговля оптовая прочими машинами и оборудованием', 'parent_id' => 1570],
    ['id' => 1583, 'name' => 'Торговля оптовая транспортными средствами, кроме автомобилей, мотоциклов и велосипедов', 'parent_id' => 1582],
    ['id' => 1584, 'name' => 'Торговля оптовая эксплуатационными материалами и принадлежностями машин', 'parent_id' => 1582],
    ['id' => 1585, 'name' => 'Торговля оптовая подъемно-транспортными машинами и оборудованием', 'parent_id' => 1582],
    ['id' => 1586, 'name' => 'Торговля оптовая машинами и оборудованием для производства пищевых продуктов, напитков и табачных изделий', 'parent_id' => 1582],
    ['id' => 1587, 'name' => 'Торговля оптовая производственным электротехническим оборудованием, машинами, аппаратурой и материалами', 'parent_id' => 1582],
    ['id' => 1588, 'name' => 'Торговля оптовая оружием и боеприпасами', 'parent_id' => 1582],
    ['id' => 1589, 'name' => 'Торговля оптовая измерительными приборами и оборудованием', 'parent_id' => 1582],
    ['id' => 1590, 'name' => 'Торговля оптовая техникой, оборудованием и инструментами, применяемыми в медицинских целях', 'parent_id' => 1582],
    ['id' => 1591, 'name' => 'Торговля оптовая прочими машинами, приборами, аппаратурой и оборудованием общепромышленного и специального назначения', 'parent_id' => 1582],
    ['id' => 1592, 'name' => 'Торговля оптовая специализированная прочая', 'parent_id' => 1407],
    ['id' => 1593, 'name' => 'Торговля оптовая твердым, жидким и газообразным топливом и подобными продуктами', 'parent_id' => 1592],
    ['id' => 1594, 'name' => 'Торговля оптовая твердым топливом', 'parent_id' => 1592],
    ['id' => 1595, 'name' => 'Торговля оптовая моторным топливом, включая авиационный бензин', 'parent_id' => 1592],
    ['id' => 1596, 'name' => 'Торговля оптовая нефтью', 'parent_id' => 1592],
    ['id' => 1597, 'name' => 'Торговля оптовая природным (естественным) газом', 'parent_id' => 1592],
    ['id' => 1598, 'name' => 'Торговля оптовая сжиженными углеводородными газами', 'parent_id' => 1592],
    ['id' => 1599, 'name' => 'Торговля оптовая сжиженными углеводородными газами по регулируемым государством ценам (тарифам)', 'parent_id' => 1598],
    ['id' => 1600, 'name' => 'Торговля оптовая сжиженными углеводородными газами по не регулируемым государством ценам (тарифам)', 'parent_id' => 1598],
    ['id' => 1601, 'name' => 'Торговля оптовая прочим топливом и подобными продуктами', 'parent_id' => 1592],
    ['id' => 1602, 'name' => 'Торговля оптовая металлами и металлическими рудами', 'parent_id' => 1592],
    ['id' => 1603, 'name' => 'Торговля оптовая металлическими рудами', 'parent_id' => 1602],
    ['id' => 1604, 'name' => 'Торговля оптовая железными рудами', 'parent_id' => 1603],
    ['id' => 1605, 'name' => 'Торговля оптовая рудами цветных металлов', 'parent_id' => 1603],
    ['id' => 1606, 'name' => 'Торговля оптовая металлами в первичных формах', 'parent_id' => 1602],
    ['id' => 1607, 'name' => 'Торговля оптовая черными металлами в первичных формах', 'parent_id' => 1606],
    ['id' => 1608, 'name' => 'Торговля оптовая цветными металлами в первичных формах, кроме драгоценных', 'parent_id' => 1606],
    ['id' => 1609, 'name' => 'Торговля оптовая золотом и другими драгоценными металлами', 'parent_id' => 1606],
    ['id' => 1610, 'name' => 'Торговля оптовая лесоматериалами, строительными материалами и санитарно-техническим оборудованием', 'parent_id' => 1592],
    ['id' => 1611, 'name' => 'Торговля оптовая древесным сырьем и необработанными лесоматериалами', 'parent_id' => 1610],
    ['id' => 1612, 'name' => 'Торговля оптовая пиломатериалами', 'parent_id' => 1610],
    ['id' => 1613, 'name' => 'Торговля оптовая санитарно-техническим оборудованием', 'parent_id' => 1610],
    ['id' => 1614, 'name' => 'Торговля оптовая лакокрасочными материалами', 'parent_id' => 1610],
    ['id' => 1615, 'name' => 'Торговля оптовая листовым стеклом', 'parent_id' => 1610],
    ['id' => 1616, 'name' => 'Торговля оптовая прочими строительными материалами и изделиями', 'parent_id' => 1610],
    ['id' => 1617, 'name' => 'Торговля оптовая обоями', 'parent_id' => 1610],
    ['id' => 1618, 'name' => 'Торговля оптовая напольными покрытиями (кроме ковров)', 'parent_id' => 1610],
    ['id' => 1619, 'name' => 'Торговля оптовая скобяными изделиями, водопроводным и отопительным оборудованием и принадлежностями', 'parent_id' => 1592],
    ['id' => 1620, 'name' => 'Торговля оптовая скобяными изделиями', 'parent_id' => 1619],
    ['id' => 1621, 'name' => 'Торговля оптовая водопроводным и отопительным оборудованием и санитарно-технической арматурой', 'parent_id' => 1619],
    ['id' => 1622, 'name' => 'Торговля оптовая ручными инструментами', 'parent_id' => 1619],
    ['id' => 1623, 'name' => 'Торговля оптовая химическими продуктами', 'parent_id' => 1592],
    ['id' => 1625, 'name' => 'Торговля оптовая удобрениями и агрохимическими продуктами', 'parent_id' => 1623],
    ['id' => 1626, 'name' => 'Торговля оптовая промышленными химикатами', 'parent_id' => 1623],
    ['id' => 1627, 'name' => 'Торговля оптовая прочими промежуточными продуктами', 'parent_id' => 1592],
    ['id' => 1628, 'name' => 'Торговля оптовая бумагой и картоном', 'parent_id' => 1627],
    ['id' => 1629, 'name' => 'Торговля оптовая текстильными волокнами', 'parent_id' => 1627],
    ['id' => 1630, 'name' => 'Торговля оптовая пластмассами и резиной в первичных формах', 'parent_id' => 1627],
    ['id' => 1631, 'name' => 'Торговля оптовая драгоценными камнями', 'parent_id' => 1627],
    ['id' => 1632, 'name' => 'Торговля оптовая отходами и ломом', 'parent_id' => 1592],
    ['id' => 1633, 'name' => 'Торговля оптовая неспециализированная', 'parent_id' => 1407],
    [
        'id' => 1634,
        'name' => 'Торговля розничная, кроме торговли автотранспортными средствами и мотоциклами',
        'parent_id' => null,
    ],
    ['id' => 1635, 'name' => 'Торговля розничная в неспециализированных магазинах', 'parent_id' => 1634],
    ['id' => 1636, 'name' => 'Торговля розничная преимущественно пищевыми продуктами, включая напитки, и табачными изделиями в неспециализированных магазинах', 'parent_id' => 1635],
    ['id' => 1637, 'name' => 'Торговля розничная замороженными продуктами в неспециализированных магазинах', 'parent_id' => 1636],
    ['id' => 1638, 'name' => 'Торговля розничная незамороженными продуктами, включая напитки и табачные изделия, в неспециализированных магазинах', 'parent_id' => 1636],
    ['id' => 1639, 'name' => 'Деятельность по розничной торговле большим товарным ассортиментом с преобладанием продовольственных товаров в неспециализированных магазинах', 'parent_id' => 1636],
    ['id' => 1640, 'name' => 'Торговля розничная прочая в неспециализированных магазинах', 'parent_id' => 1635],
    ['id' => 1641, 'name' => 'Торговля розничная большим товарным ассортиментом с преобладанием непродовольственных товаров в неспециализированных магазинах', 'parent_id' => 1640],
    ['id' => 1642, 'name' => 'Деятельность универсальных магазинов, торгующих товарами общего ассортимента', 'parent_id' => 1640],

    ['id' => 1643, 'name' => 'Торговля розничная пищевыми продуктами, напитками и табачными изделиями в специализированных магазинах', 'parent_id' => 1634],
    ['id' => 1644, 'name' => 'Торговля розничная фруктами и овощами в специализированных магазинах', 'parent_id' => 1642],
    ['id' => 1647, 'name' => 'Торговля розничная свежими фруктами, овощами, картофелем и орехами в специализированных магазинах', 'parent_id' => 1644],
    ['id' => 1648, 'name' => 'Торговля розничная консервированными фруктами, овощами и орехами в специализированных магазинах', 'parent_id' => 1644],
    ['id' => 1649, 'name' => 'Торговля розничная мясом и мясными продуктами в специализированных магазинах', 'parent_id' => 1642],
    ['id' => 1650, 'name' => 'Торговля розничная мясом и мясом птицы, включая субпродукты в специализированных магазинах', 'parent_id' => 1649],
    ['id' => 1651, 'name' => 'Торговля розничная продуктами из мяса и мяса птицы в специализированных магазинах', 'parent_id' => 1649],
    ['id' => 1652, 'name' => 'Торговля розничная консервами из мяса и мяса птицы в специализированных магазинах', 'parent_id' => 1649],
    ['id' => 1653, 'name' => 'Торговля розничная рыбой, ракообразными и моллюсками в специализированных магазинах', 'parent_id' => 1642],
    ['id' => 1654, 'name' => 'Торговля розничная рыбой и морепродуктами в специализированных магазинах', 'parent_id' => 1653],
    ['id' => 1655, 'name' => 'Торговля розничная консервами из рыбы и морепродуктов в специализированных магазинах', 'parent_id' => 1653],
    ['id' => 1656, 'name' => 'Торговля розничная хлебом и хлебобулочными изделиями и кондитерскими изделиями в специализированных магазинах', 'parent_id' => 1642],
    ['id' => 1657, 'name' => 'Торговля розничная хлебом и хлебобулочными изделиями в специализированных магазинах', 'parent_id' => 1656],
    ['id' => 1658, 'name' => 'Торговля розничная кондитерскими изделиями в специализированных магазинах', 'parent_id' => 1656],
    ['id' => 1659, 'name' => 'Торговля розничная мучными кондитерскими изделиями в специализированных магазинах', 'parent_id' => 1658],
    ['id' => 1660, 'name' => 'Торговля розничная кондитерскими изделиями, включая шоколад, в специализированных магазинах', 'parent_id' => 1658],
    ['id' => 1661, 'name' => 'Торговля розничная мороженым и замороженными десертами в специализированных магазинах', 'parent_id' => 1656],

    [
        'id' => 1,
        'name' => '',
        'parent_id' => null,
    ],

    // [
    //     'id' => 1285,
    //     'name' => 'я люблю апельсины',
    //     'parent_id' => null,
    // ],
    // [
    //     'id' => 1286,
    //     'name' => 'я люблю ананасы',
    //     'parent_id' => 1285,
    // ],
    // [
    //     'id' => 1287,
    //     'name' => 'я люблю',
    //     'parent_id' => 1286,
    // ],

];

?>


46 - Торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами
46.1 - Торговля оптовая за вознаграждение или на договорной основе
46.11 - Деятельность агентов по оптовой торговле сельскохозяйственным сырьем, живыми животными, текстильным сырьем и полуфабрикатами
46.11.1 - Деятельность агентов по оптовой торговле живыми животными
46.11.2 - Деятельность агентов по оптовой торговле цветами и растениями
46.11.3 - Деятельность агентов по оптовой торговле прочим сельскохозяйственным сырьем, текстильным сырьем и полуфабрикатами
46.11.31 - Деятельность агентов по оптовой торговле зерном
46.11.32 - Деятельность агентов по оптовой торговле семенами, кроме семян масличных культур
46.11.33 - Деятельность агентов по оптовой торговле семенами масличных культур
46.11.34 - Деятельность агентов по оптовой торговле кормами для сельскохозяйственных животных
46.11.35 - Деятельность агентов по оптовой торговле текстильным сырьем и полуфабрикатами
46.11.39 - Деятельность агентов по оптовой торговле прочими сельскохозяйственным сырьем и сельскохозяйственными полуфабрикатами, не включенными в другие группировки
46.12 - Деятельность агентов по оптовой торговле топливом, рудами, металлами и химическими веществами
46.12.1 - Деятельность агентов по оптовой торговле твердым, жидким и газообразным топливом и связанными продуктами
46.12.2 - Деятельность агентов по оптовой торговле рудами и металлами в первичных формах
46.12.21 - Деятельность агентов по оптовой торговле рудами
46.12.22 - Деятельность агентов по оптовой торговле металлами в первичных формах
46.12.3 - Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами, удобрениями и агрохимикатами
46.12.31 - Деятельность агентов по оптовой торговле промышленными и техническими химическими веществами
46.12.32 - Деятельность агентов по оптовой торговле удобрениями и агрохимикатами
46.13 - Деятельность агентов по оптовой торговле лесоматериалами и строительными материалами
46.13.1 - Деятельность агентов по оптовой торговле лесоматериалами
46.13.2 - Деятельность агентов по оптовой торговле строительными материалами
46.14 - Деятельность агентов по оптовой торговле машинами, промышленным оборудованием, судами и летательными аппаратами
46.14.1 - Деятельность агентов по оптовой торговле вычислительной техникой, телекоммуникационным оборудованием и прочим офисным оборудованием
46.14.2 - Деятельность агентов по оптовой торговле судами, летательными аппаратами и прочими транспортными средствами, не включенными в другие группировки
46.14.9 - Деятельность агентов по оптовой торговле прочими видами машин и промышленным оборудованием
46.15 - Деятельность агентов по оптовой торговле мебелью, бытовыми товарами, скобяными, ножевыми и прочими металлическими изделиями
46.15.1 - Деятельность агентов по оптовой торговле мебелью
46.15.2 - Деятельность агентов по оптовой торговле скобяными, ножевыми и прочими бытовыми металлическими изделиями
46.15.3 - Деятельность агентов по оптовой торговле электротоварами и бытовыми электроустановочными изделиями
46.15.4 - Деятельность агентов по оптовой торговле радио- и телеаппаратурой, техническими носителями информации
46.15.9 - Деятельность агентов по оптовой торговле прочими бытовыми товарами, не включенными в другие группировки
46.16 - Деятельность агентов по оптовой торговле текстильными изделиями, одеждой, обувью, изделиями из кожи и меха
46.16.1 - Деятельность агентов по оптовой торговле текстильными изделиями
46.16.2 - Деятельность агентов по оптовой торговле одеждой, изделиями из меха и обувью
46.16.3 - Деятельность агентов по оптовой торговле изделиями из кожи и дорожными принадлежностями
46.17 - Деятельность агентов по оптовой торговле пищевыми продуктами, напитками и табачными изделиями
46.17.1 - Деятельность агентов по оптовой торговле пищевыми продуктами
46.17.2 - Деятельность агентов по оптовой торговле напитками
46.17.21 - Деятельность агентов по оптовой торговле безалкогольными напитками
46.17.22 - Деятельность агентов по оптовой торговле алкогольными напитками, кроме пива
46.17.23 - Деятельность агентов по оптовой торговле пивом
46.17.3 - Деятельность агентов по оптовой торговле табачными изделиями
46.18 - Деятельность агентов, специализирующихся на оптовой торговле прочими отдельными видами товаров
46.18.1 - Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией, изделиями, применяемыми в медицинских целях, парфюмерными и косметическими товарами, включая мыло, и чистящими средствами
46.18.11 - Деятельность агентов, специализирующихся на оптовой торговле фармацевтической продукцией
46.18.12 - Деятельность агентов, специализирующихся на оптовой торговле изделиями, применяемыми в медицинских целях
46.18.13 - Деятельность агентов, специализирующихся на оптовой торговле парфюмерными и косметическими товарами, включая мыло
46.18.14 - Деятельность агентов, специализирующихся на оптовой торговле чистящими средствами
46.18.2 - Деятельность агентов, специализирующихся на оптовой торговле играми и игрушками, спортивными товарами, велосипедами, книгами, газетами, журналами, писчебумажными и канцелярскими товарами, музыкальными инструментами, часами и ювелирными изделиями, фототоварами и оптическими товарами
46.18.3 - Деятельность агентов, специализирующихся на оптовой торговле техникой, оборудованием и инструментами, применяемыми в медицинских целях
46.18.9 - Деятельность агентов, специализирующихся на оптовой торговле товарами, не включенными в другие группировки
46.18.91 - Деятельность агентов, специализирующихся на оптовой торговле бумагой и картоном
46.18.92 - Деятельность агентов, специализирующихся на оптовой торговле древесным сырьем и необработанными лесоматериалами
46.18.93 - Деятельность агентов, специализирующихся на оптовой торговле отходами, ломом и материалами для переработки
46.18.99 - Деятельность агентов, специализирующихся на оптовой торговле прочими товарами, не включенными в другие группировки
46.19 - Деятельность агентов по оптовой торговле универсальным ассортиментом товаров
46.2 - Торговля оптовая сельскохозяйственным сырьем и живыми животными
46.21 - Торговля оптовая зерном, необработанным табаком, семенами и кормами для сельскохозяйственных животных
46.21.1 - Торговля оптовая зерном, семенами и кормами для животных
46.21.11 - Торговля оптовая зерном
46.21.12 - Торговля оптовая семенами, кроме семян масличных культур
46.21.13 - Торговля оптовая масличными семенами и маслосодержащими плодами
46.21.14 - Торговля оптовая кормами для сельскохозяйственных животных
46.21.19 - Торговля оптовая сельскохозяйственным сырьем, не включенным в другие группировки
46.21.2 - Торговля оптовая необработанным табаком
46.22 - Торговля оптовая цветами и растениями
46.23 - Торговля оптовая живыми животными
46.24 - Торговля оптовая шкурами и кожей
46.3 - Торговля оптовая пищевыми продуктами, напитками и табачными изделиями
46.31 - Торговля оптовая фруктами и овощами
46.31.1 - Торговля оптовая свежими овощами, фруктами и орехами
46.31.11 - Торговля оптовая свежим картофелем
46.31.12 - Торговля оптовая прочими свежими овощами
46.31.13 - Торговля оптовая свежими фруктами и орехами
46.31.2 - Торговля оптовая консервированными овощами, фруктами и орехами
46.32 - Торговля оптовая мясом и мясными продуктами
46.32.1 - Торговля оптовая мясом и мясом птицы, включая субпродукты
46.32.2 - Торговля оптовая продуктами из мяса и мяса птицы
46.32.3 - Торговля оптовая консервами из мяса и мяса птицы
46.33 - Торговля оптовая молочными продуктами, яйцами и пищевыми маслами и жирами
46.33.1 - Торговля оптовая молочными продуктами
46.33.2 - Торговля оптовая яйцами
46.33.3 - Торговля оптовая пищевыми маслами и жирами
46.34 - Торговля оптовая напитками
46.34.1 - Торговля оптовая соками, минеральной водой и прочими безалкогольными напитками
46.34.2 - Торговля оптовая алкогольными напитками, включая пиво и пищевой этиловый спирт
46.34.21 - Торговля оптовая алкогольными напитками, кроме пива и пищевого этилового спирта
46.34.22 - Торговля оптовая пищевым этиловым спиртом
46.34.23 - Торговля оптовая пивом
46.34.3 - Закупка вина в больших емкостях с последующим розливом в мелкую тару без переработки
46.35 - Торговля оптовая табачными изделиями
46.36 - Торговля оптовая сахаром, шоколадом и сахаристыми кондитерскими изделиями
46.36.1 - Торговля оптовая сахаром
46.36.2 - Торговля оптовая шоколадом и сахаристыми кондитерскими изделиями
46.36.3 - Торговля оптовая мучными кондитерскими изделиями
46.36.4 - Торговля оптовая хлебобулочными изделиями
46.37 - Торговля оптовая кофе, чаем, какао и пряностями
46.38 - Торговля оптовая прочими пищевыми продуктами, включая рыбу, ракообразных и моллюсков
46.38.1 - Торговля оптовая рыбой, ракообразными и моллюсками, консервами и пресервами из рыбы и морепродуктов
46.38.2 - Торговля оптовая прочими пищевыми продуктами
46.38.21 - Торговля оптовая гомогенизированными пищевыми продуктами, детским и диетическим питанием
46.38.22 - Торговля оптовая кормами для домашних животных
46.38.23 - Торговля оптовая мукой и макаронными изделиями
46.38.24 - Торговля оптовая крупами
46.38.25 - Торговля оптовая солью
46.38.26 - Торговля оптовая мороженым и замороженными десертами
46.38.29 - Торговля оптовая прочими пищевыми продуктами, не включенными в другие группировки
46.39 - Торговля оптовая неспециализированная пищевыми продуктами, напитками и табачными изделиями
46.39.1 - Торговля оптовая неспециализированная замороженными пищевыми продуктами
46.39.2 - Торговля оптовая неспециализированная незамороженными пищевыми продуктами, напитками и табачными изделиями
46.4 - Торговля оптовая непродовольственными потребительскими товарами
46.41 - Торговля оптовая текстильными изделиями
46.41.1 - Торговля оптовая текстильными изделиями, кроме текстильных галантерейных изделий
46.41.2 - Торговля оптовая галантерейными изделиями
46.42 - Торговля оптовая одеждой и обувью
46.42.1 - Торговля оптовая одеждой
46.42.11 - Торговля оптовая одеждой, включая спортивную, кроме нательного белья
46.42.12 - Торговля оптовая нательным бельем
46.42.13 - Торговля оптовая изделиями из меха
46.42.14 - Торговля оптовая аксессуарами одежды и головными уборами, кроме меховых
46.42.2 - Торговля оптовая обувью
46.43 - Торговля оптовая бытовыми электротоварами
46.43.1 - Торговля оптовая электрической бытовой техникой
46.43.2 - Торговля оптовая радио-, теле- и видеоаппаратурой и аппаратурой для цифровых видеодисков (DVD)
46.43.3 - Торговля оптовая грампластинками, аудио- и видеомагнитными лентами, компакт-дисками (CD) и цифровыми видеодисками (DVD) (кроме носителей без записей)
46.43.4 - Торговля оптовая фототоварами и оптическими товарами
46.44 - Торговля оптовая изделиями из керамики и стекла и чистящими средствами
46.44.1 - Торговля оптовая изделиями из керамики и стекла
46.44.2 - Торговля оптовая чистящими средствами
46.45 - Торговля оптовая парфюмерными и косметическими товарами
46.45.1 - Торговля оптовая парфюмерными и косметическими товарами, кроме мыла
46.45.2 - Торговля оптовая туалетным и хозяйственным мылом
46.46 - Торговля оптовая фармацевтической продукцией
46.46.1 - Торговля оптовая фармацевтической продукцией
46.46.2 - Торговля оптовая изделиями, применяемыми в медицинских целях
46.47 - Торговля оптовая мебелью, коврами и осветительным оборудованием
46.47.1 - Торговля оптовая бытовой мебелью
46.47.2 - Торговля оптовая осветительным оборудованием
46.47.3 - Торговля оптовая коврами и ковровыми изделиями
46.48 - Торговля оптовая часами и ювелирными изделиями
46.48.1 - Торговля оптовая часами
46.48.2 - Торговля оптовая ювелирными изделиями
46.49 - Торговля оптовая прочими бытовыми товарами
46.49.1 - Торговля оптовая ножевыми изделиями и бытовой металлической посудой
46.49.2 - Торговля оптовая плетеными изделиями, изделиями из пробки, бондарными изделиями и прочими бытовыми деревянными изделиями
46.49.3 - Торговля оптовая книгами, газетами и журналами, писчебумажными и канцелярскими товарами
46.49.31 - Торговля оптовая книгами
46.49.32 - Торговля оптовая газетами и журналами
46.49.33 - Торговля оптовая писчебумажными и канцелярскими товарами
46.49.4 - Торговля оптовая прочими потребительскими товарами
46.49.41 - Торговля оптовая музыкальными инструментами и нотными изданиями
46.49.42 - Торговля оптовая играми и игрушками
46.49.43 - Торговля оптовая спортивными товарами, включая велосипеды
46.49.44 - Торговля оптовая изделиями из кожи и дорожными аксессуарами
46.49.49 - Торговля оптовая прочими потребительскими товарами, не включенными в другие группировки
46.49.5 - Торговля оптовая неэлектрическими бытовыми приборами
46.5 - Торговля оптовая информационным и коммуникационным оборудованием
46.51 - Торговля оптовая компьютерами, периферийными устройствами к компьютерам и программным обеспечением
46.51.1 - Торговля оптовая компьютерами и периферийными устройствами
46.51.2 - Торговля оптовая программным обеспечением
46.52 - Торговля оптовая электронным и телекоммуникационным оборудованием и его запасными частями
46.52.1 - Торговля оптовая телекоммуникационным оборудованием и его запасными частями
46.52.2 - Торговля оптовая электронным оборудованием и его запасными частями
46.52.3 - Торговля оптовая аудио- и видеомагнитными лентами и дискетами, магнитными и оптическими дисками, компакт-дисками (CD), цифровыми видеодисками (DVD) и прочими техническими носителями информации без записей
46.6 - Торговля оптовая прочими машинами, оборудованием и принадлежностями
46.61 - Торговля оптовая машинами, оборудованием и инструментами для сельского хозяйства
46.61.1 - Торговля оптовая сельскохозяйственными и лесохозяйственными машинами, оборудованием и инструментами, включая тракторы
46.61.2 - Торговля оптовая садово-огородной техникой и инвентарем
46.62 - Торговля оптовая станками
46.62.1 - Торговля оптовая деревообрабатывающими станками
46.62.2 - Торговля оптовая металлообрабатывающими станками
46.62.3 - Торговля оптовая станками для обработки прочих материалов
46.63 - Торговля оптовая машинами и оборудованием для добычи полезных ископаемых и строительства
46.64 - Торговля оптовая машинами и оборудованием для текстильного, швейного и трикотажного производств
46.65 - Торговля оптовая офисной мебелью
46.66 - Торговля оптовая прочей офисной техникой и оборудованием
46.69 - Торговля оптовая прочими машинами и оборудованием
46.69.1 - Торговля оптовая транспортными средствами, кроме автомобилей, мотоциклов и велосипедов
46.69.2 - Торговля оптовая эксплуатационными материалами и принадлежностями машин
46.69.3 - Торговля оптовая подъемно-транспортными машинами и оборудованием
46.69.4 - Торговля оптовая машинами и оборудованием для производства пищевых продуктов, напитков и табачных изделий
46.69.5 - Торговля оптовая производственным электротехническим оборудованием, машинами, аппаратурой и материалами
46.69.6 - Торговля оптовая оружием и боеприпасами
46.69.7 - Торговля оптовая измерительными приборами и оборудованием
46.69.8 - Торговля оптовая техникой, оборудованием и инструментами, применяемыми в медицинских целях
46.69.9 - Торговля оптовая прочими машинами, приборами, аппаратурой и оборудованием общепромышленного и специального назначения
46.7 - Торговля оптовая специализированная прочая
46.71 - Торговля оптовая твердым, жидким и газообразным топливом и подобными продуктами
46.71.1 - Торговля оптовая твердым топливом
46.71.2 - Торговля оптовая моторным топливом, включая авиационный бензин
46.71.3 - Торговля оптовая нефтью
46.71.4 - Торговля оптовая природным (естественным) газом
46.71.5 - Торговля оптовая сжиженными углеводородными газами
46.71.51 - Торговля оптовая сжиженными углеводородными газами по регулируемым государством ценам (тарифам)
46.71.52 - Торговля оптовая сжиженными углеводородными газами по не регулируемым государством ценам (тарифам)
46.71.9 - Торговля оптовая прочим топливом и подобными продуктами
46.72 - Торговля оптовая металлами и металлическими рудами
46.72.1 - Торговля оптовая металлическими рудами
46.72.11 - Торговля оптовая железными рудами
46.72.12 - Торговля оптовая рудами цветных металлов
46.72.2 - Торговля оптовая металлами в первичных формах
46.72.21 - Торговля оптовая черными металлами в первичных формах
46.72.22 - Торговля оптовая цветными металлами в первичных формах, кроме драгоценных
46.72.23 - Торговля оптовая золотом и другими драгоценными металлами
46.73 - Торговля оптовая лесоматериалами, строительными материалами и санитарно-техническим оборудованием
46.73.1 - Торговля оптовая древесным сырьем и необработанными лесоматериалами
46.73.2 - Торговля оптовая пиломатериалами
46.73.3 - Торговля оптовая санитарно-техническим оборудованием
46.73.4 - Торговля оптовая лакокрасочными материалами
46.73.5 - Торговля оптовая листовым стеклом
46.73.6 - Торговля оптовая прочими строительными материалами и изделиями
46.73.7 - Торговля оптовая обоями
46.73.8 - Торговля оптовая напольными покрытиями (кроме ковров)
46.74 - Торговля оптовая скобяными изделиями, водопроводным и отопительным оборудованием и принадлежностями
46.74.1 - Торговля оптовая скобяными изделиями
46.74.2 - Торговля оптовая водопроводным и отопительным оборудованием и санитарно-технической арматурой
46.74.3 - Торговля оптовая ручными инструментами
46.75 - Торговля оптовая химическими продуктами
46.75.1 - Торговля оптовая удобрениями и агрохимическими продуктами
46.75.2 - Торговля оптовая промышленными химикатами
46.76 - Торговля оптовая прочими промежуточными продуктами
46.76.1 - Торговля оптовая бумагой и картоном
46.76.2 - Торговля оптовая текстильными волокнами
46.76.3 - Торговля оптовая пластмассами и резиной в первичных формах
46.76.4 - Торговля оптовая драгоценными камнями
46.77 - Торговля оптовая отходами и ломом
46.9 - Торговля оптовая неспециализированная
46.90 - Торговля оптовая неспециализированная
47 - Торговля розничная, кроме торговли автотранспортными средствами и мотоциклами
47.1 - Торговля розничная в неспециализированных магазинах
47.11 - Торговля розничная преимущественно пищевыми продуктами, включая напитки, и табачными изделиями в неспециализированных магазинах
47.11.1 - Торговля розничная замороженными продуктами в неспециализированных магазинах
47.11.2 - Торговля розничная незамороженными продуктами, включая напитки и табачные изделия, в неспециализированных магазинах
47.11.3 - Деятельность по розничной торговле большим товарным ассортиментом с преобладанием продовольственных товаров в неспециализированных магазинах
47.19 - Торговля розничная прочая в неспециализированных магазинах
47.19.1 - Торговля розничная большим товарным ассортиментом с преобладанием непродовольственных товаров в неспециализированных магазинах
47.19.2 - Деятельность универсальных магазинов, торгующих товарами общего ассортимента
47.2 - Торговля розничная пищевыми продуктами, напитками и табачными изделиями в специализированных магазинах
47.21 - Торговля розничная фруктами и овощами в специализированных магазинах
47.21.1 - Торговля розничная свежими фруктами, овощами, картофелем и орехами в специализированных магазинах
47.21.2 - Торговля розничная консервированными фруктами, овощами и орехами в специализированных магазинах
47.22 - Торговля розничная мясом и мясными продуктами в специализированных магазинах
47.22.1 - Торговля розничная мясом и мясом птицы, включая субпродукты в специализированных магазинах
47.22.2 - Торговля розничная продуктами из мяса и мяса птицы в специализированных магазинах
47.22.3 - Торговля розничная консервами из мяса и мяса птицы в специализированных магазинах
47.23 - Торговля розничная рыбой, ракообразными и моллюсками в специализированных магазинах
47.23.1 - Торговля розничная рыбой и морепродуктами в специализированных магазинах
47.23.2 - Торговля розничная консервами из рыбы и морепродуктов в специализированных магазинах
47.24 - Торговля розничная хлебом и хлебобулочными изделиями и кондитерскими изделиями в специализированных магазинах
47.24.1 - Торговля розничная хлебом и хлебобулочными изделиями в специализированных магазинах
47.24.2 - Торговля розничная кондитерскими изделиями в специализированных магазинах
47.24.21 - Торговля розничная мучными кондитерскими изделиями в специализированных магазинах
47.24.22 - Торговля розничная кондитерскими изделиями, включая шоколад, в специализированных магазинах
47.24.3 - Торговля розничная мороженым и замороженными десертами в специализированных магазинах
47.25 - Торговля розничная напитками в специализированных магазинах
47.25.1 - Торговля розничная алкогольными напитками, включая пиво, в специализированных магазинах
47.25.11 - Торговля розничная алкогольными напитками, кроме пива, в специализированных магазинах
47.25.12 - Торговля розничная пивом в специализированных магазинах
47.25.2 - Торговля розничная безалкогольными напитками в специализированных магазинах
47.26 - Торговля розничная табачными изделиями в специализированных магазинах
47.29 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах
47.29.1 - Торговля розничная молочными продуктами и яйцами в специализированных магазинах
47.29.11 - Торговля розничная молочными продуктами в специализированных магазинах
47.29.12 - Торговля розничная яйцами в специализированных магазинах
47.29.2 - Торговля розничная пищевыми маслами и жирами в специализированных магазинах
47.29.21 - Торговля розничная животными маслами и жирами в специализированных магазинах
47.29.22 - Торговля розничная растительными маслами в специализированных магазинах
47.29.3 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах
47.29.31 - Торговля розничная мукой и макаронными изделиями в специализированных магазинах
47.29.32 - Торговля розничная крупами в специализированных магазинах
47.29.33 - Торговля розничная сахаром в специализированных магазинах
47.29.34 - Торговля розничная солью в специализированных магазинах
47.29.35 - Торговля розничная чаем, кофе, какао в специализированных магазинах
47.29.36 - Торговля розничная гомогенизированными пищевыми продуктами, детским и диетическим питанием в специализированных магазинах
47.29.39 - Торговля розничная прочими пищевыми продуктами в специализированных магазинах, не включенными в другие группировки
47.3 - Торговля розничная моторным топливом в специализированных магазинах
47.30 - Торговля розничная моторным топливом в специализированных магазинах
47.30.1 - Торговля розничная моторным топливом в специализированных магазинах
47.30.11 - Торговля розничная бензином и дизельным топливом в специализированных магазинах
47.30.12 - Торговля розничная газом для заправки автомобилей в специализированных магазинах
47.30.2 - Торговля розничная смазочными материалами и охлаждающими жидкостями для автотранспортных средств
47.4 - Торговля розничная информационным и коммуникационным оборудованием в специализированных магазинах
47.41 - Торговля розничная компьютерами, периферийными устройствами к ним и программным обеспечением в специализированных магазинах
47.41.1 - Торговля розничная компьютерами в специализированных магазинах
47.41.2 - Торговля розничная программным обеспечением в специализированных магазинах
47.41.3 - Торговля розничная периферийными устройствами в специализированных магазинах
47.41.4 - Торговля розничная офисными машинами и оборудованием в специализированных магазинах
47.42 - Торговля розничная телекоммуникационным оборудованием, включая розничную торговлю мобильными телефонами, в специализированных магазинах
47.43 - Торговля розничная аудио- и видеотехникой в специализированных магазинах
47.5 - Торговля розничная прочими бытовыми изделиями в специализированных магазинах
47.51 - Торговля розничная текстильными изделиями в специализированных магазинах
47.51.1 - Торговля розничная текстильными изделиями в специализированных магазинах
47.51.2 - Торговля розничная галантерейными изделиями в специализированных магазинах
47.52 - Торговля розничная скобяными изделиями, лакокрасочными материалами и стеклом в специализированных магазинах
47.52.1 - Торговля розничная скобяными изделиями в специализированных магазинах
47.52.2 - Торговля розничная лакокрасочными материалами в специализированных магазинах
47.52.3 - Торговля розничная стеклом в специализированных магазинах
47.52.4 - Торговля розничная материалами и оборудованием для изготовления поделок в специализированных магазинах
47.52.5 - Торговля розничная санитарно-техническим оборудованием в специализированных магазинах
47.52.6 - Торговля розничная садово-огородной техникой и инвентарем в специализированных магазинах
47.52.7 - Торговля розничная строительными материалами, не включенными в другие группировки, в специализированных магазинах
47.52.71 - Торговля розничная пиломатериалами в специализированных магазинах
47.52.72 - Торговля розничная кирпичом в специализированных магазинах
47.52.73 - Торговля розничная металлическими и неметаллическими конструкциями в специализированных магазинах
47.52.74 - Торговля розничная сборными деревянными строениями в специализированных магазинах
47.52.79 - Торговля розничная прочими строительными материалами, не включенными в другие группировки, в специализированных магазинах
47.53 - Торговля розничная коврами, ковровыми изделиями, покрытиями для пола и стен в специализированных магазинах
47.53.1 - Торговля розничная коврами и ковровыми изделиями в специализированных магазинах
47.53.2 - Торговля розничная портьерами, тюлевыми занавесями в специализированных магазинах
47.53.3 - Торговля розничная обоями и напольными покрытиями в специализированных магазинах
47.54 - Торговля розничная бытовыми электротоварами в специализированных магазинах
47.59 - Торговля розничная мебелью, осветительными приборами и прочими бытовыми изделиями в специализированных магазинах
47.59.1 - Торговля розничная мебелью в специализированных магазинах
47.59.2 - Торговля розничная различной домашней утварью, ножевыми изделиями, посудой, изделиями из стекла и керамики, в том числе фарфора и фаянса в специализированных магазинах
47.59.3 - Торговля розничная осветительными приборами в специализированных магазинах
47.59.4 - Торговля розничная изделиями из дерева, пробки и плетеными изделиями в специализированных магазинах
47.59.5 - Торговля розничная музыкальными инструментами и нотными изданиями в специализированных магазинах
47.59.6 - Торговля розничная неэлектрическими бытовыми приборами в специализированных магазинах
47.59.7 - Торговля розничная электрическими системами охранной сигнализации, такими как запорные устройства, сейфы и хранилища
47.59.9 - Торговля розничная бытовыми изделиями и приборами, не включенными в другие группировки, в специализированных магазинах
47.6 - Торговля розничная товарами культурно-развлекательного назначения в специализированных магазинах
47.61 - Торговля розничная книгами в специализированных магазинах
47.62 - Торговля розничная газетами и канцелярскими товарами в специализированных магазинах
47.62.1 - Торговля розничная газетами и журналами в специализированных магазинах
47.62.2 - Торговля розничная писчебумажными и канцелярскими товарами в специализированных магазинах
47.63 - Торговля розничная музыкальными и видеозаписями в специализированных магазинах
47.63.1 - Торговля розничная музыкальными записями, аудиолентами, компакт-дисками и кассетами в специализированных магазинах
47.63.2 - Торговля розничная лентами и дисками без записей в специализированных магазинах
47.64 - Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах
47.64.1 - Торговля розничная спортивным оборудованием и спортивными товарами в специализированных магазинах
47.64.2 - Торговля розничная рыболовными принадлежностями в специализированных магазинах
47.64.3 - Торговля розничная туристическим снаряжением в специализированных магазинах
47.64.4 - Торговля розничная лодками в специализированных магазинах
47.64.5 - Торговля розничная велосипедами в специализированных магазинах
47.65 - Торговля розничная играми и игрушками в специализированных магазинах
47.7 - Торговля розничная прочими товарами в специализированных магазинах
47.71 - Торговля розничная одеждой в специализированных магазинах
47.71.1 - Торговля розничная мужской, женской и детской одеждой в специализированных магазинах
47.71.2 - Торговля розничная нательным бельем в специализированных магазинах
47.71.3 - Торговля розничная изделиями из меха в специализированных магазинах
47.71.4 - Торговля розничная одеждой из кожи в специализированных магазинах
47.71.5 - Торговля розничная спортивной одеждой в специализированных магазинах
47.71.6 - Торговля розничная чулочно-носочными изделиями в специализированных магазинах
47.71.7 - Торговля розничная головными уборами в специализированных магазинах
47.71.8 - Торговля розничная аксессуарами одежды (перчатками, галстуками, шарфами, ремнями, подтяжками и т. п.) в специализированных магазинах
47.72 - Торговля розничная обувью и изделиями из кожи в специализированных магазинах
47.72.1 - Торговля розничная обувью в специализированных магазинах
47.72.2 - Торговля розничная изделиями из кожи и дорожными принадлежностями в специализированных магазинах
47.73 - Торговля розничная лекарственными средствами в специализированных магазинах (аптеках)
47.74 - Торговля розничная изделиями, применяемыми в медицинских целях, ортопедическими изделиями в специализированных магазинах
47.74.1 - Торговля розничная изделиями, применяемыми в медицинских целях, в специализированных магазинах
47.74.2 - Торговля розничная ортопедическими изделиями в специализированных магазинах
47.75 - Торговля розничная косметическими и товарами личной гигиены в специализированных магазинах
47.75.1 - Торговля розничная косметическими и парфюмерными товарами, кроме мыла в специализированных магазинах
47.75.2 - Торговля розничная туалетным и хозяйственным мылом в специализированных магазинах
47.75.3 - Торговля розничная предметами личной гигиены в специализированных магазинах
47.76 - Торговля розничная цветами и другими растениями, семенами, удобрениями, домашними животными и кормами для домашних животных в специализированных магазинах
47.76.1 - Торговля розничная цветами и другими растениями, семенами и удобрениями в специализированных магазинах
47.76.2 - Торговля розничная домашними животными и кормами для домашних животных в специализированных магазинах
47.77 - Торговля розничная часами и ювелирными изделиями в специализированных магазинах
47.77.1 - Торговля розничная часами в специализированных магазинах
47.77.2 - Торговля розничная ювелирными изделиями в специализированных магазинах
47.78 - Торговля розничная прочая в специализированных магазинах
47.78.1 - Торговля розничная фотоаппаратурой, оптическими приборами и средствами измерений, кроме очков, в специализированных магазинах
47.78.2 - Торговля розничная очками, включая сборку и ремонт очков в специализированных магазинах
47.78.21 - Торговля розничная очками в специализированных магазинах
47.78.22 - Сборка и ремонт очков в специализированных магазинах
47.78.3 - Торговля розничная сувенирами, изделиями народных художественных промыслов
47.78.4 - Торговля розничная предметами культового и религиозного назначения, похоронными принадлежностями в специализированных магазинах
47.78.5 - Деятельность коммерческих художественных галерей, торговля розничная произведениями искусства в коммерческих художественных галереях
47.78.6 - Торговля розничная бытовым жидким котельным топливом, газом в баллонах, углем, древесным топливом, топливным торфом в специализированных магазинах
47.78.61 - Торговля розничная бытовым жидким котельным топливом, углем, древесным топливом, топливным торфом в специализированных магазинах
47.78.62 - Торговля розничная газом в баллонах в специализированных магазинах по регулируемым государствам ценам (тарифам)
47.78.63 - Торговля розничная газом в баллонах в специализированных магазинах по нерегулируемым государством ценам (тарифам)
47.78.7 - Торговля розничная оружием и боеприпасами в специализированных магазинах
47.78.8 - Торговля розничная филателистическими и нумизматическими товарами в специализированных магазинах
47.78.9 - Торговля розничная непродовольственными товарами, не включенными в другие группировки, в специализированных магазинах
47.79 - Торговля розничная бывшими в употреблении товарами в магазинах
47.79.1 - Торговля розничная предметами антиквариата
47.79.2 - Торговля розничная букинистическими книгами
47.79.3 - Торговля розничная прочими бывшими в употреблении товарами
47.79.4 - Деятельность аукционных домов по розничной торговле
47.8 - Торговля розничная в нестационарных торговых объектах и на рынках
47.81 - Торговля розничная в нестационарных торговых объектах и на рынках пищевыми продуктами, напитками и табачной продукцией
47.81.1 - Торговля розничная в нестационарных торговых объектах напитками и табачной продукцией
47.81.2 - Торговля розничная на рынках пищевыми продуктами, напитками и табачной продукцией
47.82 - Торговля розничная в нестационарных торговых объектах и на рынках текстилем, одеждой и обувью
47.82.1 - Торговля розничная в нестационарных торговых объектах текстилем, одеждой и обувью
47.82.2 - Торговля розничная на рынках текстилем, одеждой и обувью
47.89 - Торговля розничная в нестационарных торговых объектах и на рынках прочими товарами
47.89.1 - Торговля розничная в нестационарных торговых объектах прочими товарами
47.89.2 - Торговля розничная на рынках прочими товарами
47.9 - Торговля розничная вне магазинов, палаток, рынков
47.91 - Торговля розничная по почте или по информационно-коммуникационной сети Интернет
47.91.1 - Торговля розничная по почте
47.91.2 - Торговля розничная, осуществляемая непосредственно при помощи информационно-коммуникационной сети Интернет
47.91.3 - Торговля розничная через Интернет-аукционы
47.91.4 - Торговля розничная, осуществляемая непосредственно при помощи телевидения, радио, телефона
47.99 - Торговля розничная прочая вне магазинов, палаток, рынков
47.99.1 - Деятельность по осуществлению прямых продаж или продаж торговыми агентами с доставкой
47.99.2 - Деятельность по осуществлению торговли через автоматы
47.99.3 - Деятельность по осуществлению прямых продаж топлива с доставкой по адресу клиента
47.99.4 - Деятельность аукционов по розничной торговле вне магазинов, за исключением продаж через Интернет-аукционы
47.99.5 - Деятельность по осуществлению розничных продаж комиссионными агентами вне магазинов
49 - Деятельность сухопутного и трубопроводного транспорта
49.1 - Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки
49.10 - Деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки
49.10.1 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении
49.10.11 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в регулируемом секторе
49.10.12 - Перевозка пассажиров железнодорожным транспортом в междугородном сообщении в нерегулируемом секторе
49.10.2 - Перевозка пассажиров железнодорожным транспортом в международном сообщении
49.2 - Деятельность железнодорожного транспорта: грузовые перевозки
49.20 - Деятельность железнодорожного транспорта: грузовые перевозки
49.20.1 - Перевозка опасных грузов
49.20.9 - Перевозка прочих грузов
49.3 - Деятельность прочего сухопутного пассажирского транспорта
49.31 - Деятельность сухопутного пассажирского транспорта: перевозки пассажиров в городском и пригородном сообщении
49.31.1 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении
49.31.11 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в регулируемом секторе
49.31.12 - Перевозка пассажиров железнодорожным транспортом в пригородном сообщении в нерегулируемом секторе
49.31.2 - Регулярные перевозки пассажиров прочим сухопутным транспортом в городском и пригородном сообщении
49.31.21 - Регулярные перевозки пассажиров автобусами в городском и пригородном сообщении
49.31.22 - Регулярные перевозки пассажиров троллейбусами в городском и пригородном сообщении
49.31.23 - Регулярные перевозки пассажиров трамваями в городском и пригородном сообщении
49.31.24 - Перевозка пассажиров метрополитеном
49.31.25 - Перевозка пассажиров фуникулерами, подвесными канатными дорогами и подъемниками, являющимися частью городской или пригородной транспортной системы
49.32 - Деятельность легкового такси и арендованных легковых автомобилей с водителем
49.39 - Деятельность прочего сухопутного пассажирского транспорта, не включенная в другие группировки
49.39.1 - Регулярные перевозки пассажиров сухопутным транспортом, кроме железнодорожного транспорта, в междугородном и международном сообщении, а также специальные перевозки (для собственных нужд)
49.39.11 - Регулярные перевозки пассажиров автобусами в междугородном сообщении
49.39.12 - Регулярные перевозки пассажиров автобусами в международном сообщении
49.39.13 - Специальные перевозки (для собственных нужд) автобусами
49.39.2 - Перевозка пассажиров фуникулерами, подвесными канатными дорогами и лыжными подъемниками, не являющимися частью внутригородской, пригородной или городской и пригородной транспортных систем
49.39.3 - Перевозки пассажиров сухопутным транспортом по заказам
49.39.31 - Перевозки пассажиров арендованными автобусами с водителем
49.39.32 - Перевозка пассажиров автобусами по туристическим или экскурсионным маршрутам
49.39.33 - Перевозка пассажиров автобусами в городском и пригородном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам
49.39.34 - Перевозка пассажиров автобусами в междугородном и международном сообщении по заказам, за исключением перевозки арендованными автобусами с водителем и по туристическим или экскурсионным маршрутам
49.39.35 - Перевозка пассажиров транспортными средствами, приводимыми в движение человеком или животными
49.39.39 - Перевозки пассажиров сухопутным транспортом прочие, не включенные в другие группировки
49.4 - Деятельность автомобильного грузового транспорта и услуги по перевозкам
49.41 - Деятельность автомобильного грузового транспорта
49.41.1 - Перевозка грузов специализированными автотранспортными средствами
49.41.2 - Перевозка грузов неспециализированными автотранспортными средствами
49.41.3 - Аренда грузового автомобильного транспорта с водителем
49.42 - Предоставление услуг по перевозкам
49.5 - Деятельность трубопроводного транспорта
49.50 - Деятельность трубопроводного транспорта
49.50.1 - Транспортирование по трубопроводам нефти и нефтепродуктов
49.50.11 - Транспортирование по трубопроводам нефти
49.50.12 - Транспортирование по трубопроводам нефтепродуктов
49.50.2 - Транспортирование по трубопроводам газа и продуктов его переработки
49.50.21 - Транспортирование по трубопроводам газа
49.50.22 - Транспортирование по трубопроводам продуктов переработки газа
49.50.3 - Сухопутная конвейерная транспортировка угля
49.50.9 - Деятельность трубопроводного транспорта прочая
50 - Деятельность водного транспорта
50.1 - Деятельность морского пассажирского транспорта
50.10 - Деятельность морского пассажирского транспорта
50.10.1 - Перевозка пассажиров морскими судами заграничного плавания
50.10.11 - Перевозка пассажиров морскими судами заграничного плавания, подчиняющимися расписанию
50.10.12 - Перевозка пассажиров морскими судами заграничного плавания, не подчиняющимися расписанию
50.10.2 - Перевозка пассажиров морскими судами каботажного плавания
50.10.21 - Перевозка пассажиров морскими судами каботажного плавания, подчиняющимися расписанию
50.10.22 - Перевозка пассажиров морскими судами каботажного плавания, не подчиняющимися расписанию
50.10.3 - Аренда морских судов заграничного и каботажного плавания для перевозки пассажиров с экипажем
50.10.31 - Аренда морских судов заграничного плавания для перевозки пассажиров с экипажем
50.10.32 - Аренда морских судов каботажного плавания для перевозки пассажиров с экипажем
50.10.39 - Аренда прочих морских судов для перевозки пассажиров с экипажем
50.2 - Деятельность морского грузового транспорта
50.20 - Деятельность морского грузового транспорта
50.20.1 - Перевозка грузов морскими судами заграничного плавания
50.20.11 - Перевозка замороженных или охлажденных грузов судами-рефрижераторами заграничного плавания
50.20.12 - Перевозка нефти морскими судами-танкерами заграничного плавания
50.20.13 - Перевозка прочих жидкостей или газов морскими судами-танкерами заграничного плавания
50.20.14 - Перевозка контейнерных грузов судами-контейнеровозами заграничного плавания
50.20.15 - Перевозка сухих сыпучих грузов морскими судами заграничного плавания
50.20.16 - Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами заграничного плавания
50.20.19 - Перевозка прочих грузов морскими судами заграничного плавания
50.20.2 - Перевозка грузов морскими судами каботажного плавания
50.20.21 - Перевозка замороженных или охлажденных грузов судами-рефрижераторами каботажного плавания
50.20.22 - Перевозка нефти морскими судами-танкерами каботажного плавания
50.20.23 - Перевозка прочих жидкостей или газов морскими судами-танкерами каботажного плавания
50.20.24 - Перевозка контейнерных грузов судами-контейнеровозами каботажного плавания
50.20.25 - Перевозка сухих сыпучих грузов морскими судами каботажного плавания
50.20.26 - Транспортирование (перевозка) ядерных материалов, радиоактивных веществ, радиационных источников, частей ядерных установок, радиоактивных отходов морскими судами каботажного плавания
50.20.29 - Перевозка прочих грузов морскими судами каботажного плавания
50.20.3 - Аренда морских судов заграничного и каботажного плавания для перевозки грузов с экипажем
50.20.31 - Аренда морских судов заграничного плавания для перевозки грузов с экипажем
50.20.32 - Аренда морских судов каботажного плавания для перевозки грузов с экипажем
50.20.4 - Буксировка и маневровые услуги, оказываемые судами заграничного и каботажного плавания
50.20.41 - Буксировка судами заграничного и каботажного плавания
50.20.42 - Деятельность по оказанию маневровых услуг судами заграничного и каботажного плавания
50.3 - Деятельность внутреннего водного пассажирского транспорта
50.30 - Деятельность внутреннего водного пассажирского транспорта
50.30.1 - Перевозка пассажиров по внутренним водным путям
50.30.2 - Аренда судов внутреннего водного транспорта для перевозки пассажиров с экипажем
50.4 - Деятельность внутреннего водного грузового транспорта
50.40 - Деятельность внутреннего водного грузового транспорта
50.40.1 - Перевозка грузов по внутренним водным путям
50.40.2 - Буксировка и маневровые услуги на внутренних водных путях
50.40.3 - Аренда судов внутреннего водного транспорта для перевозки грузов с экипажем
51 - Деятельность воздушного и космического транспорта
51.1 - Деятельность пассажирского воздушного транспорта
51.10 - Деятельность пассажирского воздушного транспорта
51.10.1 - Перевозка воздушным пассажирским транспортом, подчиняющимся расписанию
51.10.2 - Перевозка воздушным пассажирским транспортом, не подчиняющимся расписанию
51.10.3 - Аренда воздушного судна с экипажем для перевозки пассажиров
51.2 - Деятельность грузового воздушного транспорта и космического транспорта
51.21 - Деятельность грузового воздушного транспорта
51.21.1 - Перевозка воздушным грузовым транспортом, подчиняющимся расписанию
51.21.2 - Перевозка воздушным грузовым транспортом, не подчиняющимся расписанию
51.21.3 - Аренда грузовых воздушных судов с экипажем
51.22 - Деятельность космического транспорта
51.22.1 - Перевозка пассажиров космическим транспортом
51.22.2 - Перевозка грузов космическим транспортом
51.22.3 - Запуск ракет космического назначения и выведение космических объектов на орбиту
51.22.4 - Деятельность космических лабораторий
52 - Складское хозяйство и вспомогательная транспортная деятельность
52.1 - Деятельность по складированию и хранению
52.10 - Деятельность по складированию и хранению
52.10.1 - Хранение и складирование замороженных или охлажденных грузов
52.10.2 - Хранение и складирование жидких или газообразных грузов
52.10.21 - Хранение и складирование нефти и продуктов ее переработки
52.10.22 - Хранение и складирование газа и продуктов его переработки
52.10.23 - Хранение и складирование прочих жидких или газообразных грузов
52.10.3 - Хранение и складирование зерна
52.10.4 - Хранение ядерных материалов и радиоактивных веществ
52.10.9 - Хранение и складирование прочих грузов
52.2 - Деятельность транспортная вспомогательная
52.21 - Деятельность вспомогательная, связанная с сухопутным транспортом
52.21.1 - Деятельность вспомогательная, связанная с железнодорожным транспортом
52.21.11 - Предоставление железнодорожных маневровых или буксировочных услуг
52.21.12 - Деятельность железнодорожных пассажирских вокзалов и грузовых терминалов
52.21.13 - Деятельность железнодорожной инфраструктуры
52.21.19 - Деятельность вспомогательная прочая, связанная с железнодорожным транспортом
52.21.2 - Деятельность вспомогательная, связанная с автомобильным транспортом
52.21.21 - Деятельность автовокзалов и автостанций
52.21.22 - Деятельность по эксплуатации автомобильных дорог и автомагистралей
52.21.23 - Деятельность по эксплуатации мостов и тоннелей
52.21.24 - Деятельность стоянок для транспортных средств
52.21.25 - Деятельность по буксировке автотранспортных средств
52.21.29 - Деятельность вспомогательная прочая, связанная с автомобильным транспортом
52.21.3 - Деятельность вспомогательная, связанная с трубопроводным транспортом
52.22 - Деятельность вспомогательная, связанная с водным транспортом
52.22.1 - Деятельность вспомогательная, связанная с морским транспортом
52.22.11 - Деятельность инфраструктуры морских портов, включая портовые гидротехнические сооружения (причалы, морские терминалы, доки и др.)
52.22.12 - Обеспечение судоходства в морских и прибрежных водах, включая лоцманскую проводку судов
52.22.13 - Деятельность по постановке судов к причалу, осуществление швартовых операций с судами в морских портах
52.22.14 - Деятельность по навигационному обеспечению судоходства на морском транспорте
52.22.15 - Деятельность аварийно-спасательная и судоподъемная на морском транспорте
52.22.16 - Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на морском транспорте
52.22.17 - Производство водолазных работ по обслуживанию морских судов
52.22.18 - Деятельность ледокольного флота на морском транспорте
52.22.19 - Деятельность вспомогательная, связанная морским транспортом, прочая, не включенная в другие группировки
52.22.2 - Деятельность вспомогательная, связанная с внутренним водным транспортом
52.22.21 - Деятельность инфраструктуры речных портов и гидротехнических сооружений
52.22.22 - Обеспечение судоходства по внутренним водным путям, в том числе лоцманская проводка судов
52.22.23 - Деятельность по постановке судов к причалу, осуществление швартовых операций в речных портах на внутреннем водном транспорте
52.22.24 - Деятельность по навигационному обеспечению судоходства на внутреннем водном транспорте
52.22.25 - Деятельность аварийно-спасательная и судоподъемная на внутреннем водном транспорте
52.22.26 - Снабженческое (шипчандлерское) обслуживание судов, включая бункеровку судов топливом, обслуживание судов в период стоянки в портах: агентирование судов, обследовательское (сюрвейерское) обслуживание судов на внутреннем водном транспорте
52.22.27 - Производство водолазных работ по обслуживанию судов на внутреннем водном транспорте
52.22.28 - Деятельность ледокольного флота на внутреннем водном транспорте
52.22.29 - Деятельность вспомогательная, связанная с внутренним водным транспортом, прочая, не включенная в другие группировки
52.23 - Деятельность вспомогательная, связанная с воздушным и космическим транспортом
52.23.1 - Деятельность вспомогательная, связанная с воздушным транспортом
52.23.11 - Деятельность аэропортовая
52.23.12 - Обеспечение обслуживания (управления) воздушного движения
52.23.13 - Выполнение авиационных работ
52.23.19 - Деятельность вспомогательная прочая, связанная с воздушным транспортом
52.23.2 - Деятельность вспомогательная, связанная с космическим транспортом
52.23.21 - Деятельность наземных центров управления полетами космических объектов в космическом пространстве и центров (пунктов) космической связи
52.23.22 - Деятельность поисковых и аварийно-спасательных служб, в том числе по эвакуации спускаемых аппаратов (капсул), составных частей ракет космического назначения
52.23.23 - Деятельность, связанная с подготовкой космонавтов для работы непосредственно в космическом пространстве
52.23.29 - Деятельность вспомогательная прочая, связанная с космическим транспортом
52.24 - Транспортная обработка грузов
52.24.1 - Транспортная обработка контейнеров
52.24.2 - Транспортная обработка прочих грузов
52.29 - Деятельность вспомогательная прочая, связанная с перевозками
53 - Деятельность почтовой связи и курьерская деятельность
53.1 - Деятельность почтовой связи общего пользования
53.10 - Деятельность почтовой связи общего пользования
53.10.1 - Деятельность почтовой связи, связанная с пересылкой газет и других периодических изданий
53.10.2 - Деятельность почтовой связи, связанная с пересылкой письменной корреспонденции
53.10.3 - Деятельность почтовой связи, связанная с пересылкой посылочной почты
53.10.4 - Деятельность почтовой связи дополнительная
53.10.9 - Деятельность почтовой связи общего пользования прочая
53.2 - Деятельность почтовой связи прочая и курьерская деятельность
53.20 - Деятельность почтовой связи прочая и курьерская деятельность
53.20.1 - Деятельность специальной почтовой связи
53.20.2 - Деятельность фельдъегерской связи
53.20.21 - Деятельность федеральной фельдъегерской связи
53.20.22 - Деятельность фельдъегерско-почтовой связи
53.20.29 - Деятельность почтовой связи прочая, не включенная в другие группировки
53.20.3 - Деятельность курьерская
53.20.31 - Деятельность по курьерской доставке различными видами транспорта
53.20.32 - Деятельность по доставке еды на дом
53.20.39 - Деятельность курьерская прочая
55 - Деятельность по предоставлению мест для временного проживания
55.1 - Деятельность гостиниц и прочих мест для временного проживания
55.10 - Деятельность гостиниц и прочих мест для временного проживания
55.2 - Деятельность по предоставлению мест для краткосрочного проживания
55.20 - Деятельность по предоставлению мест для краткосрочного проживания
55.3 - Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах
55.30 - Деятельность по предоставлению мест для временного проживания в кемпингах, жилых автофургонах и туристических автоприцепах
55.9 - Деятельность по предоставлению прочих мест для временного проживания
55.90 - Деятельность по предоставлению прочих мест для временного проживания
56 - Деятельность по предоставлению продуктов питания и напитков
56.1 - Деятельность ресторанов и услуги по доставке продуктов питания
56.10 - Деятельность ресторанов и услуги по доставке продуктов питания
56.10.1 - Деятельность ресторанов и кафе с полным ресторанным обслуживанием, кафетериев, ресторанов быстрого питания и самообслуживания
56.10.2 - Деятельность по приготовлению и/или продаже пищи, готовой к непосредственному употреблению на месте, с транспортных средств или передвижных лавок
56.10.21 - Деятельность предприятий общественного питания с обслуживанием на вынос
56.10.22 - Деятельность передвижных продовольственных лавок по приготовлению и/или продаже пищи, готовой к употреблению
56.10.23 - Деятельность вагончиков, палаток по приготовлению и продаже мороженого
56.10.24 - Деятельность рыночных киосков и торговых палаток по приготовлению пищи
56.10.3 - Деятельность ресторанов и баров по обеспечению питанием в железнодорожных вагонах-ресторанах и на судах
56.2 - Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий и прочим видам организации питания
56.21 - Деятельность предприятий общественного питания по обслуживанию торжественных мероприятий
56.29 - Деятельность предприятий общественного питания по прочим видам организации питания
56.29.1 - Деятельность организаций общественного питания, поставляющих готовую пищу (для транспортных и строительных компаний, туристическим группам, личному составу вооруженных сил, предприятиям розничной торговли и другим группам потребителей) по договору
56.29.2 - Деятельность столовых и буфетов при предприятиях и учреждениях
56.29.3 - Деятельность по доставке продуктов питания учебным, спортивным и прочим учреждениям (по льготным ценам)
56.29.4 - Деятельность социальных столовых, буфетов или кафетериев (в офисах, больницах, школах, институтах и пр.) на основе льготных цен на питание
56.3 - Подача напитков
56.30 - Подача напитков
58 - Деятельность издательская
58.1 - Издание книг, периодических публикаций и другие виды издательской деятельности
58.11 - Издание книг
58.11.1 - Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий, в том числе для слепых, в печатном виде
58.11.2 - Издание книг, брошюр, рекламных буклетов и аналогичных изданий, включая издание словарей и энциклопедий на электронных носителях
58.11.3 - Издание атласов, карт и таблиц, в том числе для слепых, в печатном виде
58.11.4 - Издание атласов, карт и таблиц на электронных носителях
58.12 - Издание адресных справочников и списков адресатов
58.12.1 - Издание справочников в печатном виде
58.12.2 - Издание справочников на электронных носителях
58.13 - Издание газет
58.13.1 - Издание газет в печатном виде
58.13.2 - Издание газет на электронных носителях
58.14 - Издание журналов и периодических изданий
58.14.1 - Издание журналов и периодических публикаций в печатном виде
58.14.2 - Издание журналов и периодических публикаций на электронных носителях
58.19 - Виды издательской деятельности прочие
58.2 - Издание программного обеспечения
58.21 - Издание компьютерных игр
58.29 - Издание прочих программных продуктов
59 - Производство кинофильмов, видеофильмов и телевизионных программ, издание звукозаписей и нот
59.1 - Производство кинофильмов, видеофильмов и телевизионных программ
59.11 - Производство кинофильмов, видеофильмов и телевизионных программ
59.11.1 - Производство анимационных фильмов
59.11.9 - Производство прочих кинофильмов, видеофильмов и телевизионных программ
59.12 - Деятельность монтажно-компоновочная в области производства кинофильмов, видеофильмов и телевизионных программ
59.13 - Деятельность по распространению кинофильмов, видеофильмов и телевизионных программ
59.14 - Деятельность в области демонстрации кинофильмов
59.2 - Деятельность в области звукозаписи и издания музыкальных произведений
59.20 - Деятельность в области звукозаписи и издания музыкальных произведений
59.20.1 - Издание аудиовизуальных произведений на магнитных, электронных и цифровых носителях
59.20.2 - Деятельность студий звукозаписи
59.20.3 - Издание музыкальных и нотных тетрадей, в том числе для слепых
60 - Деятельность в области телевизионного и радиовещания
60.1 - Деятельность в области радиовещания
60.10 - Деятельность в области радиовещания
60.2 - Деятельность в области телевизионного вещания
60.20 - Деятельность в области телевизионного вещания
61 - Деятельность в сфере телекоммуникаций
61.1 - Деятельность в области связи на базе проводных технологий
61.10 - Деятельность в области связи на базе проводных технологий
61.10.1 - Деятельность по предоставлению услуг телефонной связи
61.10.2 - Деятельность по предоставлению услуг по передаче данных для целей передачи голосовой информации (IР-телефония)
61.10.3 - Деятельность по предоставлению услуг по передаче данных и услуг доступа к информационно-коммуникационной сети Интернет
61.10.4 - Деятельность в области документальной электросвязи
61.10.5 - Деятельность по трансляции телерадиоканалов по сетям кабельного телерадиовещания
61.10.6 - Деятельность операторов связи по присоединению и пропуску трафика
61.10.8 - Деятельность операторов связи по присоединению и пропуску международного трафика
61.10.9 - Деятельность в области связи на базе проводных технологий прочая
61.2 - Деятельность в области связи на базе беспроводных технологий
61.20 - Деятельность в области связи на базе беспроводных технологий
61.20.1 - Деятельность по предоставлению услуг подвижной связи для целей передачи голоса
61.20.2 - Деятельность по предоставлению услуг подвижной связи для целей передачи данных
61.20.3 - Деятельность по предоставлению услуг подвижной связи для доступа к информационно-коммуникационной сети Интернет
61.20.4 - Деятельность по предоставлению услуг связи для целей открытого эфирного вещания
61.20.5 - Деятельность по предоставлению услуг цифрового телерадиовещания на базе беспроводных технологий
61.3 - Деятельность в области спутниковой связи
61.30 - Деятельность в области спутниковой связи
61.30.1 - Деятельность по предоставлению услуг доступа к информационно-коммуникационной сети Интернет оператором спутниковой связи
61.30.2 - Деятельность по предоставлению услуг трансляции телерадиоканалов по сетям спутникового телерадиовещания
61.9 - Деятельность в области телекоммуникаций прочая
61.90 - Деятельность в области телекоммуникаций прочая
62 - Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
62.0 - Разработка компьютерного программного обеспечения, консультационные услуги в данной области и другие сопутствующие услуги
62.01 - Разработка компьютерного программного обеспечения
62.02 - Деятельность консультативная и работы в области компьютерных технологий
62.02.1 - Деятельность по планированию, проектированию компьютерных систем
62.02.2 - Деятельность по обследованию и экспертизе компьютерных систем
62.02.3 - Деятельность по обучению пользователей
62.02.4 - Деятельность по подготовке компьютерных систем к эксплуатации
62.02.9 - Деятельность консультативная в области компьютерных технологий прочая
62.03 - Деятельность по управлению компьютерным оборудованием
62.03.1 - Деятельность по управлению компьютерными системами
62.03.11 - Деятельность по управлению компьютерными системами непосредственно
62.03.12 - Деятельность по управлению компьютерными системами дистанционно
62.03.13 - Деятельность по сопровождению компьютерных систем
62.03.19 - Деятельность по управлению компьютерным оборудованием прочая, не включенная в другие группировки
62.09 - Деятельность, связанная с использованием вычислительной техники и информационных технологий, прочая
63 - Деятельность в области информационных технологий
63.1 - Деятельность по обработке данных, предоставление услуг по размещению информации, деятельность порталов в информационно-коммуникационной сети Интернет
63.11 - Деятельность по обработке данных, предоставление услуг по размещению информации и связанная с этим деятельность
63.11.1 - Деятельность по созданию и использованию баз данных и информационных ресурсов
63.11.9 - Деятельность по предоставлению услуг по размещению информации прочая
63.12 - Деятельность web-порталов
63.12.1 - Деятельность сетевых изданий
63.9 - Деятельность в области информационных услуг прочая
63.91 - Деятельность информационных агентств
63.99 - Деятельность информационных служб прочая, не включенная в другие группировки
63.99.1 - Деятельность по оказанию консультационных и информационных услуг
63.99.11 - Деятельность по оказанию компьютерных информационных услуг телефонной связи
63.99.12 - Деятельность по оказанию услуг службами информационного поиска по договору или на платной основе
63.99.2 - Деятельность по оказанию услуг по составлению обзоров новостей, услуг по подборке печатных изданий и подобной информации
64 - Деятельность по предоставлению финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
64.1 - Денежное посредничество
64.11 - Деятельность Центрального банка Российской Федерации (Банка России)
64.19 - Денежное посредничество прочее
64.2 - Деятельность холдинговых компаний
64.20 - Деятельность холдинговых компаний
64.3 - Деятельность инвестиционных фондов и аналогичных финансовых организаций
64.30 - Деятельность инвестиционных фондов и аналогичных финансовых организаций
64.9 - Деятельность по предоставлению прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению
64.91 - Деятельность по финансовой аренде (лизингу/сублизингу)
64.91.1 - Деятельность по финансовой аренде (лизингу/сублизингу) племенных животных
64.91.2 - Деятельность по финансовой аренде (лизингу/сублизингу) в прочих областях, кроме племенных животных
64.92 - Предоставление займов и прочих видов кредита
64.92.1 - Деятельность по предоставлению потребительского кредита
64.92.2 - Деятельность по предоставлению займов промышленности
64.92.3 - Деятельность по предоставлению денежных ссуд под залог недвижимого имущества
64.92.4 - Деятельность по предоставлению кредитов на покупку домов специализированными учреждениями, не принимающими депозиты
64.92.6 - Деятельность по предоставлению ломбардами краткосрочных займов под залог движимого имущества
64.92.7 - Деятельность микрофинансовая
64.99 - Предоставление прочих финансовых услуг, кроме услуг по страхованию и пенсионному обеспечению, не включенных в другие группировки
64.99.1 - Вложения в ценные бумаги
64.99.2 - Деятельность дилерская
64.99.3 - Капиталовложения в уставные капиталы, венчурное инвестирование, в том числе посредством инвестиционных компаний
64.99.4 - Заключение свопов, опционов и других срочных сделок
64.99.5 - Предоставление факторинговых услуг
64.99.6 - Деятельность по финансовой взаимопомощи
64.99.7 - Деятельность специализированного депозитария инвестиционных фондов, паевых инвестиционных фондов, негосударственных пенсионных фондов
64.99.8 - Деятельность ипотечных агентов, управляющих ипотечным покрытием; деятельность специализированных депозитариев ипотечного покрытия
64.99.9 - Деятельность жилищных накопительных кооперативов
65 - Страхование, перестрахование, деятельность негосударственных пенсионных фондов, кроме обязательного социального обеспечения
65.1 - Страхование
65.11 - Страхование жизни
65.12 - Страхование, кроме страхования жизни
65.12.1 - Страхование медицинское
65.12.2 - Страхование имущества
65.12.3 - Страхование гражданской ответственности
65.12.4 - Страхование от несчастных случаев и болезней
65.12.5 - Страхование рисков
65.12.6 - Страхование для путешественника, выезжающего за пределы постоянного проживания
65.12.9 - Прочие виды страхования, не включенные в другие группировки
65.2 - Перестрахование
65.20 - Перестрахование
65.3 - Деятельность негосударственных пенсионных фондов
65.30 - Деятельность негосударственных пенсионных фондов
66 - Деятельность вспомогательная в сфере финансовых услуг и страхования
66.1 - Деятельность вспомогательная в сфере финансовых услуг, кроме страхования и пенсионного обеспечения
66.11 - Управление финансовыми рынками
66.11.1 - Деятельность по организации торговли на финансовых рынках
66.11.2 - Управление и контроль за деятельностью фондовых, товарных, валютных и валютнофондовых бирж
66.11.3 - Деятельность регистраторов по ведению реестра владельцев ценных бумаг
66.11.4 - Деятельность по обеспечению эффективности функционирования финансовых рынков
66.11.5 - Деятельность по определению взаимных обязательств (клиринг)
66.12 - Деятельность брокерская по сделкам с ценными бумагами и товарами
66.12.1 - Деятельность биржевых посредников и биржевых брокеров, совершающих товарные фьючерсные и опционные сделки в биржевой торговле
66.12.2 - Деятельность по управлению ценными бумагами
66.12.3 - Деятельность эмиссионная
66.19 - Деятельность вспомогательная прочая в сфере финансовых услуг, кроме страхования и пенсионного обеспечения
66.19.1 - Деятельность по предоставлению брокерских услуг по ипотечным операциям
66.19.3 - Деятельность по предоставлению услуг по обработке наличных денег
66.19.4 - Деятельность по предоставлению консультационных услуг по вопросам финансового посредничества
66.19.5 - Предоставление услуг по хранению ценностей, депозитарная деятельность
66.19.6 - Деятельность по приему платежей физических лиц платежными агентами
66.19.61 - Деятельность операторов по приему платежей физических лиц
66.19.62 - Деятельность платежных субагентов по приему платежей физических лиц
66.19.7 - Рейтинговая деятельность
66.2 - Деятельность вспомогательная в сфере страхования и пенсионного обеспечения
66.21 - Оценка рисков и ущерба
66.22 - Деятельность страховых агентов и брокеров
66.29 - Деятельность вспомогательная прочая в сфере страхования и пенсионного обеспечения
66.29.1 - Деятельность страховых актуариев
66.29.2 - Деятельность распорядителей спасательными работами
66.29.9 - Деятельность вспомогательная прочая в сфере страхования, кроме обязательного социального страхования
66.3 - Деятельность по управлению фондами
66.30 - Деятельность по управлению фондами
66.30.1 - Управление инвестиционными фондами
66.30.2 - Управление фондами денежного рынка
66.30.3 - Управление пенсионными накоплениями негосударственных пенсионных фондов
66.30.4 - Управление пенсионными резервами негосударственных пенсионных фондов
66.30.5 - Управление страховыми резервами субъектов страхового дела
66.30.6 - Управление на основе индивидуальных договоров доверительного управления активами
66.30.9 - Другие виды деятельности по управлению активами
68 - Операции с недвижимым имуществом
68.1 - Покупка и продажа собственного недвижимого имущества
68.10 - Покупка и продажа собственного недвижимого имущества
68.10.1 - Подготовка к продаже собственного недвижимого имущества
68.10.11 - Подготовка к продаже собственного жилого недвижимого имущества
68.10.12 - Подготовка к продаже собственного нежилого недвижимого имущества
68.10.2 - Покупка и продажа собственного недвижимого имущества
68.10.21 - Покупка и продажа собственного жилого недвижимого имущества
68.10.22 - Покупка и продажа собственных нежилых зданий и помещений
68.10.23 - Покупка и продажа земельных участков
68.2 - Аренда и управление собственным или арендованным недвижимым имуществом
68.20 - Аренда и управление собственным или арендованным недвижимым имуществом
68.20.1 - Аренда и управление собственным или арендованным жилым недвижимым имуществом
68.20.2 - Аренда и управление собственным или арендованным нежилым недвижимым имуществом
68.20.21 - Аренда и управление собственным или арендованным торговым объектом недвижимого имущества
68.20.29 - Аренда и управление собственным или арендованным прочим нежилым недвижимым имуществом
68.3 - Операции с недвижимым имуществом за вознаграждение или на договорной основе
68.31 - Деятельность агентств недвижимости за вознаграждение или на договорной основе
68.31.1 - Предоставление посреднических услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе
68.31.11 - Предоставление посреднических услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.12 - Предоставление посреднических услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.2 - Предоставление посреднических услуг по аренде недвижимого имущества за вознаграждение или на договорной основе
68.31.21 - Предоставление посреднических услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.22 - Предоставление посреднических услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.3 - Предоставление консультационных услуг при купле-продаже недвижимого имущества за вознаграждение или на договорной основе
68.31.31 - Предоставление консультационных услуг при купле-продаже жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.32 - Предоставление консультационных услуг при купле-продаже нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.4 - Предоставление консультационных услуг по аренде недвижимого имущества за вознаграждение или на договорной основе
68.31.41 - Предоставление консультационных услуг по аренде жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.42 - Предоставление консультационных услуг по аренде нежилого недвижимого имущества за вознаграждение или на договорной основе
68.31.5 - Предоставление посреднических услуг при оценке недвижимого имущества за вознаграждение или на договорной основе
68.31.51 - Предоставление посреднических услуг при оценке жилого недвижимого имущества за вознаграждение или на договорной основе
68.31.52 - Предоставление посреднических услуг при оценке нежилого недвижимого имущества за вознаграждение или на договорной основе
68.32 - Управление недвижимым имуществом за вознаграждение или на договорной основе
68.32.1 - Управление эксплуатацией жилого фонда за вознаграждение или на договорной основе
68.32.2 - Управление эксплуатацией нежилого фонда за вознаграждение или на договорной основе
68.32.3 - Деятельность по технической инвентаризации недвижимого имущества
69 - Деятельность в области права и бухгалтерского учета
69.1 - Деятельность в области права
69.10 - Деятельность в области права
69.2 - Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию
69.20 - Деятельность по оказанию услуг в области бухгалтерского учета, по проведению финансового аудита, по налоговому консультированию
69.20.1 - Деятельность по проведению финансового аудита
69.20.2 - Деятельность по оказанию услуг в области бухгалтерского учета
69.20.3 - Деятельность области налогового консультирования
70 - Деятельность головных офисов; консультирование по вопросам управления
70.1 - Деятельность головных офисов
70.10 - Деятельность головных офисов
70.10.1 - Деятельность по управлению финансово-промышленными группами
70.10.2 - Деятельность по управлению холдинг-компаниями
70.2 - Консультирование по вопросам управления
70.21 - Деятельность в сфере связей с общественностью
70.22 - Консультирование по вопросам коммерческой деятельности и управления
71 - Деятельность в области архитектуры и инженерно-технического проектирования; технических испытаний, исследований и анализа
71.1 - Деятельность в области архитектуры, инженерных изысканий и предоставление технических консультаций в этих областях
71.11 - Деятельность в области архитектуры
71.11.1 - Деятельность в области архитектуры, связанная с созданием архитектурного объекта
71.11.2 - Деятельность по территориальному планированию и планировке территории
71.11.3 - Деятельность в области ландшафтной архитектуры и консультативные услуги в области архитектуры
71.12 - Деятельность в области инженерных изысканий, инженерно-технического проектирования, управления проектами строительства, выполнения строительного контроля и авторского надзора, предоставление технических консультаций в этих областях
71.12.1 - Деятельность, связанная с инженерно-техническим проектированием, управлением проектами строительства, выполнением строительного контроля и авторского надзора
71.12.11 - Разработка проектов тепло-, водо-, газоснабжения
71.12.12 - Разработка проектов промышленных процессов и производств, относящихся к электротехнике, электронной технике, горному делу, химической технологии, машиностроению, а также в области промышленного строительства, системотехники и техники безопасности
71.12.13 - Разработка проектов по кондиционированию воздуха, холодильной технике, санитарной технике и мониторингу загрязнения окружающей среды, строительной акустике
71.12.14 - Разработка инженерно-технических проектов и контроль при строительстве и модернизации объектов использования атомной энергии
71.12.15 - Инженерные изыскания в строительстве
71.12.2 - Деятельность заказчика-застройщика, генерального подрядчика
71.12.3 - Работы геолого-разведочные, геофизические и геохимические в области изучения недр и воспроизводства минерально-сырьевой базы
71.12.4 - Деятельность геодезическая и картографическая
71.12.41 - Деятельность геодезическая, кроме создания геодезической, нивелирной и гравиметрической сетей
71.12.42 - Деятельность картографическая, кроме создания топографических карт и планов
71.12.43 - Деятельность гидрографическая изыскательская
71.12.44 - Деятельность по созданию топографических карт и планов
71.12.45 - Создание геодезической, нивелирной, гравиметрической сетей
71.12.5 - Деятельность в области гидрометеорологии и смежных с ней областях, мониторинга состояния окружающей среды, ее загрязнения
71.12.51 - Деятельность наблюдательной гидрометеорологической сети
71.12.52 - Проведение гелиофизических и геофизических работ
71.12.53 - Деятельность по мониторингу загрязнения окружающей среды для физических и юридических лиц
71.12.54 - Работы полевые и изыскания в области гидрометеорологии и смежных с ней областях, экспедиционные обследования объектов окружающей среды с целью оценки уровней загрязнения
71.12.55 - Деятельность по обработке и предоставлению гидрометеорологической информации органам государственной власти и населению
71.12.56 - Обеспечение гидрометеорологическое деятельности физических и юридических лиц
71.12.57 - Деятельность, связанная с активными воздействиями на метеорологические и геофизические процессы и явления
71.12.6 - Деятельность в области технического регулирования, стандартизации, метрологии, аккредитации, каталогизации продукции
71.12.61 - Деятельность в области технического регулирования и стандартизации
71.12.62 - Деятельность в области метрологии
71.12.63 - Деятельность в области аккредитации
71.12.64 - Государственный контроль (надзор) за соблюдением требований технических регламентов
71.12.65 - Федеральный государственный метрологический надзор
71.12.66 - Деятельность в области каталогизации продукции
71.12.7 - Кадастровая деятельность
71.12.8 - Деятельность по предоставлению инженерно-технических консультаций в сфере энергосбережения и повышения энергетической эффективности использования энергетических ресурсов
71.12.9 - Землеустройство
71.2 - Технические испытания, исследования, анализ и сертификация
71.20 - Технические испытания, исследования, анализ и сертификация
71.20.1 - Испытания и анализ состава и чистоты материалов и веществ: анализ химических и биологических свойств материалов и веществ; испытания и анализ в области гигиены питания, включая ветеринарный контроль и контроль за производством продуктов питания
71.20.2 - Судебно-экспертная деятельность
71.20.3 - Испытания и анализ физико-механических свойств материалов и веществ
71.20.4 - Испытания, исследования и анализ целостных механических и электрических систем, энергетическое обследование
71.20.5 - Технический осмотр автотранспортных средств
71.20.6 - Экспертиза проектной документации, запасов полезных ископаемых и подземных вод, геологической информации о предоставляемых в пользование участках недр, результатов инженерных изысканий
71.20.61 - Экспертиза проектной документации, запасов полезных ископаемых и подземных вод, геологической информации о предоставляемых в пользование участках недр, результатов инженерных изысканий государственная
71.20.62 - Экспертиза проектной документации и результатов инженерных изысканий негосударственная
71.20.7 - Деятельность по оценке условий труда
71.20.8 - Сертификация продукции, услуг и организаций
71.20.9 - Деятельность по техническому контролю, испытаниям и анализу прочая
72 - Научные исследования и разработки
72.1 - Научные исследования и разработки в области естественных и технических наук
72.11 - Научные исследования и разработки в области биотехнологии
72.19 - Научные исследования и разработки в области естественных и технических наук прочие
72.19.1 - Проведение фундаментальных исследований и научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии и в области ядерной оружейной продукции
72.19.11 - Проведение фундаментальных исследований, научно-исследовательских и опытно-конструкторских работ в области использования атомной энергии
72.19.12 - Научные исследования и разработки в области ядерной оружейной продукции
72.19.3 - Научные исследования и разработки в области нанотехнологий
72.19.4 - Научные исследования и разработки в области защиты информации
72.19.9 - Научные исследования и разработки в области естественных и технических наук прочие, не включенные в другие группировки
72.2 - Научные исследования и разработки в области общественных и гуманитарных наук
72.20 - Научные исследования и разработки в области общественных и гуманитарных наук
72.20.1 - Научные исследования и разработки в области общественных наук
72.20.11 - Проведение исследований в области социально-экономической географии
72.20.19 - Научные исследования и разработки в области общественных наук прочие
72.20.2 - Научные исследования и разработки в области гуманитарных наук
73 - Деятельность рекламная и исследование конъюнктуры рынка
73.1 - Деятельность рекламная
73.11 - Деятельность рекламных агентств
73.12 - Представление в средствах массовой информации
73.2 - Исследование конъюнктуры рынка и изучение общественного мнения
73.20 - Исследование конъюнктуры рынка и изучение общественного мнения
73.20.1 - Исследование конъюнктуры рынка
73.20.2 - Деятельность по изучению общественного мнения
74 - Деятельность профессиональная научная и техническая прочая
74.1 - Деятельность специализированная в области дизайна
74.10 - Деятельность специализированная в области дизайна
74.2 - Деятельность в области фотографии
74.20 - Деятельность в области фотографии
74.3 - Деятельность по письменному и устному переводу
74.30 - Деятельность по письменному и устному переводу
74.9 - Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки
74.90 - Деятельность профессиональная, научная и техническая прочая, не включенная в другие группировки
74.90.1 - Предоставление посреднических услуг по организации покупки и продажи мелких или средних коммерческих предприятий, включая профессиональную практику
74.90.2 - Деятельность, направленная на установление рыночной или иной стоимости (оценочная деятельность), кроме оценки, связанной с недвижимым имуществом или страхованием
74.90.21 - Деятельность, направленная на установление рыночной или иной стоимости отдельных материальных объектов (вещей)
74.90.22 - Деятельность, направленная на установление рыночной или иной стоимости совокупности вещей, составляющих имущество лица, в том числе имущество определенного вида (движимое или недвижимое, в том числе предприятия)
74.90.23 - Деятельность, направленная на установление рыночной или иной стоимости права собственности или иных вещных прав на имущество или отдельные вещи из состава имущества
74.90.24 - Деятельность, направленная на установление рыночной или иной стоимости прав требования, обязательств (долгов)
74.90.25 - Деятельность, направленная на установление рыночной или иной стоимости работ, услуг, информации
74.90.26 - Деятельность, направленная на установление рыночной или иной стоимости иных объектов гражданских прав, в отношении которых законодательством Российской Федерации установлена возможность их участия в гражданском обороте
74.90.3 - Предоставление консультационных услуг по вопросам безопасности
74.90.31 - Предоставление услуг по проведению оценки уязвимости объектов транспортной инфраструктуры и транспортных средств
74.90.32 - Предоставление услуг по проведению оценки уязвимости объектов промышленного назначения, связи, здравоохранения и т. д.
74.90.4 - Предоставление консультационных услуг в области сельского хозяйства
74.90.5 - Предоставление консультационных услуг в области экологии
74.90.6 - Предоставление прочих технических консультаций, деятельность консультантов, кроме архитекторов, проектировщиков и консультантов по управлению
74.90.7 - Деятельность по подготовке метеорологических прогнозов
74.90.8 - Деятельность агентств и агентов, действующих от имени физических лиц, и обычно связанную с заключением контрактов (договоров) на участие в кинофильмах, театральных постановках и других развлекательных или спортивных мероприятиях, а также с предложением книг, пьес, предметов изобразительного искусства, фотографий и аналогичных предметов издателям, продюсерам
74.90.9 - Деятельность в области защиты информации
74.90.91 - Деятельность по разработке средств защиты информации
74.90.92 - Деятельность по разработке информационных и телекоммуникационных систем, защищенных с использованием средств защиты информации
74.90.99 - Деятельность в области защиты информации прочая
75 - Деятельность ветеринарная
75.0 - Деятельность ветеринарная
75.00 - Деятельность ветеринарная
75.00.1 - Деятельность ветеринарная для сельскохозяйственных животных
75.00.2 - Деятельность ветеринарная для домашних животных
77 - Аренда и лизинг
77.1 - Аренда и лизинг автотранспортных средств
77.11 - Аренда и лизинг легковых автомобилей и легких автотранспортных средств
77.12 - Аренда и лизинг грузовых транспортных средств
77.2 - Прокат и аренда предметов личного пользования и хозяйственно-бытового назначения
77.21 - Прокат и аренда товаров для отдыха и спортивных товаров
77.22 - Прокат видеокассет и аудиокассет, грампластинок, компакт-дисков (CD), цифровых видеодисков (DVD)
77.29 - Прокат и аренда прочих предметов личного пользования и хозяйственно-бытового назначения
77.29.1 - Прокат телевизоров, радиоприемников, устройств видеозаписи, аудиозаписи и подобного оборудования
77.29.2 - Прокат мебели, электрических и неэлектрических бытовых приборов
77.29.3 - Прокат музыкальных инструментов
77.29.4 - Прокат одежды, даже если чистка таких изделий является составной частью этого вида деятельности
77.29.9 - Прокат прочих бытовых изделий и предметов личного пользования для домашних хозяйств, предприятий и организаций, не включенных в другие группировки
77.3 - Аренда и лизинг прочих машин и оборудования и материальных средств
77.31 - Аренда и лизинг сельскохозяйственных машин и оборудования
77.32 - Аренда и лизинг строительных машин и оборудования
77.33 - Аренда и лизинг офисных машин и оборудования, включая вычислительную технику
77.33.1 - Аренда и лизинг офисных машин и оборудования
77.33.2 - Аренда и лизинг вычислительных машин и оборудования
77.34 - Аренда и лизинг водных транспортных средств и оборудования
77.35 - Аренда и лизинг воздушных судов и авиационного оборудования
77.39 - Аренда и лизинг прочих видов транспорта, оборудования и материальных средств, не включенных в другие группировки
77.39.1 - Аренда и лизинг прочих сухопутных транспортных средств и оборудования
77.39.11 - Аренда и лизинг прочего автомобильного транспорта и оборудования
77.39.12 - Аренда и лизинг железнодорожного транспорта и оборудования
77.39.2 - Аренда и лизинг прочих машин и оборудования, не включенных в другие группировки
77.39.21 - Аренда и лизинг двигателей, турбин и станков
77.39.22 - Аренда и лизинг горного и нефтепромыслового оборудования
77.39.23 - Аренда и лизинг подъемно-транспортного оборудования
77.39.24 - Аренда и лизинг профессиональной радио- и телевизионной аппаратуры и аппаратуры связи
77.39.25 - Аренда и лизинг контрольно-измерительной аппаратуры
77.39.26 - Аренда и лизинг приборов, аппаратов и прочего оборудования, применяемого в медицинских целях
77.39.27 - Аренда и лизинг торгового оборудования
77.39.29 - Аренда и лизинг прочих машин и оборудования научного и промышленного назначения
77.39.3 - Аренда и лизинг племенных сельскохозяйственных животных
77.4 - Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав
77.40 - Аренда интеллектуальной собственности и подобной продукции, кроме авторских прав
78 - Деятельность по трудоустройству и подбору персонала
78.1 - Деятельность агентств по подбору персонала
78.10 - Деятельность агентств по подбору персонала
78.2 - Деятельность агентств по временному трудоустройству
78.20 - Деятельность агентств по временному трудоустройству
78.3 - Деятельность по подбору персонала прочая
78.30 - Деятельность по подбору персонала прочая
79 - Деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма
79.1 - Деятельность туристических агентств и туроператоров
79.11 - Деятельность туристических агентств
79.12 - Деятельность туроператоров
79.9 - Услуги по бронированию прочие и сопутствующая деятельность
79.90 - Услуги по бронированию прочие и сопутствующая деятельность
79.90.1 - Деятельность по предоставлению туристических информационных услуг
79.90.2 - Деятельность по предоставлению экскурсионных туристических услуг
79.90.21 - Деятельность туристических агентств по предоставлению экскурсионных туристических услуг
79.90.22 - Деятельность самостоятельных экскурсоводов и гидов по предоставлению экскурсионных туристических услуг
79.90.3 - Деятельность по предоставлению туристических услуг, связанных с бронированием
79.90.31 - Деятельность по бронированию билетов на культурно-развлекательные мероприятия
79.90.32 - Деятельность по оказанию прочих услуг, связанных со службой предварительных заказов
80 - Деятельность по обеспечению безопасности и проведению расследований
80.1 - Деятельность частных охранных служб
80.10 - Деятельность частных охранных служб
80.2 - Деятельность систем обеспечения безопасности
80.20 - Деятельность систем обеспечения безопасности
80.3 - Деятельность по расследованию
80.30 - Деятельность по расследованию
81 - Деятельность по обслуживанию зданий и территорий
81.1 - Деятельность по комплексному обслуживанию помещений
81.10 - Деятельность по комплексному обслуживанию помещений
81.2 - Деятельность по чистке и уборке
81.21 - Деятельность по общей уборке зданий
81.21.1 - Деятельность по уборке квартир и частных домов
81.21.9 - Деятельность по уборке прочих типов зданий и помещений
81.22 - Деятельность по чистке и уборке жилых зданий и нежилых помещений прочая
81.29 - Деятельность по чистке и уборке прочая
81.29.1 - Дезинфекция, дезинсекция, дератизация зданий, промышленного оборудования
81.29.2 - Подметание улиц и уборка снега
81.29.9 - Деятельность по чистке и уборке прочая, не включенная в другие группировки
81.3 - Предоставление услуг по благоустройству ландшафта
81.30 - Деятельность по благоустройству ландшафта
82 - Деятельность административно-хозяйственная, вспомогательная деятельность по обеспечению функционирования организации, деятельность по предоставлению прочих вспомогательных услуг для бизнеса
82.1 - Деятельность административно-хозяйственная и вспомогательная деятельность по обеспечению функционирования организации
82.11 - Деятельность административно-хозяйственная комплексная по обеспечению работы организации
82.19 - Деятельность по фотокопированию и подготовке документов и прочая специализированная вспомогательная деятельность по обеспечению деятельности офиса
82.2 - Деятельность центров обработки телефонных вызовов
82.20 - Деятельность центров обработки телефонных вызовов
82.3 - Деятельность по организации конференций и выставок
82.30 - Деятельность по организации конференций и выставок
82.9 - Деятельность по предоставлению вспомогательных услуг для бизнеса, не включенная в другие группировки
82.91 - Деятельность агентств по сбору платежей и бюро кредитной информации
82.92 - Деятельность по упаковыванию товаров
82.99 - Деятельность по предоставлению прочих вспомогательных услуг для бизнеса, не включенная в другие группировки
84 - Деятельность органов государственного управления по обеспечению военной безопасности, обязательному социальному обеспечению
84.1 - Деятельность органов государственного управления и местного самоуправления по вопросам общего и социально-экономического характера
84.11 - Деятельность органов государственного управления и местного самоуправления по вопросам общего характера
84.11.1 - Деятельность федеральных органов государственной власти по управлению вопросами общего характера, кроме судебной власти
84.11.11 - Деятельность федеральных органов государственной власти, кроме полномочных представителей Президента Российской Федерации и территориальных органов федеральных органов исполнительной власти
84.11.12 - Деятельность полномочных представителей Президента Российской Федерации в регионах Российской Федерации и территориальных органов федеральных органов исполнительной власти в субъектах Российской Федерации (республиках, краях, областях)
84.11.13 - Деятельность территориальных органов федеральных органов исполнительной власти в городах и районах субъектов Российской Федерации
84.11.2 - Деятельность органов государственной власти по управлению вопросами общего характера, кроме судебной власти, субъектов Российской Федерации
84.11.21 - Деятельность органов государственной власти субъектов Российской Федерации (республик, краев, областей), кроме судебной власти, представительств исполнительных органов государственной власти субъектов Российской Федерации при Президенте Российской Федерации
84.11.22 - Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в городах и районах
84.11.23 - Деятельность органов государственной власти субъектов Российской Федерации по осуществлению своих полномочий в сельских населенных пунктах
84.11.3 - Деятельность органов местного самоуправления по управлению вопросами общего характера
84.11.31 - Деятельность органов местного самоуправления сельских поселений
84.11.32 - Деятельность органов местного самоуправления городских поселений
84.11.33 - Деятельность органов местного самоуправления муниципальных районов
84.11.34 - Деятельность органов местного самоуправления муниципальных округов
84.11.35 - Деятельность органов местного самоуправления городских округов
84.11.36 - Деятельность органов местного самоуправления городских округов с внутригородским делением
84.11.37 - Деятельность органов местного самоуправления внутригородских районов
84.11.38 - Деятельность органов местного самоуправления внутригородских территорий городов федерального значения
84.11.4 - Управление финансовой деятельностью и деятельностью в сфере налогообложения
84.11.5 - Управление деятельностью в области прогнозирования и планирования
84.11.6 - Управление деятельностью в области фундаментальных исследований
84.11.7 - Управление деятельностью в области статистики
84.11.8 - Управление имуществом, находящимся в государственной собственности
84.11.9 - Управление деятельностью в области антимонопольного контроля
84.12 - Государственное регулирование деятельности в области здравоохранения, образования, социально-культурного развития и других социальных услуг, кроме социального обеспечения
84.13 - Регулирование и содействие эффективному ведению экономической деятельности предприятий
84.2 - Предоставление государственных услуг обществу
84.21 - Деятельность международная
84.22 - Деятельность, связанная с обеспечением военной безопасности
84.23 - Деятельность в области юстиции и правосудия
84.23.1 - Деятельность федеральных судов
84.23.11 - Деятельность Конституционного суда Российской Федерации
84.23.12 - Деятельность Верховного суда Российской Федерации
84.23.13 - Деятельность кассационных судов общей юрисдикции, апелляционных судов общей юрисдикции, верховных судов республик, краевых, областных судов, судов городов федерального значения, суда автономной области, судов автономных округов
84.23.14 - Деятельность районных судов
84.23.15 - Деятельность военных судов
84.23.17 - Деятельность федеральных арбитражных судов округов
84.23.18 - Деятельность арбитражных апелляционных судов, арбитражных судов субъектов Российской Федерации
84.23.19 - Деятельность специализированных судов
84.23.2 - Деятельность судов субъектов Российской Федерации
84.23.21 - Деятельность конституционных (уставных) судов
84.23.22 - Деятельность мировых судей
84.23.3 - Деятельность органов прокуратуры Российской Федерации
84.23.31 - Деятельность Генеральной прокуратуры Российской Федерации
84.23.32 - Деятельность прокуратур субъектов Российской Федерации
84.23.33 - Деятельность прокуратур городов и районов
84.23.4 - Деятельность по управлению и эксплуатации тюрем, исправительных колоний и других мест лишения свободы, а также по оказанию реабилитационной помощи бывшим заключенным
84.23.5 - Деятельность Следственного комитета Российской Федерации
84.23.51 - Деятельность центрального аппарата Следственного комитета Российской Федерации
84.23.52 - Деятельность Главного военного следственного управления, главных следственных управлений и следственных управлений Следственного комитета Российской Федерации по субъектам Российской Федерации (в том числе подразделений указанных управлений по административным округам) и приравненных к ним специализированных (в том числе военных) следственных управлений и следственных отделов Следственного комитета Российской Федерации
84.24 - Деятельность по обеспечению общественного порядка и безопасности
84.25 - Деятельность по обеспечению безопасности в чрезвычайных ситуациях; деятельность по обеспечению безопасности в области использования атомной энергии
84.25.1 - Деятельность по обеспечению пожарной безопасности
84.25.2 - Деятельность по обеспечению безопасности на водных объектах
84.25.3 - Деятельность по обеспечению безопасности в области использования атомной энергии
84.25.9 - Деятельность по обеспечению безопасности в чрезвычайных ситуациях прочая
84.3 - Деятельность в области обязательного социального обеспечения
84.30 - Деятельность в области обязательного социального обеспечения
85 - Образование
85.1 - Образование общее
85.11 - Образование дошкольное
85.12 - Образование начальное общее
85.13 - Образование основное общее
85.14 - Образование среднее общее
85.2 - Образование профессиональное
85.21 - Образование профессиональное среднее
85.22 - Образование высшее
85.22.1 - Образование высшее - бакалавриат
85.22.2 - Образование высшее - специалитет
85.22.3 - Образование высшее - магистратура
85.23 - Подготовка кадров высшей квалификации
85.3 - Обучение профессиональное
85.30 - Обучение профессиональное
85.4 - Образование дополнительное
85.41 - Образование дополнительное детей и взрослых
85.41.1 - Образование в области спорта и отдыха
85.41.2 - Образование в области культуры
85.41.9 - Образование дополнительное детей и взрослых прочее, не включенное в другие группировки
85.41.91 - Деятельность по организации отдыха детей и их оздоровления
85.42 - Образование профессиональное дополнительное
85.42.1 - Деятельность школ подготовки водителей автотранспортных средств
85.42.2 - Деятельность школ обучения вождению воздушных и плавательных судов, без выдачи коммерческих сертификатов и лицензий
85.42.9 - Деятельность по дополнительному профессиональному образованию прочая, не включенная в другие группировки
86 - Деятельность в области здравоохранения
86.1 - Деятельность больничных организаций
86.10 - Деятельность больничных организаций
86.2 - Медицинская и стоматологическая практика
86.21 - Общая врачебная практика
86.22 - Специальная врачебная практика
86.23 - Стоматологическая практика
86.9 - Деятельность в области медицины прочая
86.90 - Деятельность в области медицины прочая
86.90.1 - Деятельность организаций санитарно-эпидемиологической службы
86.90.2 - Деятельность организаций судебно-медицинской экспертизы
86.90.3 - Деятельность массажных салонов
86.90.4 - Деятельность санаторно-курортных организаций
86.90.9 - Деятельность в области медицины прочая, не включенная в другие группировки
87 - Деятельность по уходу с обеспечением проживания
87.1 - Деятельность по медицинскому уходу с обеспечением проживания
87.10 - Деятельность по медицинскому уходу с обеспечением проживания
87.2 - Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым
87.20 - Деятельность по оказанию помощи на дому для лиц с ограниченными возможностями развития, душевнобольным и наркозависимым
87.3 - Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания
87.30 - Деятельность по уходу за престарелыми и инвалидами с обеспечением проживания
87.9 - Деятельность по уходу с обеспечением проживания прочая
87.90 - Деятельность по уходу с обеспечением проживания прочая
88 - Предоставление социальных услуг без обеспечения проживания
88.1 - Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам
88.10 - Предоставление социальных услуг без обеспечения проживания престарелым и инвалидам
88.9 - Предоставление прочих социальных услуг без обеспечения проживания
88.91 - Предоставление услуг по дневному уходу за детьми
88.99 - Предоставление прочих социальных услуг без обеспечения проживания, не включенных в другие группировки
90 - Деятельность творческая, деятельность в области искусства и организации развлечений
90.0 - Деятельность творческая, деятельность в области искусства и организации развлечений
90.01 - Деятельность в области исполнительских искусств
90.02 - Деятельность вспомогательная, связанная с исполнительскими искусствами
90.03 - Деятельность в области художественного творчества
90.04 - Деятельность учреждений культуры и искусства
90.04.1 - Деятельность концертных залов, театров, оперных зданий, мюзик-холлов, включая услуги билетных касс
90.04.2 - Деятельность многоцелевых центров и подобных заведений с преобладанием культурного обслуживания
90.04.3 - Деятельность учреждений клубного типа: клубов, дворцов и домов культуры, домов народного творчества
91 - Деятельность библиотек, архивов, музеев и прочих объектов культуры
91.0 - Деятельность библиотек, архивов, музеев и прочих объектов культуры
91.01 - Деятельность библиотек и архивов
91.02 - Деятельность музеев
91.03 - Деятельность по охране исторических мест и зданий, памятников культуры
91.04 - Деятельность ботанических садов, зоопарков, государственных природных заповедников и национальных парков
91.04.1 - Деятельность зоопарков
91.04.2 - Деятельность государственных природных заповедников (в том числе биосферных)
91.04.3 - Деятельность национальных парков
91.04.4 - Деятельность природных парков
91.04.5 - Деятельность природных заказников
91.04.6 - Деятельность дендрологических парков и ботанических садов
92 - Деятельность по организации и проведению азартных игр и заключению пари, по организации и проведению лотерей
92.1 - Деятельность по организации и проведению азартных игр и заключения пари
92.11 - Деятельность казино
92.12 - Деятельность залов игровых автоматов
92.13 - Деятельность по организации заключения пари
92.2 - Деятельность по организации и проведению лотерей
92.21 - Деятельность организаторов лотерей
92.22 - Деятельность операторов лотерей
92.23 - Деятельность распространителей лотерейных билетов
93 - Деятельность в области спорта, отдыха и развлечений
93.1 - Деятельность в области спорта
93.11 - Деятельность спортивных объектов
93.12 - Деятельность спортивных клубов
93.13 - Деятельность фитнес-центров
93.19 - Деятельность в области спорта прочая
93.2 - Деятельность в области отдыха и развлечений
93.21 - Деятельность парков культуры и отдыха и тематических парков
93.29 - Деятельность зрелищно-развлекательная прочая
93.29.1 - Деятельность парков отдыха и пляжей
93.29.2 - Деятельность танцплощадок, дискотек, школ танцев
93.29.3 - Организация обрядов (свадеб, юбилеев), в т.ч. музыкальное сопровождение
93.29.9 - Деятельность зрелищно-развлекательная прочая, не включенная в другие группировки
94 - Деятельность общественных организаций
94.1 - Деятельность коммерческих, предпринимательских и профессиональных организаций
94.11 - Деятельность коммерческих и предпринимательских членских организаций
94.12 - Деятельность профессиональных членских организаций
94.2 - Деятельность профессиональных союзов
94.20 - Деятельность профессиональных союзов
94.9 - Деятельность прочих общественных организаций
94.91 - Деятельность религиозных организаций
94.92 - Деятельность политических организаций
94.99 - Деятельность прочих общественных организаций, не включенных в другие группировки
95 - Ремонт компьютеров, предметов личного потребления и хозяйственно-бытового назначения
95.1 - Ремонт компьютеров и коммуникационного оборудования
95.11 - Ремонт компьютеров и периферийного компьютерного оборудования
95.12 - Ремонт коммуникационного оборудования
95.2 - Ремонт предметов личного потребления и хозяйственно-бытового назначения
95.21 - Ремонт электронной бытовой техники
95.22 - Ремонт бытовых приборов, домашнего и садового инвентаря
95.22.1 - Ремонт бытовой техники
95.22.2 - Ремонт домашнего и садового оборудования
95.23 - Ремонт обуви и прочих изделий из кожи
95.24 - Ремонт мебели и предметов домашнего обихода
95.24.1 - Ремонт мебели
95.24.2 - Ремонт предметов домашнего обихода
95.25 - Ремонт часов и ювелирных изделий
95.25.1 - Ремонт часов
95.25.2 - Ремонт ювелирных изделий
95.29 - Ремонт прочих предметов личного потребления и бытовых товаров
95.29.1 - Ремонт одежды и текстильных изделий
95.29.11 - Ремонт одежды
95.29.12 - Ремонт текстильных изделий
95.29.13 - Ремонт трикотажных изделий
95.29.2 - Ремонт спортивного и туристского оборудования
95.29.3 - Ремонт игрушек и подобных им изделий
95.29.4 - Ремонт металлоизделий бытового и хозяйственного назначения
95.29.41 - Ремонт предметов и изделий из металла
95.29.42 - Ремонт металлической галантереи, ключей, номерных знаков, указателей улиц
95.29.43 - Заточка пил, чертежных и других инструментов, ножей, ножниц, бритв, коньков и т.п.
95.29.5 - Ремонт бытовых осветительных приборов
95.29.6 - Ремонт велосипедов
95.29.7 - Ремонт и настройка музыкальных инструментов (кроме органов и исторических музыкальных инструментов)
95.29.9 - Ремонт прочих бытовых изделий и предметов личного пользования, не вошедших в другие группировки
96 - Деятельность по предоставлению прочих персональных услуг
96.0 - Деятельность по предоставлению прочих персональных услуг
96.01 - Стирка и химическая чистка текстильных и меховых изделий
96.02 - Предоставление услуг парикмахерскими и салонами красоты
96.02.1 - Предоставление парикмахерских услуг
96.02.2 - Предоставление косметических услуг парикмахерскими и салонами красоты
96.03 - Организация похорон и представление связанных с ними услуг
96.04 - Деятельность физкультурно- оздоровительная
96.09 - Предоставление прочих персональных услуг, не включенных в другие группировки
97 - Деятельность домашних хозяйств с наемными работниками
97.0 - Деятельность домашних хозяйств с наемными работниками
97.00 - Деятельность домашних хозяйств с наемными работниками
98 - Деятельность недифференцированная частных домашних хозяйств по производству товаров и предоставлению услуг для собственного потребления
98.1 - Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления
98.10 - Деятельность недифференцированная частных домашних хозяйств по производству товаров для собственного потребления
98.2 - Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления
98.20 - Деятельность недифференцированная частных домашних хозяйств по предоставлению услуг для собственного потребления
99 - Деятельность экстерриториальных организаций и органов
99.0 - Деятельность экстерриториальных организаций и органов
99.00 - Деятельность экстерриториальных организаций и органов